[{
  "tag": "P",
  "text": "About the author-:",
  "translation": "关于作者-："
}, {
  "tag": "P",
  "text": "Ravi Rajan is a global IT program manager based out of Mumbai, India. He is also an avid blogger, Haiku poetry writer, archaeology enthusiast and history maniac. Connect with Ravi on LinkedIn, Medium and Twitter.",
  "translation": "Ravi Rajan是位于印度孟买的全球IT计划经理。 他还是一位狂热的博客作者，Hai句诗作家，考古爱好者和历史狂人。 在LinkedIn，Medium和Twitter上与Ravi联系。"
}, {
  "tag": "H1",
  "text": "Last Thoughts",
  "translation": "最后的想法"
}, {
  "tag": "P",
  "text": "So what’s a manager to do today? What’s the right answer? Should managers strive to be nice rather than tough?",
  "translation": "那么，今天的经理要做什么？ 正确的答案是什么？ 管理者应该努力做到友善而不是强硬？"
}, {
  "tag": "P",
  "text": "No. And Yes.",
  "translation": "不，是的。"
}, {
  "tag": "P",
  "text": "The fact is, leadership can’t be boiled down to one singular dimension. An HBR study found that employees who worked for a solely “tough” leader had engagement scores of 8.9%.",
  "translation": "事实是，领导能力不能归结为一个单一的维度。 HBR的一项研究发现，仅为“坚韧”领导者工作的员工的敬业度得分为8.9％。"
}, {
  "tag": "P",
  "text": "Those who worked for solely “nice” leaders had even lower scores: 6.7%. But, for those who reported working for leaders who were both tough and nice, the engagement levels rose to 68%.",
  "translation": "那些只为“好”的领导者工作的人得分更低：6.7％。 但是，对于那些报告为既坚强又友善的领导者工作的人，敬业度上升至68％。"
}, {
  "tag": "P",
  "text": "Tough and nice. Leadership isn’t just one thing. Great leaders embrace paradoxes- seemingly contradictory strengths — to achieve an internal balance.",
  "translation": "坚韧而美好。 领导不仅仅是一件事。 伟大的领导者具有悖论（看似矛盾的优势），以实现内部平衡。"
}, {
  "tag": "P",
  "text": "If they didn’t do so, one strength would get so overused so as to become a liability.",
  "translation": "如果他们不这样做，那么一种力量就会被过度使用，以至于成为一种责任。"
}, {
  "tag": "P",
  "text": "As rightly told by President Ronald Reagan",
  "translation": "正如罗纳德·里根（Ronald Reagan）总统正确说的"
}, {
  "tag": "P",
  "text": "When you can’t make them see the light, make them see the heat, that is leadership.",
  "translation": "当您无法让他们看到光明时，请让他们看到热量，即领导才能。"
}, {
  "tag": "H1",
  "text": "Craziness",
  "translation": "疯狂"
}, {
  "tag": "P",
  "text": "There is a famous quote that “you cannot argue with the crazy”. This holds good for some of the most successful leaders today. They are rebellious; they are crazy and they think they can get away with anything they think!!!",
  "translation": "有句著名的名言：“你不能与疯子争论”。 这对于当今一些最成功的领导人来说是一件好事。 他们叛逆。 他们疯了，他们认为自己可以摆脱他们所认为的一切！！！"
}, {
  "tag": "P",
  "text": "Throughout history, such leaders have made lasting change.",
  "translation": "纵观历史，这些领导人做出了持久的改变。"
}, {
  "tag": "P",
  "text": "From business innovators like Steve Jobs to social activists like Dr. Martin Luther King, Jr., such leaders can create long-lasting visions. They challenge the accepted thinking, persist through hardship and eventually produce change.",
  "translation": "从像史蒂夫·乔布斯这样的商业创新者到像小马丁·路德·金博士这样的社会活动家，这样的领导人都可以创造长久的愿景。 他们挑战公认的思想，在艰辛中坚持不懈，最终产生变化。"
}, {
  "tag": "P",
  "text": "So what do crazy leaders have in common?",
  "translation": "那么疯狂的领导者有什么共同点？"
}, {
  "tag": "P",
  "text": "· They constantly churn “out of the boxes” ideas and dole out new challenges to the team.",
  "translation": "·他们不断提出“开箱即用”的想法，并给团队带来新的挑战。"
}, {
  "tag": "P",
  "text": "· They don’t care what others think.",
  "translation": "·他们不在乎别人的想法。"
}, {
  "tag": "P",
  "text": "· They take “No” as a challenge.",
  "translation": "·他们以“否”为挑战。"
}, {
  "tag": "P",
  "text": "· They do not abide by the rules.",
  "translation": "·他们不遵守规则。"
}, {
  "tag": "P",
  "text": "· They are crazy enough to trust themselves.",
  "translation": "他们疯狂到足以信任自己。"
}, {
  "tag": "P",
  "text": "· They do not fear repeated failure.",
  "translation": "·他们不害怕反复失败。"
}, {
  "tag": "P",
  "text": "So being a little crazy is not a negative trait provided, the “big picture” of the result of the craziness is conveyed by the leader in an effective way.",
  "translation": "因此，提供一点疯狂并不是提供负面特征，领导者以有效的方式传达了疯狂结果的“全局”。"
}, {
  "tag": "H1",
  "text": "Ego",
  "translation": "自我"
}, {
  "tag": "P",
  "text": "This is one of the most misunderstood of all traits. Recently there has been so much discussion on ego-less leadership and this has led us to believe that leader should dissolve his or her ego. Our ego is the self-identity our mind constructs from what we experience, think or believe about ourselves.",
  "translation": "这是所有特征中最容易被误解的特征之一。 最近，关于无我领导力的讨论很多，这使我们相信领导者应该解散他或她的自我。 我们的自我是我们的思想根据我们对自己的经历，思考或相信而构建的自我认同。"
}, {
  "tag": "P",
  "text": "Ego carries out life’s directive to survive by adapting to adverse environmental or organizational conditions. Senior leaders often have large egos; it’s what helped them survive the trip to the top of their organization.",
  "translation": "自我通过适应不利的环境或组织条件来执行生活指令，以求生存。 高级领导者通常有很大的自负。 这是帮助他们度过组织最高层之旅的原因。"
}, {
  "tag": "P",
  "text": "So is ego good or bad?",
  "translation": "那么自我是好是坏？"
}, {
  "tag": "P",
  "text": "The answer is good if the ego is healthy.",
  "translation": "如果自我是健康的，答案是好的。"
}, {
  "tag": "P",
  "text": "A healthy ego is required in leaders to lead well and motivate teams. A healthy ego derives its strength from self-esteem and confidence which stems from knowledge, experience, and the resounding reality that “been there done that” attitude.",
  "translation": "领导者需要健康的自我，才能领导和激励团队。 一个健康的自我会从自尊和自信中获得力量，而自尊和自信则源于知识，经验和“在那里做那件事”的态度所构成的深刻现实。"
}, {
  "tag": "P",
  "text": "Confidence and self-esteem allow us to fully step into our role without being distracted by the burden of our responsibilities and to focus on the broader mission.",
  "translation": "自信和自尊使我们能够充分发挥自己的作用，而不会被责任负担分心，并专注于更广泛的使命。"
}, {
  "tag": "P",
  "text": "The bigger the leadership role, the healthier is the ego required.",
  "translation": "领导作用越大，自我要求就越健康。"
}, {
  "tag": "P",
  "text": "So what do good managers do with their healthy ego?",
  "translation": "那么好的管理者如何处理自己的健康自我呢？"
}, {
  "tag": "P",
  "text": "· They support and pay attention to all the superstars in their team and help them to win, even if it means surpassing their value.",
  "translation": "·他们支持并关注团队中的所有超级巨星，并帮助他们赢得胜利，即使这意味着超越其价值也是如此。"
}, {
  "tag": "P",
  "text": "· They empower people and produce new leaders — make themselves dispensable so that they have free time for greater things.",
  "translation": "·他们赋予人们权力并产生新的领导者-使自己不可或缺，以便他们有空闲时间从事更大的事情。"
}, {
  "tag": "P",
  "text": "· They are not controlling freaks. They value different opinions and encourage them large- heartedly.",
  "translation": "·他们没有控制怪胎。 他们重视不同的意见，并大胆地鼓励他们。"
}, {
  "tag": "P",
  "text": "· They are charismatic. Their ego never allows them to indulge in stealing credit from others or bending rules and ethics.",
  "translation": "·他们很有魅力。 他们的自我绝不允许他们沉迷于从他人那里窃取信用或违反规则和道德。"
}, {
  "tag": "P",
  "text": "· They love delegating work and watching their subordinates succeed. Their success further fuels their ego.",
  "translation": "·他们喜欢委派工作，并看着下属成功。 他们的成功进一步助长了他们的自我。"
}, {
  "tag": "H1",
  "text": "Anger",
  "translation": "愤怒"
}, {
  "tag": "P",
  "text": "Some of the most successful CEOs like Bill Gates, Larry Ellison, and Steve Jobs are reported to have huge tempers and management experts now admit that this style of functioning when handled appropriately may be hugely beneficial to employees and company as a whole.",
  "translation": "据报道，比尔·盖茨，拉里·埃里森和史蒂夫·乔布斯等一些最成功的首席执行官脾气暴躁，管理专家现在承认，适当处理这种工作方式可能对员工和整个公司都非常有利。"
}, {
  "tag": "P",
  "text": "Most of us have been taught that effective managers swallow their anger and frustration and get on with their work. But that is far away from reality. Everyone gets angry and managers are also humans only!!!",
  "translation": "我们中的大多数人都被教导说，有效的经理可以减轻他们的愤怒和沮丧，并继续他们的工作。 但这离现实还很遥远。 每个人都会生气，管理人员也是人类！！！"
}, {
  "tag": "P",
  "text": "So how does Anger help?",
  "translation": "那么，Anger有何帮助？"
}, {
  "tag": "H2",
  "text": "Anger creates a focus in the team",
  "translation": "愤怒使团队成为焦点"
}, {
  "tag": "P",
  "text": "An angry manager is bad news for the team and the team will try its best to make sure that the source of anger is eliminated as soon as possible. There is no distraction, no multi-tasking, and wishy-washy items now; there is only a strong sense of focus to get it done; that is, it.",
  "translation": "生气的经理对团队是个坏消息，团队将尽力确保尽快消除愤怒的根源。 现在，没有分心，没有多任务处理和难以洗的东西了； 只有很强的专注力才能完成它； 这就对了。"
}, {
  "tag": "H2",
  "text": "Anger ignites the innovation spark",
  "translation": "愤怒点燃了创新火花"
}, {
  "tag": "P",
  "text": "Many a time a solution which has not been working for quite some time in spite of the best efforts of the team suddenly gets fixed by an influx of ideas generated in the heat of the moment.",
  "translation": "很多时候，尽管团队尽了最大的努力，但解决方案仍未运行很长时间，但由于瞬间产生的大量想法突然被解决。"
}, {
  "tag": "P",
  "text": "The team coordinates and brainstorms together genuinely and starts coming with new ways of thinking not thought before. That is the power of an angry outburst from an effective manager.",
  "translation": "团队真正地进行了协调和头脑风暴，并开始采用前所未有的新思维方式。 这就是有效经理人发怒的力量。"
}, {
  "tag": "P",
  "text": "However, anger has to be used very carefully by the manager. A frequently angry manager loses his respect and thereby dilutes the potency of the trait.",
  "translation": "但是，经理必须非常小心地使用愤怒。 经常生气的经理会失去尊敬，从而削弱了特质的效力。"
}, {
  "tag": "H1",
  "text": "Sarcasm",
  "translation": "讽刺"
}, {
  "tag": "P",
  "text": "History has many leaders like Julius Caesar and Alexander the great who have used sarcasm very effectively to play on their people’s fears and motivate them into fighting wholeheartedly against their enemies.",
  "translation": "历史上有许多领导人，例如尤利乌斯·凯撒（Julius Caesar）和亚历山大大帝（Alexander），他们非常有效地利用讽刺来表达对人民的恐惧，并激发他们全心全意地与敌人作战。"
}, {
  "tag": "P",
  "text": "As Oscar Wilde has rightly said “Sarcasm is the lowest form of wit but the highest form of intelligence” which should be used very carefully to bring the right results.",
  "translation": "正如奥斯卡·王尔德（Oscar Wilde）正确地说的那样：“讽刺是机智的最低形式，但是智力的最高形式”，应谨慎使用，以取得正确的结果。"
}, {
  "tag": "P",
  "text": "Using sarcasm, however, is not without risks. This may be very beneficial for improving team bonding and commitment establishment provided the leader has achieved a high degree of familiarity with the team.",
  "translation": "但是，使用讽刺并非没有风险。 如果领导者对团队高度熟悉，这对于改善团队联系和建立承诺可能非常有益。"
}, {
  "tag": "P",
  "text": "Thus the right audience and the right circumstance (strike the iron while it is hot!!!) is very important for sarcasm to be effective.",
  "translation": "因此，正确的听众和正确的环境（趁热打铁！！！）对于嘲讽的产生非常重要。"
}, {
  "tag": "H1",
  "text": "Berate",
  "translation": "rate然"
}, {
  "tag": "P",
  "text": "Perhaps Steve Jobs’ style is the best example that demonstrates that everything we have learned so far about managing teams, building consensus and collaboration is wrong.",
  "translation": "也许史蒂夫·乔布斯（Steve Jobs）的风格是最好的例子，这表明我们到目前为止在管理团队，建立共识和协作方面学到的一切都是错误的。"
}, {
  "tag": "P",
  "text": "Jobs build the most valuable company in the world by ignoring traditional leadership styles. He frequently ranted, threatened and made embarrassing outbursts against his employees and rivals. He even publicly cried sometimes.",
  "translation": "乔布斯无视传统的领导风格，从而打造出了世界上最有价值的公司。 他经常对自己的员工和竞争对手大声疾呼，威胁并尴尬地爆发。 他有时甚至公开哭泣。"
}, {
  "tag": "P",
  "text": "So when can this trait work?",
  "translation": "那么什么时候才能发挥作用呢？"
}, {
  "tag": "H2",
  "text": "A consensus is not required",
  "translation": "无需达成共识"
}, {
  "tag": "P",
  "text": "The leader is the best in his field and knows what is to be done. He does not need to take buy-ins from anybody. Jobs was not interested in consensus. He didn’t care if people agreed with him. He felt that he knew better than his employees or even the consumer. He insisted on having his way.",
  "translation": "领导者是他所在领域中最好的，并且知道该怎么做。 他不需要从任何人那里买入。 乔布斯对达成共识不感兴趣。 他不在乎别人是否同意他。 他觉得他比他的雇员甚至消费者都了解。 他坚持要走自己的路。"
}, {
  "tag": "H2",
  "text": "Focus",
  "translation": "焦点"
}, {
  "tag": "P",
  "text": "The leader needs to build the focus of the team towards a select set of objectives and anything outside the focus area is just not important to the organization. Rather than explore many directions, the leader feels his job was to pare down what organization was working on and make it the best in class.",
  "translation": "领导者需要将团队的焦点建立到一组选定的目标上，而焦点领域之外的任何事情对组织而言都不重要。 这位领导者没有探索很多方向，反而觉得他的工作是削减组织工作的范围，并使之成为一流的组织。"
}, {
  "tag": "H2",
  "text": "Commitment to the vision",
  "translation": "对愿景的承诺"
}, {
  "tag": "P",
  "text": "The leader has a set defined vision in his mind and he does not need to care or think what others think as long as the goal gets accomplished. The end justifies the means. Push the team hardest possible to achieve the vision and serve the customers.",
  "translation": "领导者的脑海中有着既定的愿景，只要目标得以实现，他就无需关心或思考他人的想法。 最后证明手段。 尽最大努力推动团队实现愿景并为客户服务。"
}, {
  "tag": "H2",
  "text": "Do Nice Managers Really Finish Last?",
  "translation": "尼斯经理真的最后完成了吗？"
}, {
  "tag": "H1",
  "text": "Why a Tough Manager is the Best Manager.",
  "translation": "为什么艰难的经理是最好的经理。"
}, {
  "tag": "H2",
  "text": "Disagreeable people are more successful.",
  "translation": "令人讨厌的人更成功。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*Yu7eQ3CeqLFyT7SW7zbMLA.jpeg?q=20",
  "caption": "Image Credits: Pixabay.com",
  "type": "image",
  "file": "1*Yu7eQ3CeqLFyT7SW7zbMLA.jpeg"
}, {
  "tag": "P",
  "text": "Everybody likes to be liked.",
  "translation": "每个人都喜欢被喜欢。"
}, {
  "tag": "P",
  "text": "And unless you’re the type of manager who revels in tyranny, it’s only natural to seek the favor of your underlings. But there’s a big difference between engaging with employees and fawning over them. In an era when the virtues of a collegial and collaborative environment are widely espoused, there’s guilt associated with being a strong-handed manager.",
  "translation": "而且，除非您是那种喜欢暴政的经理，否则寻求您的下属的支持是很自然的。 但是，与员工互动和讨好员工之间有很大的不同。 在当今时代，人们一直崇尚大学和协作环境的优点，而内manager的管理者会带来罪恶感。"
}, {
  "tag": "P",
  "text": "Managers are often afraid to pull rank for fear they’ll fall out of grace with their reports and spoil team camaraderie if they’re not nice. “So many leaders, supervisors, and bosses suffer from a nice-guy conflict,” says Bruce Tulgand, author of It’s Okay to Be the Boss: The Step-by-Step Guide to Becoming the Manager Your Employees Need. “Managers are afraid that people will think they’re a jerk.”.",
  "translation": "经理们常常害怕升职，因为担心他们的表现不佳会破坏他们的报告，破坏他们的友情。 “那么多的领导人，主管和老板都遭受了好人之间的冲突，”布鲁斯·图尔甘德（Bruce Tulgand）说。 “经理们担心人们会认为自己是个混蛋。”"
}, {
  "tag": "P",
  "text": "That said, being nice is overrated. In fact, a 2011 study, “Do Nice Guys–and Gals–Really Finish Last?” posits that disagreeable people are more successful.",
  "translation": "也就是说，友善被高估了。 实际上，2011年的一项研究“好人–加尔斯–难道真的完成了吗？”认为，不同意见的人会更成功。"
}, {
  "tag": "P",
  "text": "And some of the world’s best visionaries: Steve Jobs, Elon Musk and Jeff Bezos who awed us with innovative, courageous, persistent and creative ways of building businesses are not really the nicest of managers.",
  "translation": "还有一些世界上最有远见的人：史蒂夫·乔布斯，埃隆·马斯克和杰夫·贝佐斯，他们以创新，勇敢，执着和创新的方式来建立企业深深地敬畏我们，他们并不是最优秀的管理者。"
}, {
  "tag": "P",
  "text": "And given the extraordinary success of these men, the obvious question is whether being relentlessly hard on people and even cruel, may get them to perform better.",
  "translation": "考虑到这些人的非凡成就，显而易见的问题是，不屈不挠地对待人甚至残忍地使他们表现更好。"
}, {
  "tag": "P",
  "text": "There is no clear “No” to this question but there is a systematic method in their madness. And employees, in turn, are willing to sacrifice a lot to work for a visionary. Much as Mr. Jobs was, Mr. Musk and Mr. Bezos are passionate, inspiring and charismatic leaders.",
  "translation": "这个问题没有明确的“否”，但是在他们的疯狂中有系统的方法。 反过来，员工愿意为有远见的人付出很多努力。 和乔布斯先生一样，马斯克先生和贝佐斯先生都是充满激情，鼓舞人心和超凡魅力的领导人。"
}, {
  "tag": "P",
  "text": "And here is how they do it.",
  "translation": "这就是他们的做法。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Ravi Shankar Rajan的文章《Why a Tough Manager is the Best Manager.》，参考：https://medium.com/swlh/why-a-tough-manager-is-the-best-manager-a6be9bc2ed1b)",
  "translation": "（本文翻译自Ravi Shankar Rajan的文章，《为什么一个艰难的经理是最好的经理。》，参考：https：//medium.com/swlh/why-a-tough-manager-is-the-best-manager-a6be9bc2ed1b ）"
}]