[{
  "tag": "P",
  "text": "For a once-a-month email with our best tech stories, subscribe to the Young Coder newsletter.",
  "translation": "要获取每月一次的电子邮件，其中包含我们最好的技术故事，请订阅Young Coder新闻通讯。"
}, {
  "tag": "H1",
  "text": "The 7 Habits of Highly Ineffective Programmers",
  "translation": "效率低下的程序员的7个习惯"
}, {
  "tag": "H2",
  "text": "Are you committing crimes against code?",
  "translation": "您是在违反守则行事吗？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*k0niBhe48khD5crauKym1w.png?q=20",
  "caption": "Adapted from Pixabay",
  "type": "image",
  "file": "1*k0niBhe48khD5crauKym1w.png"
}, {
  "tag": "P",
  "text": "It’s always good to refactor old code, put modified routines through rigorous tests, and brush up on the latest hot new JavaScript framework. But now it’s time to look at the other side — at the cowboy coders and corporate clock-punchers who keep alive some of the worst programming practices you’ll ever see. This is a list of the seven worst programmer rules. Sadly, you’ll regularly find them at work in the real world.",
  "translation": "重构旧代码，对修改后的例程进行严格的测试，并重新学习最新的热门JavaScript框架，这总是好事。 但是，现在该看看另一面了—牛仔编码器和公司时钟打孔器，它们使您可以看到一些最糟糕的编程实践，并且从未见过。 这是七个最差的程序员规则的列表。 可悲的是，您会经常在现实世界中找到他们。"
}, {
  "tag": "H1",
  "text": "0. Keep secrets",
  "translation": "0.保守秘密"
}, {
  "tag": "P",
  "text": "If you can’t be a 10x programmer, be a 9-lives programmer. That’s someone who’s too difficult to fire because they know the secret lore of the company app — and they don’t share.",
  "translation": "如果您不能成为10倍的程序员，请成为9人的程序员。 那是一个很难解雇的人，因为他们知道公司应用程序的秘密知识-而且他们不分享。"
}, {
  "tag": "P",
  "text": "To pull this off, be prepared. Junior devs will ask you questions. You will lead them on intricate guessing games, with occasional dismissive snorts and cryptic comments like “we’ve obfuscated that.”",
  "translation": "要做到这一点，请做好准备。 初级开发人员会问您问题。 您将带领他们进行复杂的猜谜游戏，偶尔会有不屑一听的鼻息和诸如“我们已将其混淆”之类的含蓄评论。"
}, {
  "tag": "P",
  "text": "Yes, you could share your knowledge, learn from each other, and grow together. But if the goal is maximum job security with minimum effort, your optimizing function leads here.",
  "translation": "是的，您可以分享知识，互相学习并共同成长。 但是，如果目标是用最少的精力获得最大的工作安全性，那么您的优化功能将在这里发挥领导作用。"
}, {
  "tag": "H1",
  "text": "1. If in doubt, add another design pattern",
  "translation": "1.如有疑问，请添加其他设计模式"
}, {
  "tag": "P",
  "text": "As the greybeards say, “All problems in computer science can be hidden with an extra layer of indirection.” Bolting on new bridges, adapters, proxies, facades, and factories may not solve any bugs in your code. But they will swallow them up nicely, turning your shortcoming into someone else’s problem.",
  "translation": "正如灰胡子所说的那样：“计算机科学中的所有问题都可以通过额外的间接层来隐藏。”在新的桥梁，适配器，代理，外观和工厂上加螺栓可能无法解决代码中的任何错误。 但是，它们会很好地吞并它们，从而将您的缺点变成别人的问题。"
}, {
  "tag": "P",
  "text": "Also, an obfuscated bug means you have plausible deniability. Who even knows who’s fault it is?",
  "translation": "此外，混淆的错误意味着您具有合理的可否认性。 谁甚至知道是谁的错？"
}, {
  "tag": "H1",
  "text": "2. Worship what’s new",
  "translation": "2.敬拜新消息"
}, {
  "tag": "P",
  "text": "To every thing there is a season. If you’re talking JavaScript libraries, that season may last only weeks. But no matter the tech, eventually it’s time to move on to something new.",
  "translation": "每件事都有一个季节。 如果您使用的是JavaScript库，那么这个季节可能只会持续数周。 但是，无论采用哪种技术，最终都该转向新的东西了。"
}, {
  "tag": "P",
  "text": "New technology gets everyone excited. The old stuff may still work, but overnight it’s an embarrassment. Remember “does it still work” is secondary to “does it impress anyone at conferences?”",
  "translation": "新技术使所有人兴奋。 旧的东西可能仍然有用，但是一夜之间这很尴尬。 记住“它仍然有效”是“它在会议上给任何人留下深刻印象吗？”的第二要义。"
}, {
  "tag": "P",
  "text": "If you’re clever, you can get paid to write the same software several times over, using different libraries and frameworks each time. And if you’re really nimble, you can jump to a new platform just before you have to reckon with the cost of your own spaghetti code. Constant change = a reasonable chance to outrun your bugs.",
  "translation": "如果您很聪明，可以多次编写相同的软件而获得报酬，每次使用不同的库和框架。 而且，如果您确实很敏捷，则可以在不必考虑自己的意大利面条式代码的成本之前，跳到一个新平台。 不断变化=一个合理的机会来解决您的错误。"
}, {
  "tag": "H1",
  "text": "3. Don’t let testing get in the way of more code",
  "translation": "3.不要让测试妨碍更多的代码"
}, {
  "tag": "P",
  "text": "If you want to be productive, you’ve got to wiggle those digits. Testing is definitely not productive. Do you know what is productive? Tool-assisted code generation. Spit it out. You need reams of the stuff, entire sets of data classes autogenerated based on your database schema. Next week you can change the schema and run all the tools again. Now that makes for a big commit.",
  "translation": "如果您想提高工作效率，就必须扭动这些数字。 测试绝对没有效果。 你知道什么有生产力吗？ 工具辅助的代码生成。 吐出来。 您需要大量的东西，根据数据库模式自动生成的整个数据类集。 下周，您可以更改架构并再次运行所有工具。 现在，这是一个很大的承诺。"
}, {
  "tag": "P",
  "text": "Testing is a drag on efficiency anyway. Remember, Agile programming means never needing to say you’re sorry.",
  "translation": "无论如何，测试会拖累效率。 请记住，敏捷编程意味着永远不必说对不起。"
}, {
  "tag": "H1",
  "text": "4. Write once, then don’t touch",
  "translation": "4.写一次，然后不要碰"
}, {
  "tag": "P",
  "text": "Code is unpredictable. But when it works, it’s like a delicate snowflake perched carefully atop a mid-game Jenga tower. At this point, admire your creation. But don’t risk changing anything.",
  "translation": "代码是不可预测的。 但是，当它起作用时，它就像是精致的雪花，小心翼翼地栖息在游戏中的积木塔顶上。 此时，请欣赏您的创作。 但不要冒险更改任何内容。"
}, {
  "tag": "P",
  "text": "It’s worth keeping the Pottery Barn rule of coding in mind. “If it breaks while someone else is holding it, then it’s their problem anyway.”",
  "translation": "有必要牢记Pottery Barn的编码规则。 “如果有人拿起它时摔坏了，那反正是他们的问题。”"
}, {
  "tag": "H1",
  "text": "5. If at first you don’t succeed, copy, copy and paste",
  "translation": "5.如果一开始没有成功，请复制，复制并粘贴"
}, {
  "tag": "P",
  "text": "If God (insert your favorite deity here) wanted us to suffer, he wouldn’t have put Ctrl+C on our keyboards. No problem is too hard for the right copy and paste. Your job is to cobble together a combination of keywords that will bring you a tangentially related code snippet of StackOverflow. Bring that home to your codebase, and you’ve got yourself some free code!",
  "translation": "如果上帝（在这里插入您最喜欢的神）想要我们受苦，那么他就不会在键盘上输入Ctrl + C。 对于正确的复制和粘贴，没有问题太难了。 您的工作是将关键字的组合拼凑在一起，这将为您带来与StackOverflow切线相关的代码段。 将其带入您的代码库，您便可以获得一些免费代码！"
}, {
  "tag": "H1",
  "text": "6. Comments are for suckers",
  "translation": "6.评论适用于吸盘"
}, {
  "tag": "P",
  "text": "You wrote it in the code. Why repeat it in the comments? (Only exception: If there’s a feature that’s a bit tricky to implement and rarely used, add a TODO comment and check it off your list.)",
  "translation": "您是在代码中编写的。 为什么在评论中重复它？ （唯一的例外：如果某项功能难以实现且很少使用，请添加TODO注释并从列表中将其选中。）"
}, {
  "tag": "P",
  "text": "This tactic also helps habit #0.",
  "translation": "此策略也有助于养成＃0的习惯。"
}, {
  "tag": "H1",
  "text": "7. It’s the end user’s fault",
  "translation": "7.这是最终用户的错"
}, {
  "tag": "P",
  "text": "That’s what they wanted. No, they didn’t specifically say “construct me a 10 by 6 grid of buttons to trigger different commands” (actual example from real company). But they did say all of these commands need to be accessible with one click. You’re a programmer, so you know all about logical inferences.",
  "translation": "那就是他们想要的。 不，他们没有具体说“构造一个10 x 6的按钮网格来触发不同的命令”（来自真实公司的实际示例）。 但是他们确实说所有这些命令都需要一键访问。 您是一名程序员，所以您了解逻辑推理的全部知识。"
}, {
  "tag": "P",
  "text": "If someone questions you, memorize this: Not only is this user interface the best, it’s also the only one possible based on the specs I was given. Don’t even bother to recommend changes — the client would never agree. Hold on, here’s a new feature request. We’re going to need another button.",
  "translation": "如果有人对您提出疑问，请记住以下几点：根据我给的规格，此用户界面不仅是最好的，而且也是唯一的一种。 甚至不必费心推荐更改-客户永远不会同意。 等等，这是一项新功能请求。 我们将需要另一个按钮。"
}, {
  "tag": "P",
  "text": "(If this seems like an eighth point, then let me remind you that we do base-0 counting around here. After all, how else would people recognize that we’re Real Programmers™?)",
  "translation": "（如果这看起来像八分之一，那么让我提醒您，我们在这里进行以0为底的计数。毕竟，人们还会如何认识到我们是Real Programmers™？）"
}]