[{
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*fYB4Qi7wtJ5-R3G5.jpeg?q=20",
  "caption": "The remarkable group photograph from the Fifth Solvay International Conference on Electrons and Photons in 1927 (Colorized by Marina Amaral)",
  "type": "image",
  "file": "0*fYB4Qi7wtJ5-R3G5.jpeg"
}, {
  "tag": "H2",
  "text": "History of Quantum Theory",
  "translation": "量子理论史"
}, {
  "tag": "H1",
  "text": "The Golden Age of Quantum Physics",
  "translation": "量子物理学的黄金时代"
}, {
  "tag": "H2",
  "text": "The Fifth Solvay International Conference on Electrons and Photons (1927)",
  "translation": "第五届索尔维国际电子和光子会议（1927）"
}, {
  "tag": "P",
  "text": "“The Most Intelligent Photograph Ever Taken”, as it is sometimes known, was captured during the Fifth Solvay International Conference on Electrons and Photons held in 1927 in Brussels, Belgium. The photograph is famous because it was captured in the middle of what would later be known as the “debate of the century” over the non-deterministic nature of quantum physics. Present at the conference, famously, were many of the men instrumental in devising the theories which are now considered to be at the heart of modern physics.",
  "translation": "有时被称为“有史以来最聪明的照片”是在1927年在比利时布鲁塞尔举行的第五届索尔维国际电子和光子会议上拍摄的。 这张照片之所以著名，是因为它是在量子物理学的不确定性本质下被称为“世纪之争”的中段而拍摄的。 出席会议的是著名的许多人，他们在设计理论时起了重要作用，这些理论现在被认为是现代物理学的核心。"
}, {
  "tag": "P",
  "text": "Among those present, on one side of the debate were the originators of the newly introduced quantum mechanics -paradigm, including Werner Heisenberg himself, in addition to his collaborators Wolfgang Pauli, Max Born, Hendrik Kramers, Émile de Broglie, Niels Bohr and Paul Dirac. On the other side, also present, were supporters of the classical, deterministic paradigm, represented most prominently by Albert Einstein himself, but also Max Planck, Paul Ehrenfest and Erwin Schrödinger. Of the 29 attendees at the meeting, 17 had or would go onto win the Nobel Prize in physics or chemistry. Among them was also Marie Curie who had already won both.",
  "translation": "在目前的辩论中，有一方面是新引入的量子力学范式的创始者，包括沃纳·海森堡本人，还有他的合作者沃尔夫冈·波利，麦克斯·伯恩，亨德里克·克拉默斯，埃米尔·德布罗意，埃米尔·德布罗意，尼尔斯·玻尔和保罗·狄拉克 。 另一方面，古典，确定性范式的支持者也出席了会议，其中以阿尔伯特·爱因斯坦本人，马克斯·普朗克，保罗·埃伦费斯特和欧文·施罗丁格最为突出。 在这次会议的29位参加者中，有17位已经或将继续获得诺贝尔物理学或化学奖。 其中还包括已经获得两项冠军的居里夫人。"
}, {
  "tag": "PRE",
  "text": "Nobel Laureates in PhysicsHendrik Lorentz (1902) Marie Curie (1903) Lawrence Bragg (1915) Max Planck (1918) Albert Einstein (1921) Niels Bohr (1922) Arthur Compton (1927) C.T.R. Wilson (1927) Owen Richardson (1928) Louis de Broglie (1929) Werner Heisenberg (1932) Paul Dirac (1933) Erwin Schrödinger (1933) Wolfgang Pauli (1945)Max Born (1954)Nobel Laureates in ChemistryMarie Curie (1911)Irving Langmuir (1932)Peter Debye (1936)",
  "translation": "诺贝尔物理学奖获得者亨德里克·洛伦兹（1902）玛丽·居里（1903）劳伦斯·布拉格（1915）马克斯·普朗克（1918）阿尔伯特·爱因斯坦（1921）尼尔斯·玻尔（1922）亚瑟·康普顿（1927）C.T.R. 威尔逊（1927）欧文·理查森（1928）路易斯·德布罗意（1929）维尔纳·海森堡（1932）保罗·狄拉克（1933）欧文·薛定er（1933）沃尔夫冈·保利（1945）麦克斯·波恩（1954）诺贝尔化学奖得主玛丽·居里（1911） （1932）彼得·德拜（Peter Debye）（1936）"
}, {
  "tag": "H1",
  "text": "The Fifth Solvay International Conference (1927)",
  "translation": "第五届索尔维国际会议（1927）"
}, {
  "tag": "P",
  "text": "The Fifth Solvay International Conference on Electrons and Photons was held in October 1927 in Brussels, Belgium. Continuing on since the successful inaugural conference of 1911, the Solvay gatherings are devoted to outstanding preeminent open problems in physics, and occur approximately every three years. From 1913 to 1961, every gathering revolved around open problems in quantum theory.",
  "translation": "第五届苏威国际电子和光子会议于1927年10月在比利时布鲁塞尔举行。 自1911年成功举行就职大会以来，索尔维聚会一直致力于解决物理领域杰出的杰出开放问题，大约每三年举行一次。 从1913年到1961年，每一次聚会都是围绕量子理论中的开放性问题展开的。"
}, {
  "tag": "P",
  "text": "Chaired by Hendrik Lorentz in 1927, the official topic of the conference was “photons and electrons”. In practice, the 1927 conference revolved around the growing dispute between two emerging schools of physics: those fascinated and enthralled by the new quantum mechanics introduced by Heisenberg, and those still clinging to the superseded deterministic paradigm. The former was led by Niels Bohr and the latter by Albert Einstein.",
  "translation": "会议由亨德里克·洛伦兹（Hendrik Lorentz）主持，于1927年举行，会议的正式主题是“光子和电子”。 实际上，1927年的会议围绕着两个新兴的物理学流派之间日益增长的争议展开讨论：被海森堡引入的新量子力学所迷住和迷住的，以及仍然坚持被取代的确定性范式的那些。 前者由尼尔斯·波尔（Niels Bohr）领导，后者由阿尔伯特·爱因斯坦（Albert Einstein）领导。"
}, {
  "tag": "P",
  "text": "This essay narrates the origins of this so-called “golden age of quantum physics” through the lens of the remarkable photograph above, highlighting its most influential protagonists and their views during the time of the Fifth Solvay Conference in 1927. Estimated reading time is 17 minutes.",
  "translation": "本文通过上面这张引人注目的照片的镜头叙述了所谓的“量子物理学的黄金时代”的起源，突出了其在1927年第五届索尔维会议期间最有影响力的主角及其观点。预计阅读时间为17 分钟。"
}, {
  "tag": "H1",
  "text": "The Back Row",
  "translation": "后排"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*-MAA8ga-T7YMPauqi5S7YA.png?q=20",
  "caption": "Left to Right: Auguste Piccard, Émile Henriot, Paul Ehrenfest, Édouard Herzen, Théophile de Donder, Erwin Schrödinger, J. E. Verschaffelt, Wolfgang Pauli, Werner Heisenberg, Ralph Fowler, Léon Brillouin",
  "type": "image",
  "file": "1*-MAA8ga-T7YMPauqi5S7YA.png"
}, {
  "tag": "P",
  "text": "Starting on the left side of the back row, we see several familiar faces, in addition to some who are lesser known. Auguste Piccard (1884–1962), for instance, we know as the Swiss physicist, inventor and explorer most well known for his daring, record-shattering helium-filled balloon flights and invention of the first bathyscaphe, which he used to conduct unmanned dives to explore the ocean’s depths as early as 1948. Émile Henriot (1885–1961), student of Marie Curie, was French a chemist notable for first showing that potassium and rubidium are naturally radioactive materials. Well-known close personal friend of Einstein, the Dutch-Austrian physicist Paul Ehrenfest (1880–1933), whose doctoral adviser was Ludwig Boltzmann, in his own right made major contributions to statistical mechanics and its relationship with quantum mechanics, including the theory of phase transition.",
  "translation": "从后排的左侧开始，除了一些鲜为人知的面孔外，我们还看到了一些熟悉的面孔。 例如，奥古斯特·皮卡德（Auguste Piccard，1884–1962年），我们以瑞士物理学家，发明家和探险家而闻名，他以大胆，破纪录的充氦气球飞行以及发明了第一艘深水船而闻名，他曾经进行无人潜水 最早是在1948年探索海洋的深处。埃里·亨里欧（ÉmileHenriot，1885-1961年）是玛丽·居里（Marie Curie）的学生，是法国的化学家，首先发现钾和rub是天然放射性物质。 爱因斯坦的著名亲密私人朋友，荷兰-奥地利物理学家保罗·埃伦费斯特（Paul Ehrenfest，1880–1933年），其博士生是路德维希·博尔兹曼（Ludwig Boltzmann），他对统计力学及其与量子力学的关系（包括量子力学）做出了重要贡献。 相变。"
}, {
  "tag": "P",
  "text": "Continuing rightwards, we find Édouard Herzen (1877–1936), a Belgian chemist who collaborated with the industrialist Ernest Solvay who started the conference in 1911. Jules-Émile Verschaffelt (1870–1955) and de Donder (1872–1957) were both Belgian physicists, the latter most well known for his development of correlations between the Newtonian concept of chemical affinity and the Gibbsian concept of free energy. Ralph Fowler (1889–1944) was a British physicist and astronomer from Cambridge, perhaps most well known for supervising and collaborating with Dirac on the statistical mechanics of white dwarf stars, and for introducing Dirac to quantum theory and putting Dirac and Heisenberg in touch with one another through Niels Bohr (all three were also present at the conference). Leon Brillouin (1889–1969) was a French physicist who wrote his dissertation on the quantum theory of solids and the year before the conference, independently with Gregor Wentzel (1898–1978) and Hendrik Kramers (1894–1952) developed what is now know as the Wentzel-Kramers-Brillouin approximation for finding solutions to linear differential equations with spatially varying coefficients.",
  "translation": "继续往右走，我们发现比利时化学家ÉdouardHerzen（1877–1936）与工业家Ernest Solvay合作，后者于1911年开始了该会议。Jules-ÉmileVerschaffelt（1870-1955）和de Donder（1872-1957）都是比利时人物理学家，后者以牛顿化学亲和力概念与吉布斯自由能概念之间的相关性发展而闻名。拉尔夫·福勒（Ralph Fowler，1889–1944年）是来自剑桥的英国物理学家和天文学家，也许最著名的是与狄拉克（Dirac）监督和合作研究白矮星的统计力学，并将狄拉克（Dirac）引入量子理论并使狄拉克（Dirac）和海森堡（Heisenberg）与通过Niels Bohr彼此交流（所有三个人也出席了会议）。里昂·布里渊（Leon Brillouin，1889–1969年）是法国物理学家，他在论文发表前发表了关于固体量子理论的论文，并在会议的前一年与格雷戈尔·温策尔（Gregor Wentzel，1898–1978年）和亨德里克·克拉默斯（Hendrik Kramers，1894–1952年）独立发展了作为Wentzel-Kramers-Brillouin近似，用于找到具有空间变化系数的线性微分方程的解。"
}, {
  "tag": "P",
  "text": "In addition to these brilliant men, for the purposes of our story, three last names from the back row pop out:",
  "translation": "除了这些才华横溢的人，就我们的故事而言，后排还列出了三个姓氏："
}, {
  "tag": "UL",
  "texts": ["Werner Heisenberg (1901–1976)", "Wolfgang Pauli (1900–1958)", "Edwin Schrödinger (1887–1961)"],
  "translations": ["维尔纳·海森堡（1901-1976年）", "沃尔夫冈·保利（Wolfgang Pauli，1900-1958年）", "埃德温·薛定er（1887–1961）"]
}, {
  "tag": "H2",
  "text": "Werner Heisenberg",
  "translation": "维尔纳·海森堡"
}, {
  "tag": "P",
  "text": "The 26 year old German physicist Werner Heisenberg had been the one who in his 1925 breakthrough paper Über quantentheoretische Umdeutung kinematischer und mechanischer Beziehungen (“Quantum theoretical re-interpretation of kinematic and mechanical relations”) laid the foundation for matrix mechanics, the first conceptually autonomous and logically consistent formulation of quantum mechanics.",
  "translation": "现年26岁的德国物理学家维尔纳·海森堡（Werner Heisenberg）就是他在1925年突破性论文《量子力学和机械关系的量子理论重新解释》（Uber dequantumenoretische Umdeutung kinematischer und mechanischer Beziehungen）奠定了矩阵力学的基础，这是第一个概念上自主的 以及量子力学在逻辑上一致的表述。"
}, {
  "tag": "P",
  "text": "Reportedly, Heisenberg in correspondence with Wolfgang Pauli had been working on the paper while recovering from hay fever. The purpose of the paper was to attempt to describe the energy levels of a one-dimensional anharmonic oscillator via observable parameters such as transition probabilities for quantum jumps (Segrè, 1980). Heisenberg sent the paper to Max Born in July of 1925 to review and decide whether he should submit it for publication. He did so in August of 1925, and the paper was published in Zeitschrift für Physik in September of the same year.",
  "translation": "据报道，海森堡与沃尔夫冈·波利（Wolfgang Pauli）的往来书信一直在花粉病恢复期间进行研究。 本文的目的是尝试通过诸如量子跃迁的跃迁概率之类的可观察参数来描述一维非谐振荡器的能级（Segrè，1980）。 海森堡于1925年7月将该论文发送给了马克斯·伯恩（Max Born），以进行审查并决定是否应将其提交发表。 他于1925年8月这样做，该论文于同年9月在ZeitschriftfürPhysik上发表。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*bFhNUyIUcNxTX4-ABArBjQ.png?q=20",
  "caption": "Left: Werner Heisenberg (1901–1976). Right: Heisenberg’s 1927 paper Über den anschaulichen Inhalt der quantentheoretischen Kinematik und Mechanik (“On the Descriptive Content of Quantum Kinematics and Mechanics”) where he introduced the now famous Heisenberg Uncertainty Principle.",
  "type": "image",
  "file": "1*bFhNUyIUcNxTX4-ABArBjQ.png"
}, {
  "tag": "P",
  "text": "By February two years later, Heisenberg had his next revolutionary paper Über den anschaulichen Inhalt der quantentheoretischen Kinematik und Mechanik (“On the Descriptive Content of Quantum Kinematics and Mechanics”) where he introduced the Heisenberg uncertainty principle in draft form. Reportedly, he inquired to Niels Bohr to have it forwarded to Einstein (American Institute of Physics, 1998) for review, which Bohr did.",
  "translation": "两年后的2月，海森堡发表了他的下一篇革命性论文《量子运动学和力学的描述性内容》，在那里以草稿形式介绍了海森堡不确定性原理。 据报道，他向尼尔斯·玻尔（Niels Bohr）询问是否将其转发给爱因斯坦（美国物理研究所，1998）进行审查，玻尔也这样做了。"
}, {
  "tag": "P",
  "text": "“Even in principle, we cannot know the present in all detail. For that reason everything observed is a selection from a plenitude of possibilities and a limitation on what is possible in the future…. The more precisely the position is determined, the less precisely the momentum is known in this instant, and vice versa.” — Heisenberg (1927)",
  "translation": "“即使从原则上讲，我们也无法完全了解现在。 因此，观察到的一切都是从众多可能性和对未来可能性的限制中选择的……。 确定的位置越精确，在此刻就知道的动量就越少，反之亦然。” —海森堡（1927年）"
}, {
  "tag": "P",
  "text": "Heisenberg’s uncertainty principle essentially consists of mathematical inequalities which famously assert that there are fundamental limits to the precision with which certain pairs of physical properties of particles can be known. Combined with his introduction of matrix mechanics, the publication helped Heisenberg win the 1932 Nobel Prize in Physics for nothing less than",
  "translation": "海森堡的不确定性原理主要由数学上的不等式组成，这些不等式著名地断言，对某些特定物理对粒子的精确性存在根本的限制。 结合他对矩阵力学的介绍，该出版物帮助海森堡获得了1932年诺贝尔物理学奖。"
}, {
  "tag": "P",
  "text": "“The creation of quantum mechanics” — The Nobel Committee (1932)",
  "translation": "“量子力学的创造” —诺贝尔委员会（1932年）"
}, {
  "tag": "H2",
  "text": "Wolfgang Pauli",
  "translation": "沃尔夫冈·波利"
}, {
  "tag": "P",
  "text": "Shortly after Heisenberg published his 1925 paper introducing the matrix theory of modern quantum mechanics, his collaborator, the Austrian-born Wolfgang Pauli used it to derive the observed spectrum of the hydrogen atom in his paper Über das Wasserstoffspektrum vom Standpunkt der neuen Quantenmechanik (“On the Hydrogen Spectrum from the Standpoint of the new Quantum Mechanics”) and so provide the first validation of Heisenberg’s theory. As Pauli explains in the abstract of the paper:",
  "translation": "在海森堡（Heisenberg）于1925年发表介绍现代量子力学矩阵论的论文之后不久，他的合作者，出生于奥地利的沃尔夫冈·保利（Wolfgang Pauli）在他的论文Überdas Wasserstoffspektktrum vom Standpunkt der neuen Quantenmechanik（“ 从新的量子力学的角度看氢谱”，因此为海森堡理论提供了第一个验证。 正如Pauli在论文摘要中解释的那样："
}, {
  "tag": "P",
  "text": "“It is shown that the Balmer terms of an atom with a single electron are yielded correctly by the new quantum mechanics and that the difficulties which arose in the old theory … disappear in the new theory.”",
  "translation": "“证明了具有单个电子的原子的巴尔默项可以通过新的量子力学正确产生，并且旧理论中出现的困难……在新理论中消失了。”"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*fLgBmCXRaKpmemSmDRXXKw.png?q=20",
  "caption": "Left: Wolfgang Pauli (1900–1958). Right: Pauli’s 1926 paper Über das Wasserstoffspektrum vom Standpunkt der neuen Quantenmechanik (“On the Hydrogen Spectrum from the Standpoint of the new Quantum Mechanics”) where he used Heisenberg’s matrix theory of quantum mechanics to derive the observed spectrum of the hydrogen atom",
  "type": "image",
  "file": "1*fLgBmCXRaKpmemSmDRXXKw.png"
}, {
  "tag": "P",
  "text": "About the work, Max Born would later state that from the moment of the publication of Pauli’s calculation, “there was no longer any doubt about the correctness of the theory [referring to quantum mechanics] among physicists” (Born, 1956).",
  "translation": "关于这项工作，马克斯·伯恩（Max Born）稍后会说，从保利的计算发表之时起，“物理学家对理论（指量子力学）的正确性不再有任何疑问”（Born，1956年）。"
}, {
  "tag": "H2",
  "text": "Erwin Schrödinger",
  "translation": "欧文·薛定er"
}, {
  "tag": "P",
  "text": "By the time of the conference in 1927, legendary Austrian physicist Erwin Schrödinger was 40 years old and had been a full professor for six years, first at the University of Wroclaw, then later at the University of Zürich. At the time of the conference, he had recently succeeded Max Planck at the Friedrich Wilhelm University in Berlin.",
  "translation": "到1927年会议召开时，传奇的奥地利物理学家ErwinSchrödinger已有40岁，并已成为正式教授六年，首先是弗罗茨瓦夫大学，然后是苏黎世大学。 会议召开时，他最近接替了马克斯·普朗克（Max Planck）柏林弗里德里希·威廉大学（Friedrich Wilhelm University）的职位。"
}, {
  "tag": "P",
  "text": "The name Schrödinger is now perhaps most well known for his later formulation of the popular quantum-mechanical thought experiment “Schrödinger’s cat”. His most significant contribution to physics however, was made in 1926 with the publication of his paper Quantisierung als Eigenwertproblem (“Quantization as an Eigenvalue Problem”) where Schrödinger introduced the so-called Schrödinger equation which describes the wave function of a quantum-mechanical system, and so laid the foundation for what became known as wave mechanics.",
  "translation": "现在，薛定er这个名字也许是最著名的，因为他后来提出了流行的量子力学思想实验“薛定ding的猫”。 然而，他对物理学的最重要贡献是在1926年发表了他的论文Quantisierung als Eigenwertproblem（“量化为特征值问题”），其中Schrödinger引入了所谓的Schrödinger方程，该方程描述了量子力学系统的波函数。 ，从而为后来的波动力学奠定了基础。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*2k8q-8iHZpL44AXLsae-2A.png?q=20",
  "caption": "Time-dependent Schrödinger equation where i is the imaginary unit, ħ is the reduced Planck constant, Ψ is the state vector of the quantum system, t is time and H is the Hamiltonian operator",
  "type": "image",
  "file": "1*2k8q-8iHZpL44AXLsae-2A.png"
}, {
  "tag": "P",
  "text": "Schrödinger would go on to win the 1933 Nobel Prize in Physics alongside Paul Dirac for their “discovery of new productive forms of atomic theory”.",
  "translation": "Schrödinger将与Paul Dirac一起获得“ 1933年诺贝尔物理学奖”，以表彰他们“发现了原子理论的新生产形式”。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*-pKsUQTgg2zg-3Ipj-4Lgg.png?q=20",
  "caption": "Left: Erwin Schrödinger (1887–1961). Right: Schrödinger’s 1926 paper Quantisierung als Eigenwertproblem (“Quantization as an Eigenvalue Problem”) where he presented what is now known as the Schrödinger equation",
  "type": "image",
  "file": "1*-pKsUQTgg2zg-3Ipj-4Lgg.png"
}, {
  "tag": "P",
  "text": "Famously, despite playing a significant role in the foundation of quantum mechanics, Schrödinger was never entirely comfortable with its implications, later writing that “I don’t like it and I’m sorry I ever had anything to do with it”. His proposition of Schrödinger’s cat was in fact an attempt at ridiculing the implications of the non-deterministic view of physics he had helped create.",
  "translation": "著名的是，尽管薛定mechanic在量子力学的基础上发挥了重要作用，但他对它的含义从未完全感到满意，后来写道：“我不喜欢它，对不起，我与它有任何关系”。 他对薛定ding的猫的主张实际上是在嘲笑他所帮助创造的物理学的非确定性观点的含义。"
}, {
  "tag": "H1",
  "text": "The Middle Row",
  "translation": "中排"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*lvinH4MaxJe5KkbcQV9-YA.png?q=20",
  "caption": "Left to Right: Peter Debye, Martin Knudsen, William Lawrence Bragg, Hendrik Anthony Kramers, Paul Dirac, Arthur Compton, Louis de Broglie, Max Born, Niels Bohr",
  "type": "image",
  "file": "1*lvinH4MaxJe5KkbcQV9-YA.png"
}, {
  "tag": "P",
  "text": "Moving on to the middle row, again from the the left we see another Nobel Laureate, Dutch chemist Peter Debye (1884–1966), who is known primarily for his application of the concept of dipole moment to the charge distribution in asymmetric molecules. On his immediate left, we see Martin Knudsen (1871–1949), the Danish physicist known for his study of molecular gas flow and the development of the Knudsen cell, and Lawrence Bragg (1890–1971), the British physicist, pioneering x-ray crystallographer and 1915 Nobel Laureate. Also present, next to Dirac, is the 1927 Nobel Laureate, the American physicist Arthur Compton (1892–1962), known both for his discovery of the Compton effect which demonstrated the particle nature of electromagnetic radiation and for his later contributions to the Manhattan Project. Louis de Broglie (1892–1987), student of Paul Langevin (front row) was also there. de Broglie was the person who first (in his 1924 PhD thesis) postulated the wave nature of electrons and suggested that all matter has wave properties. Known now as the “de Broglie hypothesis”, it was de Broglie’s idea that Schrödinger had used in his formulation of wave mechanics. Following its experimental verification in 1927 by the Davisson-Germer experiment, de Broglie was awarded his Nobel Prize in physics in 1929.",
  "translation": "继续到中间行，再从左边我们可以看到另一位诺贝尔奖获得者，荷兰化学家彼得·德拜（Peter Debye，1884–1966），他因将偶极矩概念应用于不对称分子的电荷分布而闻名。在他的左手边，我们看到以研究分子气体流动和Knudsen细胞的发展而闻名的丹麦物理学家Martin Knudsen（1871-1949）和英国物理学家Lawrence Bragg（1890-1971）率先开发x-射线晶体学家和1915年诺贝尔奖获得者。美国物理学家亚瑟·康普顿（1892–1962），也是狄拉克旁边的1927年诺贝尔奖获得者，他因发现康普顿效应（证明电磁辐射的粒子性质）以及后来对曼哈顿计划的贡献而闻名。保罗·兰格文（Paul Langevin）（前排）的学生路易斯·德布罗意（Louis de Broglie，1892-1987年）也在那里。德布罗意（de Broglie）是第一个（在他的1924年博士学位论文中）假设电子的波性质并暗示所有物质都具有波性质的人。现在被称为“德布罗意假设”，这是德布罗意的想法，薛定ding将其用于波浪力学的表述。戴维森-杰默（Davisson-Germer）实验于1927年进行了实验验证后，德布罗意（De Broglie）于1929年获得了诺贝尔物理学奖。"
}, {
  "tag": "P",
  "text": "In addition to these brilliant men, we again focus our attention towards a handful of individuals who were especially prominent in the formulation of early quantum theory. Therein",
  "translation": "除了这些才华横溢的人之外，我们再次将注意力集中在少数几个在早期量子理论的阐述中特别杰出的人。 其中"
}, {
  "tag": "UL",
  "texts": ["Niels Bohr (1885–1962)", "Hendrik Kramers (1894–1952)", "Max Born (1882–1970)", "Paul Dirac (1902–1984)"],
  "translations": ["尼尔斯·玻尔（Niels Bohr，1885-1962年）", "亨德里克·克莱默斯（1894–1952）", "马克斯·伯恩（1882–1970）", "保罗·狄拉克（Paul Dirac）（1902–1984）"]
}, {
  "tag": "H2",
  "text": "Niels Bohr",
  "translation": "尼尔斯·波尔（Niels Bohr）"
}, {
  "tag": "P",
  "text": "Niels Bohr, 42 years old at the time of the conference, was of course the Danish physicist most well known for his (and Ernest Rutherford’s) 1913 formulation of the Bohr model of the atom which proposes that energy levels of electrons are discrete and that the electrons revolve in stable orbits around the atomic nucleus but can jump from one energy level (orbit) to another. The model won Bohr the Nobel Prize in Physics in 1922. In the 30s, he was instrumental in helping refugees escape Nazism. After Denmark was occupied by the Germans, personally lobbied Heisenberg (by then the head of the German nuclear weapons program) about the implications of nuclear war (accounts differ on the exact content of their conversation). He was also part of the British mission to the Manhattan project and later involved in the establishment of CERN in Geneva.",
  "translation": "尼尔斯·玻尔（Niels Bohr）在会议时享年42岁，他当然是丹麦物理学家，以他（和欧内斯特·卢瑟福（Ernest Rutherford's））于1913年提出的原子玻尔模型的提出而闻名，该模型提出电子的能级是离散的，并且 电子在原子核周围以稳定的轨道旋转，但可以从一个能级（轨道）跳到另一个能级。 该模型赢得了玻尔1922年的诺贝尔物理学奖。在30年代，他在帮助难民逃脱纳粹主义方面发挥了重要作用。 丹麦被德国人占领之后，他亲自游说海森堡（当时是德国核武器计划的负责人），以谈论核战争的影响（对话的确切内容各不相同）。 他还是英国对曼哈顿项目的访问的一部分，后来参与了在日内瓦建立欧洲核子研究组织的工作。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*wBuzih9OLiicrfVaCwL-lA.png?q=20",
  "caption": "Left: Niels Bohr (1885–1962). Right: Bohr’s 1913 paper On the Constitution of Atoms and Molecules, Part II Systems Containing Only a Single Nucleus, where Bohr introduced what is now known as the Bohr model of the atom.",
  "type": "image",
  "file": "1*wBuzih9OLiicrfVaCwL-lA.png"
}, {
  "tag": "P",
  "text": "Prior to the conference, Heisenberg had been working as a lecturer at Bohr’s Institute for Theoretical Physics at the University of Copenhagen. Bohr had forwarded Heisenberg’s paper introducing the uncertainty principle to Einstein. During the conference, Bohr led the charge to defend the implications of Heisenberg’s work by debating Einstein over his criticism illustrated through the now-famous “slit experiment”:",
  "translation": "会议之前，海森堡一直在哥本哈根大学玻尔理论物理研究所担任讲师。 玻尔已将海森堡的论文介绍给爱因斯坦介绍不确定性原理。 在会议期间，玻尔领导辩护，通过对爱因斯坦的批评来捍卫海森堡的工作含义，爱因斯坦通过现在著名的“狭缝实验”说明了他的批评："
}, {
  "tag": "PRE",
  "text": "Thought Experiment: The Slit ExperimentConsider a particle passing through a slit of width d. The slit introduces uncertainty in momentum of approximately h/d because the particle passes through the wall. But, let us determine the momentum of the particle by measuring the recoil of the wall. In doing so, we find the momentum of the particle to arbitrary accuracy by conservation of momentum.",
  "translation": "思维实验：狭缝实验考虑一个穿过宽度为d的狭缝的粒子。 由于粒子穿过壁，因此狭缝引入了大约h / d的动量不确定性。 但是，让我们通过测量墙的后坐力来确定粒子的动量。 通过这样做，我们通过保持动量找到了粒子的动量达到任意精度。"
}, {
  "tag": "P",
  "text": "Bohr’s elegant response was simple: He argued that the wall which the photon passes through is indeed a quantum mechanical system as well. As such, in order to measure the recoil of the wall to an accuracy of Δp, the momentum of the wall must also be known to this accuracy before the particle passes through. The implication is that at this degree of accuracy, the position of the wall is in fact uncertain as well, just as it is for the particle passing through it. As such, the position of the slit is equal to h/Δp and if the wall’s momentum is known precisely enough to measure the recoil, the slit’s position is uncertain enough to disallow a measurement of its position, in accordance with Heisenberg’s uncertainty principle.",
  "translation": "玻尔的优雅反应很简单：他辩称，光子穿过的壁确实也是量子力学系统。 因此，为了将壁的反冲力测量到Δp的精度，还必须在粒子通过之前以该精度知道壁的动量。 暗示是，在这种精确度下，壁的位置实际上也不确定，就像通过它的粒子一样。 因此，狭缝的位置等于h /Δp，如果根据海森堡的不确定性原理，精确知道墙的动量足以测量后坐力，则狭缝的位置将具有足够的不确定性以至于无法测量其位置。"
}, {
  "tag": "P",
  "text": "Bohr’s triumph in the debate and his close relationship with Heisenberg at the University of Copenhagen led to the colloquial naming of the non-deterministic view spearheaded by Heisenberg, Bohr, Born and others as the “Copenhagen interpretation” of quantum physics.",
  "translation": "玻尔在辩论中的胜利以及他与哥本哈根大学海森堡的密切关系导致以海森堡，玻尔，博恩等人为首的非确定性观点被口头命名为量子物理学的“哥本哈根解释”。"
}, {
  "tag": "H2",
  "text": "Hendrik A. Kramers",
  "translation": "亨德里克·克拉默斯"
}, {
  "tag": "P",
  "text": "Also present in the middle row was the Dutch physicist Hendrik Kramers (1894–1952), who had worked under Bohr in Copenhagen as a Ph.D. candidate and later with Ehrenfest in Leiden. Prior to the advent of quantum mechanics by Heisenberg in 1925, Kramers worked with him on the so-called Kramers-Heisenberg dispersion formula, which expresses the cross section for scatting of a photon by an electron and was fundamental to the establishment of Heisenberg’s 1926 result.",
  "translation": "居中排的还有荷兰物理学家亨德里克·克莱默斯（Hendrik Kramers，1894-1952年），他曾在哥本哈根的玻尔（Bohr）担任博士学位。 候选人，后来在莱顿的埃伦费斯特。 在海森堡在1925年提出量子力学之前，克雷默斯与他一起研究了所谓的克雷默斯-海森堡色散公式，该公式表示电子散射光子的横截面，这对于建立海森堡1926年的结果至关重要 。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*Rdn3kcmT5xSTVvrikEItog.png?q=20",
  "caption": "Left: Hendrik “Hans” A. Kramers (1894–1952). Right: Kramers’ 1925 co-authored paper with Heisenberg Über die Streuung von Strahlung durch Atome (“On the Scattering of Radiation by Atoms”) which introduces the Kramers-Heisenberg dispersion formula",
  "type": "image",
  "file": "1*Rdn3kcmT5xSTVvrikEItog.png"
}, {
  "tag": "H2",
  "text": "Paul Dirac",
  "translation": "保罗·狄拉克"
}, {
  "tag": "P",
  "text": "One of the more, by now, well-known physicists present was Paul Dirac, then aged 25 and a researcher under Ralph Fowler (back row) in Cambridge. The year before, he had completed his Ph.D with the first ever thesis on Heisenberg’s quantum mechanics.",
  "translation": "到目前为止，其中一位知名物理学家是保罗·狄拉克（Paul Dirac），当时25岁，是剑桥大学拉尔夫·福勒（Ralph Fowler）（后排）的研究员。 前一年，他以有关海森堡量子力学的第一篇论文完成了博士学位。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*YGEkN0auwJiu4U9tstnj_w.png?q=20",
  "caption": "Left: Paul Dirac (1902–1984). Right: Dirac’s 1928 paper The Quantum Theory of the Electron in which he introduced the Dirac equation as a relativistic equation of motion for the wave function of the electron",
  "type": "image",
  "file": "1*YGEkN0auwJiu4U9tstnj_w.png"
}, {
  "tag": "P",
  "text": "Dirac’s contribution that led to his Ph.D. occurred in 1925. His supervisor (Fowler) had received a proof copy of Heisenberg’s paper where he introduced matrix mechanics for the first time, and gave it to Dirac for him to examine. Dirac noticed a curious mathematical relationship which he later realized had the same structure as the Poisson brackets that occur in the classical dynamics of particle motion. The realization led to his introduction of a quantum theory based on non-commuting dynamic variables, which allowed him to obtain novel and illuminating quantization rules (the process of transitioning from a classical to a quantum understanding of physics), the so-called canonical quantization procedure. His rules incorporated the ideas of both Heisenberg’s matrix mechanics and Schrödinger’s wave mechanics and showed that they were in fact equivalent. As his admirer and fellow Lucasian Professor of Mathematics at Cambridge, Stephen Hawking would later write, “Of the three founders of modern quantum mechanics, Heisenberg and Schrödinger can claim to have caught the first glimpses of the theory. But it was Dirac who put them together and revealed the whole picture”.",
  "translation": "Dirac的贡献使他获得了博士学位。发生在1925年。他的上司（Fowler）收到了海森堡论文的证明副本，他在其中首次介绍了矩阵力学，并将其交给狄拉克供他检查。狄拉克注意到了一种奇怪的数学关系，他后来意识到与经典的粒子运动动力学中的泊松括号具有相同的结构。这种认识导致他引入了基于非交换动态变量的量子理论，这使他获得了新颖而有启发性的量化规则（从经典的物理学理解为量子理解的过程），即所谓的规范量化程序。他的规则结合了海森堡矩阵力学和薛定ding波浪力学的思想，并表明它们实际上是等效的。正如他的仰慕者和剑桥大学卢卡斯数学系资深教授一样，斯蒂芬·霍金（Stephen Hawking）后来写道：“在现代量子力学的三位创始人中，海森堡和薛定claim可以声称对理论有了初见。但这是狄拉克（Dirac）将它们放在一起并揭示出整个图景。”"
}, {
  "tag": "P",
  "text": "A year after the Solvay conference, Dirac discovered, independently of Pauli, what is now known as the Dirac equation which describes all spin-½ massive particles such as electron and quarks for which parity is a symmetry. The discovery was the first to imply the existence of antimatter, which was experimentally confirmed only several years later. Dirac would go on to share the 1933 Nobel Prize in Physics with Schrödinger “for the discovery of new productive forms of atomic theory”.",
  "translation": "索尔维会议召开一年后，狄拉克（Dirac）独立于保利（Pauli），发现了现在称为狄拉克方程（Dirac equation），该方程描述了所有奇偶性都是对称的自旋½质量粒子，例如电子和夸克。 该发现是第一个暗示存在反物质的发现，仅在几年后通过实验证实了这一点。 狄拉克将继续与Schrödinger分享1933年诺贝尔物理学奖，“以发现原子理论的新生产形式”。"
}, {
  "tag": "H2",
  "text": "Max Born",
  "translation": "马克斯·伯恩"
}, {
  "tag": "P",
  "text": "Finally, in the middle row, we also find the German physicist and mathematician Max Born (1882–1970) who although not as famous as Heisenberg, was highly instrumental in the his development of matrix mechanics and the formulation of the probability density function later used by Erwin Schrödinger in the Schrödinger equation.",
  "translation": "最后，在中间一排，我们还发现了德国物理学家和数学家马克斯·伯恩（Max Born，1882-1970年），尽管他不像海森堡那样出名，但在矩阵力学的发展以及后来使用的概率密度函数的制定方面发挥了重要作用 由ErwinSchrödinger在Schrödinger方程中得出。"
}, {
  "tag": "P",
  "text": "It was Born who the year before the conference, in response to Heisenberg’s 1925 publication had proposed that quantum mechanics were best understood by probabilities. What is now known simply as the Born rule, gives the probability that a measurement on a quantum system will yield a given result. It was first introduced by Born in the 1926 paper Zur Quantenmechanik der Stoßvorgänge (“On the Quantum Mechanics of Collisions”). In the paper, Born solves the Schrödinger equation (postulated a year before) for a scattering problem. The rule is now considered a fundamental law of quantum mechanics.",
  "translation": "会议的前一年，正是鲍恩在回应海森堡1925年的出版物时提出，量子力学最好由概率来理解。 现在简单地称为“伯恩法则”（Born Rule），给出了量子系统上的测量将产生给定结果的可能性。 它是Born于1926年在Zur Quantenmechanik derStoßvorgänge（“碰撞的量子力学”）中首次提出的。 在本文中，Born解决了散射问题的Schrödinger方程（假设一年前）。 现在，该规则被认为是量子力学的基本定律。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*Tte3jYJy1sciMD0XRGMJpQ.png?q=20",
  "caption": "Left: Max Born (1882–1970). Right: Born’s 1926 paper Zur Quantenmechanik der Stoßvorgänge (“On the Quantum Mechanics of Collisions”) where he defines what is now known as the Born rule.",
  "type": "image",
  "file": "1*Tte3jYJy1sciMD0XRGMJpQ.png"
}, {
  "tag": "P",
  "text": "By the time of the conference in October 1927, Born and Heisenberg were famously so confident in their results that they proclaimed that quantum mechanics was “complete and irrevocable”:",
  "translation": "到1927年10月的会议召开时，博恩和海森堡对他们的结果非常有信心，以至于他们宣称量子力学“是完整且不可撤销的”："
}, {
  "tag": "PRE",
  "text": "While we consider.. a quantum mechanical treatment of the electromagnetic field.. as not yet finished, we consider quantum mechanics to be a closed theory, whose fundamental physical and mathematical assumptions are no longer susceptible of any modification.. On the question of the 'validity of the law of causality' we have this opinion: as long as one takes into account only experiments that lie in the domain of our currently acquired physical and quantum mechanical experience, the assumption of indeterminism in principle, here taken as fundamental, agrees with experience.- Born & Heisenberg (1927). \"Quantum Mechanics\". Proceedings of the Fifth Solvay Congress",
  "translation": "当我们考虑对电磁场进行量子力学处理时（尚未完成），我们认为量子力学是一个封闭的理论，其基本物理和数学假设不再易受任何修改。 “因果关系法则的有效性”我们有这样的观点：只要人们只考虑位于我们当前获得的物理和量子力学经验范围内的实验，则原则上对不确定性的假设（这里被认为是基本的）是一致的 -有经验的人。-Born＆Heisenberg（1927）。 “量子力学”。 第五届索尔维大会论文集"
}, {
  "tag": "H1",
  "text": "The Front Row",
  "translation": "前排"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*p-dHi3qI_Ov_S9ePiqxAUg.png?q=20",
  "caption": "Left to Right: Irving Langmuir, Max Planck, Marie Curie, Hendrik Lorentz, Albert Einstein, Paul Langevin, Charles-Eugène Guye, C. T. R. Wilson, Owen Richardson",
  "type": "image",
  "file": "1*p-dHi3qI_Ov_S9ePiqxAUg.png"
}, {
  "tag": "P",
  "text": "Finally, the front row of the photograph is largely dominated by the (then) older guard of physics, some of whom worked in quantum physics and some who did not.",
  "translation": "最后，照片的前排主要由（当时）年龄较大的物理学家控制，其中一些人从事量子物理学工作，而有些人则没有。"
}, {
  "tag": "P",
  "text": "Madame Marie Curie (1867–1934), the only person at the conference who had won the Nobel in both physics (1903) and chemistry (1911), never worked on quantum theory. Rather, she did her monumental work on the nature and properties of radioactivity and for her discovery of the elements radium and polonium, and her successful isolation and study of the properties of the former. The chair of the conference Hendrik Lorentz (1853–1928), similarly, although he in 1926 had given a lecture series on quantum physics at Cornell University, never published research on the topic himself.",
  "translation": "居里夫人玛丽（1896-1934）是会议上唯一一位在物理学（1903年）和化学（1911年）上均获得诺贝尔奖的人，从未从事过量子理论研究。 相反，她在放射性的性质和特性以及发现镭和po元素以及成功地隔离和研究前者的特性方面做了巨大的工作。 同样，会议主席亨德里克·洛伦兹（Hendrik Lorentz，1853年至1928年），尽管他在1926年曾在康奈尔大学（Cornell University）进行过有关量子物理学的系列讲座，但他本人从未发表过有关该主题的研究。"
}, {
  "tag": "P",
  "text": "Irving Langmuir (1881–1957) was an American chemist and physicist who won the Nobel Prize in 1932 for his work on surface chemistry. The French physicist Paul Langevin (1872–1946) is now primarily best known for his development of Langevin dynamics and the Langevin equation, as well as as the supervisor of Louis de Broglie and Léon Brillouin (also present). On his left, the Swiss physicist Charles-Eugéne Guye (1866–1942) was one of Einstein’s teachers at ETH Zurich whose experimental results were among the first to support the predictions of Lorentz and Einstein on special relativity. The Scottish Charles Thomson Rees Wilson (1869–1959) was a physicist and meteorologist who had won the Nobel Prize in the year of the conference, for his invention of the so-called cloud chamber, a particle detector used for visualizing the passage of ionizing radiation. The following year, the Nobel was awarded to the man on Wilson’s left, Owen Richardson (1879–1959), a British physicist most well known for his work on thermionic emission and the derivation of Richardson’s law.",
  "translation": "欧文·兰格缪尔（Irving Langmuir，1881-1957年）是美国化学家兼物理学家，他因在表面化学领域的研究而获得1932年诺贝尔奖。现在，法国物理学家保罗·兰格文（Paul Langevin）（1872-1946）以其兰格文动力学和兰格文方程的发展以及路易斯·德布罗意（Louis de Broglie）和莱昂·布里渊（LéonBrillouin）的主管而闻名。瑞士物理学家查尔斯·尤金·居伊（Charles-EugéneGuye，1866–1942年）在他的左边，是爱因斯坦在苏黎世联邦理工学院（ETH ETH）的老师之一，他的实验结果是第一个支持洛伦兹和爱因斯坦关于狭义相对论的预测的人之一。苏格兰的查尔斯·汤姆森·里斯·威尔逊（Charles Thomson Rees Wilson，1869年至1959年）是物理学家和气象学家，他因获得了当年的诺贝尔奖而获奖，他发明了所谓的云室，这是一种用于可视化电离通道的粒子探测器。辐射。次年，诺贝尔奖授予威尔逊左翼的人欧文·理查森（Owen Richardson，1879-1959年），他是英国物理学家，以在热电子发射和理查森定律的推导方面的工作而闻名。"
}, {
  "tag": "P",
  "text": "Front and center in our debate, however, most notably, in the front row were two older men:",
  "translation": "但是，在我们的辩论中，最重要的是，最前面的是两名年长的男人："
}, {
  "tag": "UL",
  "texts": ["Max Planck (1858–1947)", "Albert Einstein (1879–1955)"],
  "translations": ["马克斯·普朗克（1858–1947）", "阿尔伯特·爱因斯坦（1879–1955）"]
}, {
  "tag": "H2",
  "text": "Max Planck",
  "translation": "马克斯·普朗克"
}, {
  "tag": "P",
  "text": "The older Planck played an early and crucial role in the establishment of quantum physics, with his introduction in 1900 of the famous Planck black-body radiation law, or simply Planck’s Law. Later utilized by both Einstein and Schrödinger in their Nobel Prize award-winning papers, Planck’s law describes the spectral density of electromagnetic radiation emitted by a black body in thermal equilibrium.",
  "translation": "较老的普朗克在建立量子物理学中起着至关重要的早期作用，他于1900年提出了著名的普朗克黑体辐射定律或简称普朗克定律。 爱因斯坦（Einstein）和薛定er（Schrödinger）后来在其诺贝尔奖获奖论文中使用了普朗克定律，描述了黑体在热平衡状态下发出的电磁辐射的光谱密度。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*0Y3zFq-0VUFceI6D4VdxZA@2x.png?q=20",
  "caption": "Left: Max Planck (1858–1947). Right: The first of two papers by Planck in 1900, Über eine Verbesserung der Wienschen Spektralgleichung (“On an Improvement of Wien’s Equation of the Spectrum”) in which he first proposed Planck’s law of black-body radiation",
  "type": "image",
  "file": "1*0Y3zFq-0VUFceI6D4VdxZA@2x.png"
}, {
  "tag": "P",
  "text": "Planck had won the 1918 Nobel Prize in Physics for his early work on quantum theory, however he rejected Heisenberg and Born’s quantum mechanics, expecting that Schrödinger’s wave mechanics would soon render quantum mechanics unnecessary.",
  "translation": "普朗克因其在量子理论上的早期工作而获得了1918年诺贝尔物理学奖，但他拒绝了海森堡和伯恩的量子力学，并期望薛定er的波动力学很快会使量子力学变得不必要。"
}, {
  "tag": "PRE",
  "text": "\"He was, by nature, a conservative mind; he had nothing of the revolutionary and was thoroughly skeptical about speculations. Yet his belief in the compelling force of logical reasoning from facts was so strong that he did not flinch from announcing the most revolutionary idea which ever has shaken physics.\"- Max Born about Planck",
  "translation": "“从本质上讲，他是一个保守的人；他对革命一无所知，并且对投机行为完全持怀疑态度。但是，他对事实证明逻辑推理具有强大的推动力的信念是如此强烈，以至于他没有畏缩于宣布最革命的想法 曾经动摇过物理学。”-马克斯·波恩（Max Born），关于普朗克"
}, {
  "tag": "H2",
  "text": "Albert Einstein",
  "translation": "艾尔伯特爱因斯坦"
}, {
  "tag": "P",
  "text": "Finally, of course, there in the front sat Albert Einstein (1879–1955). At this point 48 years old, Einstein had revolutionized physics multiple times by introducing, among other results, special and general relativity, mass-energy equivalence and the nature of the photoelectric effect. He had already been awarded his Nobel Prize in 1921, but following the publication of Heisenberg’s 1925 paper introducing matrix mechanics, was famously displeased with the direction modern physics was heading. A staunch determinist, his famous line",
  "translation": "最后，当然，在前面坐着爱因斯坦（1879–1955）。 在这一年48岁的时候，爱因斯坦通过引入特别和广义相对论，质量能等价物以及光电效应的性质等方法，对物理学进行了多次革命。 他早在1921年就已经获得诺贝尔奖，但是在海森堡（Heisenberg）在1925年发表的介绍矩阵力学的论文之后，就对现代物理学的发展方向感到不满。 坚定的决定论者，他的名言"
}, {
  "tag": "P",
  "text": "I, in any case, am convinced that He does not play dice. — Einstein",
  "translation": "无论如何，我深信他不玩骰子。 —爱因斯坦"
}, {
  "tag": "P",
  "text": "was made during the Solvay conference in his confrontation with Bohr. The pair’s well-known and public debate on the topic lasted until the publication of the so-called Einstein-Podolsky-Rosen paper in 1935, entitled Can Quantum-Mechanical Description of Physical Reality be Considered Complete?",
  "translation": "是在苏威会议期间与玻尔对峙时制作的。 两人对该主题的著名和公开辩论一直持续到1935年发表了所谓的《爱因斯坦-波多尔斯基-罗森》（Einstein-Podolsky-Rosen）论文，题为《对物理现实的量子力学描述》可以被认为是完整的吗？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*n2rguITjM2oSsEauZbTKBQ@2x.png?q=20",
  "caption": "Left: Albert Einstein (1879–1955). Right: Einstein’s 1905 paper Über einen die Erzeugung und Verwandlung des Lichtes betreffenden heuristischen Gesichttspunkt (“On a Heuristic Viewpoint Concerning the Production and Transformation of Light”) which first proposed the idea of energy quanta",
  "type": "image",
  "file": "1*n2rguITjM2oSsEauZbTKBQ@2x.png"
}, {
  "tag": "P",
  "text": "A year after the conference, despite their disagreements, Einstein nominated both Heisenberg and Born for the Nobel Prize. He would later also nominate Wolfgang Pauli (1945). Although they did not meet very often, or correspond very voluminously, Einstein and Bohr’s mutual admiration persisted, as Einstein’s secretary Helen Dukas later stated:",
  "translation": "会议一年后，尽管有分歧，但爱因斯坦还是提名海森堡和博恩获得诺贝尔奖。 后来他还提名沃尔夫冈·保利（Wolfgang Pauli）（1945年）。 爱因斯坦秘书海伦·杜卡斯（Helen Dukas）后来表示，尽管他们很少见面或交流非常频繁，但爱因斯坦和玻尔仍然相互钦佩。"
}, {
  "tag": "P",
  "text": "“They loved each other warmly and dearly”",
  "translation": "“他们热烈而深爱着彼此”"
}, {
  "tag": "H1",
  "text": "Video",
  "translation": "视频"
}, {
  "tag": "P",
  "text": "Unbelievably, there is video from the 1927 Solvay Conference shot by an assistant of Irving Langmuir, which is available below with commentary by Nancy Thorndike Greenspan. In the near 3 minute silent film, 21 out of the 29 participants at the conference can be seen conversing during an intermission in the proceedings. Transcript of the commentary is available below.",
  "translation": "令人难以置信的是，有1 Irving Langmuir的助手拍摄的1927年索尔维会议的视频，以下是Nancy Thorndike Greenspan的评论。 在近3分钟的无声电影中，可以看到会议的29位参与者中有21位在会议过程中进行了交谈。 评论文字记录如下。"
}, {
  "tag": "FIGURE",
  "type": "code"
}, {
  "tag": "PRE",
  "text": "Transcript of Langmuir film from the 1927 Solvay Conference[00:06] The film opens with quick shots of Erwin Schrödinger and Niels Bohr. August Piccard at the University of Brussels follows, and then the camera refocuses on Schrödinger and Bohr.[00:18] Erwin Schrödinger and Niels Bohr followed by Piccard. Schrödinger who developed wave mechanics never agreed with Bohr and quantum mechanics, nor with Werner Heisenberg's uncertainty principle. Solvay gave Heisenberg an opportunity to discuss his new theory.[00:35] Here's French physicist Léon Brillouin, Hendrik Kramers (Bohr's former assistant) and Paul Dirac talking with Max Born whose statistical interpretation of the wave function ended determinism in the atomic world. These men (Bohr, Heisenberg, Kramers, Dirac and Born) together with Wolfgang Pauli represent the founding fathers of quantum mechanics. On the other hand is Louis de Broglie, who wrote his dissertation on the wave nature of matter which Schrödinger used as the basis for wave mechanics.[01:09] The owner of the camera, Irving Langmuir is seen chatting with briefly with Bohr. At Solvay, Bohr refined his thoughts on complementarity and sparred with Einstein over the implications. Here he is with Paul Ehrenfest. Kramers' work in Copenhagen on dispersion theory was essential to the development of quantum mechanics. Langmuir, an American chemist at the GE Lab in Schenectady (hence the camera) had recently broken his leg and appears to explain to Ehrenfest how he gets around. [01:42] By 1927, Dirac (in the middle) had independently developed quantum mechanics and made other significant contributions, as had Wolfgang Pauli who formulated the exclusion principle. A lively Madame Curie. Born and Pauli working out a problem. [02:06] Note the changed demeanor as the participants exit from the meeting. Except for the smiling William Lawrence Bragg and Peter Debye. Arthur Holly Compton, Owen Richardson, Max Born, Madame Curie, Hendrik Kramers, H.A. Lorentz, Paul Langevin. Albert Einstein, whose famous response to Born and the statistical interpretation of the wave function was \"God does not play dice\". [02:37] Bohr, Planck, Pauli and Belgian soldiers. A pretentious conclusion.",
  "translation": "1927年索尔维会议上Langmuir电影的文字记录[00:06]这部电影的开头是ErwinSchrödinger和Niels Bohr的快速镜头。随后是布鲁塞尔大学的August August Piccard，然后摄像机将焦点重新对准了Schrödinger和Bohr。[00:18] ErwinSchrödinger和Niels Bohr随后是Piccard。研发波动力学的薛定never从未与玻尔和量子力学，威尔纳·海森堡的不确定性原理相吻合。索尔维为海森堡提供了讨论他的新理论的机会。[00:35]这是法国物理学家莱昂·布里渊（LéonBrillouin），亨德里克·克莱默斯（Hendrik Kramers）（玻尔的前助手）和保罗·狄拉克（Paul Dirac）与马克斯·伯恩（Max Born）交谈，后者对波函数的统计解释终结了原子世界中的确定性。这些人（玻尔，海森堡，克雷默斯，狄拉克和伯恩）与沃尔夫冈·保利一起代表了量子力学的奠基人。另一方面是路易斯·德布罗意（Louis de Broglie），他撰写了关于物质的波动性质的论文，薛定ding将其用作波动力学的基础。[01:09]相机的主人欧文·朗缪尔（Irving Langmuir）曾与玻尔短暂地聊天。在索尔维，玻尔完善了他关于互补性的思想，并与爱因斯坦保持着默契。他在这里和保罗·埃伦费斯特在一起。克莱默斯在哥本哈根进行的色散理论研究对于量子力学的发展至关重要。斯克内克塔迪（Schenectady）通用电气实验室的美国化学家兰格缪尔（Langmuir）最近摔断了腿，似乎向埃伦费斯特（Ehrenfest）解释了他的出行方式。 [01:42]到1927年，狄拉克（中）独自开发了量子力学，并做出了其他重要贡献，沃尔夫冈·保利（Wolfgang Pauli）提出了排除原理。一个活泼的居里夫人。 Born和Pauli解决了一个问题。 [02:06]请注意，与会人员退出会议时的行为已更改。除了微笑的威廉·劳伦斯·布拉格和彼得·德拜。 Arthur Holly Compton，Owen Richardson，Max Born，居里夫人，Hendrik Kramers，H.A。洛伦兹，保罗·兰格文。阿尔伯特·爱因斯坦（Albert Einstein）对波恩（Born）的著名回应以及对波动函数的统计解释是“上帝不玩骰子”。 [02:37]玻尔，普朗克，保利和比利时士兵。一个自命不凡的结论。"
}, {
  "tag": "P",
  "text": "Those interested in reading more about the “Debate of the Century” between Einstein and Bohr are encouraged to check out the essay The Bohr-Einstein Debate.",
  "translation": "鼓励那些有兴趣阅读更多关于爱因斯坦与玻尔之间的“世纪辩论”的人阅读《玻尔-爱因斯坦辩论》一文。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*ewpb3JoC6P_qq1BkmYjtlA.png?q=20",
  "type": "image",
  "file": "1*ewpb3JoC6P_qq1BkmYjtlA.png"
}, {
  "tag": "P",
  "text": "This essay is part of a series of stories on math-related topics, published in Cantor’s Paradise, a weekly Medium publication. Thank you for reading!",
  "translation": "本文是每周发表在Cantor’s Paradise上的一系列与数学相关的故事的一部分。 感谢您的阅读！"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Jørgen Veisdal的文章《The Golden Age of Quantum Physics》，参考：https://medium.com/cantors-paradise/the-golden-age-of-quantum-physics-9a3ddac68413)",
  "translation": "（本文翻译自约尔根·维斯达尔的文章《量子物理学的黄金时代》，参考：https：//medium.com/cantors-paradise/the-golden-age-of-quantum-physics-9a3ddac68413）"
}]