[{
  "tag": "H1",
  "text": "The Most Underrated Productivity Technique Is Also the Simplest",
  "translation": "最被低估的生产力技术也是最简单的"
}, {
  "tag": "H2",
  "text": "There are only two steps",
  "translation": "只有两个步骤"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*jIypalXmknvDWodvBe-zpA.jpeg?q=20",
  "caption": "Credit: Westend61/Getty Images",
  "type": "image",
  "file": "1*jIypalXmknvDWodvBe-zpA.jpeg"
}, {
  "tag": "P",
  "text": "It’s not humanly possible to read every piece of productivity advice that exists, but I think I’ve come close. And at one point or another, I’ve tried most of that advice for myself, no matter how unpleasant or out-there it seemed. There was a time when I took cold showers because I heard it would help me combat procrastination. (It did not.)",
  "translation": "阅读现有的每条生产力建议都不是人类可能的事，但我想我已经接近了。 在某一点上，无论是多么令人不愉快，我都为自己尝试了大部分建议。 曾经有一段时间我洗冷水是因为我听说它可以帮助我对抗拖延症。 （它没有。）"
}, {
  "tag": "P",
  "text": "Eventually, there came a moment when I realized that studying all these time-management hacks and calendar systems and multistep strategies was only stalling me from the real work of actually getting things done. I already knew the most powerful productivity technique. It was just a matter of using it.",
  "translation": "最终，有一瞬间，我意识到研究所有这些时间管理技巧和日历系统以及多步骤策略只会使我无法真正完成工作。 我已经知道最强大的生产力技术。 这只是使用它的问题。"
}, {
  "tag": "P",
  "text": "There are only two steps:",
  "translation": "只有两个步骤："
}, {
  "tag": "OL",
  "texts": ["Physically get in your work position.", "Do one small thing."],
  "translations": ["身体上处于您的工作位置。", "做一件小事。"]
}, {
  "tag": "P",
  "text": "That’s it. That’s the whole thing.",
  "translation": "而已。 这就是全部。"
}, {
  "tag": "P",
  "text": "It’s simple, but it isn’t easy. Oftentimes, we do everything in our power to avoid that first step. We grab another cup of coffee, go for a walk, read a book, run errands. Before I wrote this piece, I meticulously rearranged my bookshelf. I tried to escape. The voice inside my head told me to turn on Netflix.",
  "translation": "很简单，但并不容易。 通常，我们会竭尽所能避免第一步。 我们再拿一杯咖啡，散步，看书，办事。 在写这篇文章之前，我仔细地重新整理了我的书架。 我试图逃跑。 我内心的声音告诉我打开Netflix。"
}, {
  "tag": "P",
  "text": "But instead, I sat down at my desk. I put my phone away and closed my internet browser. And I started working on the one small thing that I scheduled for the day. Then, like magic, I was working.",
  "translation": "但是，我却坐在办公桌旁。 我收起电话并关闭了互联网浏览器。 然后，我开始着手计划当天要做的一件小事。 然后，就像魔术一样，我正在工作。"
}, {
  "tag": "P",
  "text": "The real secret of this technique is that you must do it again tomorrow, and the next day, and the day after that. Build up momentum and keep it. Author Will Durant may have said it best when he wrote, “We are what we repeatedly do. Excellence, then, is not an act, but a habit.”",
  "translation": "该技术的真正秘密在于，您必须在明天，第二天和第二天再做一次。 建立动力并保持动力。 作家威尔·杜兰特（Will Durant）写道：“我们是我们一再做的事情。 因此，卓越不是一种行为而是一种习惯。”"
}, {
  "tag": "P",
  "text": "It’s the Non-Zero Day principle: Just do one thing every day that will help you move toward your goal. As Reddit user ryans01 wrote in a post that inspired the movement, “Didn’t do anything all fucking day and it’s 11:58 PM? Write one sentence. One push up. Read one page of that chapter. One. Because one is non zero.”",
  "translation": "这是“非零日”的原则：每天只需做一件事，就能帮助您朝自己的目标迈进。 正如Reddit用户ryans01在激励该运动的帖子中所写的那样：“整个他妈的一天都没做任何事情，现在是晚上11:58？ 写一句话。 一推。 阅读该章的一页。 一。 因为一非零。”"
}, {
  "tag": "P",
  "text": "We can talk about the newest productivity systems all day, but doing so won’t get the real work done. At some point, you have to sit in your chair and just get started.",
  "translation": "我们可以整日谈论最新的生产力系统，但是这样做无法完成真正的工作。 在某个时候，您必须坐在椅子上并开始使用。"
}]