[{
  "tag": "P",
  "text": "About the Author",
  "translation": "关于作者"
}, {
  "tag": "P",
  "text": "Jun Wu is a Content Writer for Technology, AI, Data Science, Psychology, and Parenting. She has a background in programming and statistics. On her spare time, she writes poetry and blogs on her website.",
  "translation": "Jun Wu是技术，人工智能，数据科学，心理学和育儿的内容作家。 她具有编程和统计学的背景。 业余时间，她在自己的网站上写诗和博客。"
}, {
  "tag": "P",
  "text": "Subscribe to my weekly newsletter to stay connected",
  "translation": "订阅我的每周时事通讯以保持联系"
}, {
  "tag": "P",
  "text": "When I was working in IT for investment banks, these opportunities typically came around during year five for a senior programmer. Even then, it’s typically a one-shot deal. Once you lose the chance, it may not come around again (at least not with the same team).",
  "translation": "当我在投资银行的IT部门工作时，对于高级程序员，这些机会通常在第五年就出现了。 即使那样，这通常也是一次性交易。 一旦失去机会，它可能就不会再次出现（至少不在同一支队伍中）。"
}, {
  "tag": "P",
  "text": "A lot of my colleagues — ones that made management in their tenth year after being on track for management in year five — weren’t good managers. This inability to shine as good managers often caused them to bounce from company to company looking for work.",
  "translation": "我的很多同事（不是在五年级进入正轨后的第十年就担任管理职位的同事）都不是好经理。 作为优秀管理者的这种无能为力经常导致他们从一家公司跳槽到另一家寻找工作的公司。"
}, {
  "tag": "P",
  "text": "Programmers with good soft skills are better suited for leadership. Don’t waste your time being a mediocre manager. Be a good manager for your team — these efforts will pay off throughout your entire career.",
  "translation": "具有良好软技能的程序员更适合领导。 不要浪费你的时间成为一名平庸的经理。 成为团队的好经理-这些努力将在您的整个职业生涯中有所回报。"
}, {
  "tag": "P",
  "text": "People will know and respect you for your leadership.",
  "translation": "人们会认识并尊重您的领导才能。"
}, {
  "tag": "P",
  "text": "Set yourself up for success and develop the skills of a good technical manager.",
  "translation": "为成功做好准备，并培养优秀技术经理的技能。"
}, {
  "tag": "H1",
  "text": "1. Be a good listener",
  "translation": "1.做一个好听众"
}, {
  "tag": "P",
  "text": "Listening should be active. You should hear the other person’s point of view and understand where they’re coming from. This is empathy. If you don’t understand the person’s point of view, you need to ask more questions.",
  "translation": "听力应该活跃。 您应该听取对方的观点，并了解对方的来历。 这是同理心。 如果您不了解对方的观点，则需要提出更多问题。"
}, {
  "tag": "P",
  "text": "A productive conversation isn’t a one-way street.",
  "translation": "富有成效的对话不是一条单向的路。"
}, {
  "tag": "P",
  "text": "It’s when two people come away with a solid understanding of each other’s perspective. Actively listening and responding to the person are the first two steps to having a productive conversation. Whenever possible, you should give feedback (like restating what you’ve heard) to validate your understanding of the other person.",
  "translation": "当两个人对彼此的观点有了扎实的了解时。 积极倾听并回应对方是进行富有成效的对话的前两个步骤。 只要有可能，您都应该提供反馈（例如，重述您所听到的内容），以验证您对另一个人的理解。"
}, {
  "tag": "H1",
  "text": "2. Be a good team player",
  "translation": "2.做一个好的团队合作者"
}, {
  "tag": "P",
  "text": "Ideally, companies shouldn’t give every all-star programmer a management opportunity. They should, however, give all-star programmers with good leadership qualities and good soft skills management opportunities.",
  "translation": "理想情况下，公司不应为每位全明星程序员提供管理机会。 但是，他们应该为全明星程序员提供良好的领导才能和良好的软技能管理机会。"
}, {
  "tag": "P",
  "text": "Even all-star programmers have to be good team players.",
  "translation": "即使是全明星的程序员也必须是优秀的团队合作者。"
}, {
  "tag": "P",
  "text": "In most sports (if you watch), the ball is passed from player to player. A star doesn’t shine without the support of their team. The all-star programmer has to be grounded enough to regulate their ego for the benefit of the team.",
  "translation": "在大多数运动中（如果您观看），球从一个球员传到另一个球员。 没有团队的支持，一颗星星就不会发光。 为了团队的利益，全明星程序员必须有足够的基础来规范自己的自我。"
}, {
  "tag": "H1",
  "text": "3. Have patience",
  "translation": "3.有耐心"
}, {
  "tag": "P",
  "text": "This one’s obvious. But, in real life, most people have trouble practicing patience. When your project is delayed, you were up all night, and your entire team is having a crisis with the technical design in the middle of the project, it’s easy to lose your patience.",
  "translation": "这很明显。 但是，在现实生活中，大多数人都难以练习耐心。 当您的项目被延迟时，您整夜都处于忙碌状态，并且整个团队的技术设计处于项目中间的危机中，很容易失去耐心。"
}, {
  "tag": "P",
  "text": "Patience is a skill that can be practiced every day. This is often why good parents make good managers. It’s simply that they’ve had lots of practice being patient with their children. People who have been through war at their jobs, like managing crises, or people in the military are also great at being patient. They practice patience daily by enduring extraordinary situations.",
  "translation": "耐心是每天都可以练习的技能。 这就是为什么好父母会成为好管理者的原因。 只是因为他们有很多练习要耐心等待孩子。 在工作中经历过战争的人（例如处理危机）或军队中的人也很耐心。 他们每天通过忍受特殊情况来练习耐心。"
}, {
  "tag": "H1",
  "text": "4. Have integrity",
  "translation": "4.有诚信"
}, {
  "tag": "P",
  "text": "With technology quickly advancing, the job market changing just as fast, and new startups sprouting up every day, it’s easy to lose sight of integrity. When I talk about integrity, I’m talking about taking responsibility for the people on your team, for the projects you work on, and for the company you work for. Personal integrity includes being truthful, transparent, and genuine.",
  "translation": "随着技术的飞速发展，就业市场的变化也日新月异，并且每天都有新的初创公司如雨后春笋般出现，很容易就失去了诚信感。 当我谈论诚信时，我是在谈论对团队中的人员，您从事的项目以及您所服务的公司负责。 个人正直包括诚实，透明和真诚。"
}, {
  "tag": "P",
  "text": "Technical integrity is critically important.",
  "translation": "技术完整性至关重要。"
}, {
  "tag": "P",
  "text": "In this era of increased technological innovation, doing the right thing is difficult, if at all possible. Often, projects have constraints that make it impossible for you to choose to do the right thing. It’s often up to the technical managers to push back and set technical limitations.",
  "translation": "在这个技术创新日新月异的时代，做对的事情很难，即使有可能。 通常，项目具有约束，使您无法选择做正确的事。 通常由技术经理来决定并设置技术限制。"
}, {
  "tag": "P",
  "text": "Business managers may not understand there are technical limitations.",
  "translation": "业务经理可能不了解存在技术限制。"
}, {
  "tag": "P",
  "text": "You can’t compromise the data integrity of the entire system to give the customers one little feature. As a technical manager, you have to speak up and draw the line. It’s your job to preserve the technical integrity of the system or software that your team develops by setting and communicating technical limits and advocating for best practices.",
  "translation": "您不能为了给客户一个小功能而损害整个系统的数据完整性。 作为技术经理，您必须大声疾呼并划清界限。 通过设置和交流技术限制并倡导最佳实践，维护团队开发的系统或软件的技术完整性是您的工作。"
}, {
  "tag": "H1",
  "text": "5. Have compassion",
  "translation": "5.有同情心"
}, {
  "tag": "P",
  "text": "Your star programmer’s grandmother just passed away and you’re in a critical part of the project that requires your star programmer.",
  "translation": "您的明星程序员的祖母刚刚去世，并且您处于需要明星程序员的项目的关键部分。"
}, {
  "tag": "P",
  "text": "Do you let your programmer take a few days off to process this loss?",
  "translation": "您是否让程序员休假几天来处理此损失？"
}, {
  "tag": "P",
  "text": "A compassionate manager won’t think twice about letting the programmer take off. Your star programmer is a person with emotional needs and is no good to the team in mourning. Let your programmer mourn their loss.",
  "translation": "富有同情心的经理不会让程序员离开。 您的明星程序员是一个有情感需求的人，在哀悼中对团队不利。 让您的程序员哀悼他们的损失。"
}, {
  "tag": "P",
  "text": "Step up as a leader and distribute the work amongst the team. Motivate them to take on the work and support their coworker during this difficult time.",
  "translation": "担任领导者并在团队中分配工作。 在这个困难的时期激励他们继续工作并支持他们的同事。"
}, {
  "tag": "H1",
  "text": "6. See the big picture",
  "translation": "6.看大图"
}, {
  "tag": "P",
  "text": "Programmers are prone to tunnel vision. This is largely due to the nature of a programmer’s work — large amounts of time spent on minute details. As a manager, it’s critical to see the big picture.",
  "translation": "程序员容易产生隧道视觉。 这在很大程度上是由于程序员的工作性质所致，即花费大量时间在细节上。 作为经理，了解全局非常关键。"
}, {
  "tag": "P",
  "text": "Seeing the big picture means seeing the business impact of projects.",
  "translation": "看到全局意味着看到项目的业务影响。"
}, {
  "tag": "P",
  "text": "Seeing the big picture means knowing how your project aligns with other projects inside your company or inside your division.",
  "translation": "看到全局意味着了解您的项目如何与公司内部或部门内部的其他项目保持一致。"
}, {
  "tag": "P",
  "text": "Seeing the big picture means visualizing all the components and the interrelationships of the components in your projects.",
  "translation": "看到大局面意味着可视化项目中的所有组件以及组件之间的相互关系。"
}, {
  "tag": "P",
  "text": "Seeing the big picture also means seeing how your project will impact your clients outside of the company and the industry.",
  "translation": "看到全局也意味着看到您的项目将如何影响公司和行业之外的客户。"
}, {
  "tag": "P",
  "text": "If you were asked to draw a picture of what your project means, what would that picture look like? If you were asked to draw a picture of your team in relation to other teams in your company or division, what would the picture look like?",
  "translation": "如果要求您画出项目含义的图片，那么图片会是什么样？ 如果要求您绘制与公司或部门中其他团队有关的团队图片，那么图片会是什么样？"
}, {
  "tag": "H1",
  "text": "7. Delegate tasks",
  "translation": "7.委托任务"
}, {
  "tag": "P",
  "text": "Micromanaging is the hallmark of an inexperienced manager. It reflects insecurity and the need for control. On your way to being a good manager, you may feel like you need to micromanage tasks. That’s OK. You need tasks to be done. Even if you have a project manager in charge, you still want to know the project will be completed on time.",
  "translation": "微观管理是缺乏经验的经理的标志。 它反映了不安全和控制的需要。 在成为一名优秀经理的过程中，您可能会觉得自己需要微观管理任务。 没关系。 您需要完成任务。 即使您有项目经理负责，您仍然想知道项目将按时完成。"
}, {
  "tag": "P",
  "text": "Technology projects are notorious for their delays. As a technical manager, you need to practice delegating (even if you have new team members). Your team members need to practice accepting tasks and completing them on time. Delegating will feel much easier the more you practice.",
  "translation": "技术项目因延迟而臭名昭著。 作为技术经理，您需要练习委派（即使您有新的团队成员）。 您的团队成员需要练习接受任务并按时完成。 练习越多，委派就会容易得多。"
}, {
  "tag": "H1",
  "text": "8. Provide organization and support",
  "translation": "8.提供组织和支持"
}, {
  "tag": "P",
  "text": "A good technical manager is a facilitator. This type of manager knows it’s not about them — it’s about each member of the team and the team as a whole. To bring out the team’s best, the manager must be organized and seek support from all levels within the company, all while uplifting every member of the team.",
  "translation": "好的技术经理是促进者。 这种类型的经理知道与他们无关，而是与团队中的每个成员以及整个团队有关。 为了发挥团队的最佳绩效，经理必须有条理，并在公司内各个层面寻求支持，同时还要提升团队的每个成员。"
}, {
  "tag": "P",
  "text": "At the same time, the technical manager does the grunt work of administrative duties so team members can focus on their project-related tasks. In some ways, a good technical manager sacrifices their time without saying a word and then turns around and applauds everyone on the team.",
  "translation": "同时，技术经理会执行繁重的行政职责，因此团队成员可以专注于与项目相关的任务。 在某些方面，一个好的技术经理会浪费时间而不说一句话，然后转身为团队中的每个人鼓掌。"
}, {
  "tag": "H1",
  "text": "9. Provide unbiased, helpful feedback",
  "translation": "9.提供公正，有用的反馈"
}, {
  "tag": "P",
  "text": "A good technical manager isn’t a friend. A good technical manager is a manager first, a mentor second, and a teammate third. This is why feedback must be unbiased. Ideally, a good technical manager solicits feedback from other members of the team in addition to theirs.",
  "translation": "好的技术经理不是朋友。 一个好的技术经理首先是经理，其次是导师，然后是队友。 这就是为什么反馈必须无偏见的原因。 理想情况下，优秀的技术经理会征求团队其他成员的反馈。"
}, {
  "tag": "P",
  "text": "To balance relationships within the team, a good technical manager must be unbiased and open-minded (as much as possible). At the same time, feedback must be helpful to the person. This is key in mentorship. If you can’t say something helpful, then don’t say anything at all. The ultimate goal of feedback is to help the person improve their performance.",
  "translation": "为了平衡团队内部的关系，优秀的技术经理必须保持公正和开放的心态（尽可能）。 同时，反馈必须对人有帮助。 这是指导的关键。 如果您无法说出什么有帮助的话，那就什么也不要说。 反馈的最终目的是帮助人们提高绩效。"
}, {
  "tag": "P",
  "text": "Another type of unbiased feedback is about technology. Technical managers shouldn’t be attached to certain technologies. The decisions of picking which technology to use, what programming language to use, and which vendor to use should be based on careful analysis of the pros and cons.",
  "translation": "另一种无偏见的反馈是关于技术的。 技术经理不应附属于某些技术。 选择使用哪种技术，使用哪种编程语言以及使用哪种供应商的决定应基于对优缺点的仔细分析。"
}, {
  "tag": "H1",
  "text": "10. Provide technical expertise",
  "translation": "10.提供技术专长"
}, {
  "tag": "P",
  "text": "A technical manager must have good technical expertise. It’s not enough to know how to do things. It’s critical to know why things are done a certain way. A technical manager must have a good foundation in basic computer science knowledge that will enable effective coding and design.",
  "translation": "技术经理必须具有良好的技术专长。 仅仅知道如何做是不够的。 了解为什么以某种方式完成事情至关重要。 技术经理必须具有扎实的基础计算机科学知识基础，以便能够进行有效的编码和设计。"
}, {
  "tag": "P",
  "text": "Technical managers are not required to have a computer science degree but they often do. I’ve seen very good technical managers, ones without a computer science degree, that have acquired critical computer science knowledge in other ways. The knowledge and the foundation is a must, but the degree is secondary.",
  "translation": "技术经理不需要拥有计算机科学学位，但通常需要。 我见过非常好的技术经理，他们没有计算机科学学位，他们已经以其他方式获得了关键的计算机科学知识。 知识和基础是必须的，但程度是次要的。"
}, {
  "tag": "P",
  "text": "It helps if the technical manager has been through the role of a technical leader or architecture designer on the same team. Often, these managers are technical leaders within the company and in the open-source community.",
  "translation": "如果技术经理担任过同一团队中的技术主管或架构设计师，则将很有帮助。 通常，这些经理是公司内部和开源社区中的技术主管。"
}, {
  "tag": "H1",
  "text": "11. Provide business expertise",
  "translation": "11.提供业务专业知识"
}, {
  "tag": "P",
  "text": "Ideally, a good technical manager will master the business knowledge to lead teams successfully through projects. Often, programmers will look to the technical manager to ask questions about the business. If you have a project manager on hand for such questions, then it’s less critical for the technical manager to possess business skills. But, even then, the technical manager must understand the big picture related to the business.",
  "translation": "理想情况下，优秀的技术经理将掌握业务知识，以成功地带领团队完成项目。 通常，程序员会向技术经理寻求有关业务的问题。 如果您手头有一个项目经理来回答此类问题，那么技术经理拥有业务技能的重要性就不那么重要了。 但是，即使那样，技术经理也必须了解与业务相关的全局。"
}, {
  "tag": "H1",
  "text": "12. Have an open mind",
  "translation": "12.胸襟开阔"
}, {
  "tag": "P",
  "text": "Programmers can be single-minded. This is because programmers are trying to solve difficult intellectual problems that require such single-mindedness. A good technical manager knows when to step back. They must maintain an open mind to balance relationships, opinions, and egos on the team. It helps if the technical manager is a creative member of the team. This prevents the technical manager from having a hard time switching from single-mindedness to open-mindedness.",
  "translation": "程序员可以一心一意。 这是因为程序员正在尝试解决需要一心一意的难题。 一个好的技术经理知道什么时候该退后一步。 他们必须保持开放的心态，以平衡团队中的关系，观点和自我。 如果技术经理是团队的创新成员，则将有帮助。 这可以防止技术经理费时费力地从专心转向开放。"
}, {
  "tag": "H1",
  "text": "13. Make firm decisions in a timely fashion",
  "translation": "13.及时做出坚定的决定"
}, {
  "tag": "P",
  "text": "For a technical manager, retaining a degree of objectivity while making decisions is important. That’s why having a process in place for making such decisions is necessary. A great training task for technical managers is to develop a decision-making process and practice making decisions with this process.",
  "translation": "对于技术经理，在决策时保持一定程度的客观性很重要。 因此，必须有一个制定此类决策的流程。 技术经理的一项重要培训任务是制定决策流程，并在此流程中进行决策。"
}, {
  "tag": "P",
  "text": "Once the manager is familiar with their decision-making process, then they can rely on the decisions made — these decisions will be firm. This means that the manager can take responsibility for these decisions because adequate evidence and reasoning were used to support the decisions. In time, and with practice, a good technical manager can make these decisions more swiftly.",
  "translation": "一旦经理熟悉了他们的决策过程，他们就可以依靠所做的决策-这些决策将是坚定的。 这意味着经理可以对这些决定承担责任，因为已使用了足够的证据和推理来支持这些决定。 及时地并通过实践，好的技术经理可以更快地做出这些决定。"
}, {
  "tag": "H1",
  "text": "14. Take responsibility",
  "translation": "14.承担责任"
}, {
  "tag": "P",
  "text": "Have you ever met a manager that makes team members responsible for the decisions they made? I have. Some technical managers justify this method of placing blame on the company culture of “blame and shame”.",
  "translation": "您是否遇到过让团队成员对他们所做的决定负责的经理？ 我有。 一些技术经理证明这种将责任归咎于“责备与耻辱”的公司文化的方法是正确的。"
}, {
  "tag": "P",
  "text": "Instead of this corporate culture, set a good example by taking responsibility for your decisions. If you use a decision-making process grounded in evidence and logical thinking, then you’ll be able to take responsibility (even for the failures, delays, and other unforeseen circumstances). You’re the one who can set the proper example of how to take responsibility for your team.",
  "translation": "代替这种企业文化，树立榜样，对您的决策负责。 如果您使用基于证据和逻辑思维的决策流程，那么您将能够承担责任（即使是失败，延误和其他不可预见的情况）。 您是可以树立正确的榜样的人，可以为您的团队承担责任。"
}, {
  "tag": "H1",
  "text": "15. Be a master learner",
  "translation": "15.成为一名高级学习者"
}, {
  "tag": "P",
  "text": "Before demanding that the programmers on your team be master learners, a technical manager must be a master learner. Chances are, this goes without saying. An experienced technical manager will probably have around ten years of programming experience, this likely means they’re already a master learner.",
  "translation": "在要求您团队中的程序员是高级学习者之前，技术经理必须是高级学习者。 不用说，这很有可能。 经验丰富的技术经理可能拥有大约十年的编程经验，这可能意味着他们已经是高级学习者。"
}, {
  "tag": "H1",
  "text": "16. Have trust",
  "translation": "16.有信任感"
}, {
  "tag": "P",
  "text": "Trust does not happen overnight. Just because you delegate tasks and your team members complete these tasks, doesn’t mean they trust you. This also doesn’t mean you can trust them. In any relationship, trust between team members is built over the years.",
  "translation": "信任不是一朝一夕的事。 仅仅因为您委派任务并且您的团队成员完成了这些任务，并不意味着他们信任您。 这也不意味着您可以信任他们。 无论如何，团队成员之间的信任都是多年来建立的。"
}, {
  "tag": "P",
  "text": "Team building exercises are helpful to facilitate trust-building. As a technical manager, you need to actively pursue team-building when working on projects. This can include sharing expertise, overcoming difficult problems, and the occasional team outing. However, this does not include spying or invasion of a team member’s privacy. (These actions will likely take away any trust that’s been built.)",
  "translation": "团队建设练习有助于建立信任。 作为技术经理，您在进行项目工作时需要积极追求团队建设。 这可以包括共享专业知识，克服难题以及偶尔的团队郊游。 但是，这不包括监视或侵犯团队成员的隐私。 （这些操作很可能会剥夺已建立的信任。）"
}, {
  "tag": "H1",
  "text": "17. Have charisma",
  "translation": "17.有魅力"
}, {
  "tag": "P",
  "text": "A good technical manager is a cheerleader for the team. A good cheerleader possesses a certain degree of charisma. Believe it or not, a good sense of humor helps manage a technical team. When there are hurdles to overcome, cracking a joke to break the ice, then moving the team to solve a problem requires charisma.",
  "translation": "好的技术经理是团队的啦啦队长。 一个好的啦啦队长具有一定的魅力。 信不信由你，良好的幽默感有助于管理技术团队。 当有障碍要克服时，开个玩笑打破僵局，然后动一支团队来解决问题，需要有魅力。"
}, {
  "tag": "H1",
  "text": "18. Advocate for members of the team",
  "translation": "18.倡导团队成员"
}, {
  "tag": "P",
  "text": "A good technical manager should advocate for every member of the team. When managers throw team members under the bus, they lose respect in a big way. Once team members lose respect for their technical manager, it takes a long time to regain this respect. This is why firing or laying off people is hard for a good technical manager.",
  "translation": "一个好的技术经理应该为团队的每个成员提倡。 当管理人员将团队成员扔到公车上时，他们会大大失去尊重。 一旦团队成员失去对技术经理的尊重，就需要很长时间才能恢复这种尊重。 这就是为什么对一个好的技术经理来说，解雇或解雇人很难。"
}, {
  "tag": "H1",
  "text": "19. Balance the team",
  "translation": "19.平衡团队"
}, {
  "tag": "P",
  "text": "One of the most important jobs of a good technical manager is to balance the team’s egos. In a highly technical team, experts are coming from different backgrounds and each person may be highly respected in their field — this is why balancing the egos of each team is so important.",
  "translation": "好的技术经理最重要的工作之一就是平衡团队的自负。 在一支技术含量高的团队中，专家来自不同的背景，每个人在各自的领域都可能受到很高的尊重-这就是为什么平衡每个团队的自负是如此重要的原因。"
}, {
  "tag": "P",
  "text": "The technical manager’s ability to diffuse situations when team members go head to head on technical issues is a must. Designs, resources, and project timelines have to be balanced often.",
  "translation": "当团队成员就技术问题展开正面交锋时，技术经理必须能够分散情况。 设计，资源和项目时间表必须经常保持平衡。"
}, {
  "tag": "P",
  "text": "There’s always a give and take.",
  "translation": "总会有一个让步。"
}, {
  "tag": "P",
  "text": "Sometimes sacrifices must be made for the good of the project. In these cases, the technical manager must be able to balance the egos of those team members involved and explain why decisions were made. It’s critical to be a technical manager that every expert respects.",
  "translation": "有时必须为项目的利益做出牺牲。 在这种情况下，技术经理必须能够平衡所涉及的团队成员的自负，并解释为什么要做出决定。 成为每个专家都尊敬的技术经理至关重要。"
}, {
  "tag": "H1",
  "text": "20. Create and follow through on a vision",
  "translation": "20.创建并遵循愿景"
}, {
  "tag": "P",
  "text": "A good technical manager has a vision. What would you like your team to accomplish in a year, two years, or five years? How would you like to steer this ship forward while aligning it with company goals?",
  "translation": "好的技术经理要有远见。 您希望您的团队在一年，两年或五年内完成什么？ 在与公司目标保持一致的同时，您想如何引导这艘船前进？"
}, {
  "tag": "P",
  "text": "This technical manager will understand the strengths and weaknesses of the team. Then, the technical manager will build a vision for the team to capitalize on the team’s strength. Often, this vision is repeatedly presented to team members during projects and transitions between projects. This vision helps to unite team members and allow them to see the big picture.",
  "translation": "该技术经理将了解团队的优势和劣势。 然后，技术经理将为团队建立愿景，以利用团队的实力。 通常，在项目以及项目之间的过渡期间，会经常向团队成员提出此愿景。 这种愿景有助于团结团队成员，并使他们看到全局。"
}, {
  "tag": "H1",
  "text": "21. Be a good mentor",
  "translation": "21.做一个好导师"
}, {
  "tag": "P",
  "text": "Ideally, a manager has been a mentor to their peers before becoming a technical manager. With new managers, there’s always a period where team members are learning to work with and trust them, especially if the manager was brought in from another company. This process can be shortened by promoting someone who is already mentoring team members within the same team.",
  "translation": "理想情况下，经理在成为技术经理之前一直是同行的良师益友。 在新经理的带领下，团队成员总是有一段时间学习与他们合作并信任他们，特别是如果经理是从另一家公司引进来的。 可以通过提拔已经在同一团队中指导团队成员的人员来缩短此过程。"
}, {
  "tag": "H1",
  "text": "22. Understand the business",
  "translation": "22.了解业务"
}, {
  "tag": "P",
  "text": "Acquiring business skills can be difficult and it doesn’t happen overnight. It takes years of working on projects for the same team or company and depends on the complexity of the business knowledge. Sometimes, the technical manager goes through formal training to become proficient in this knowledge. A technical manager will need to translate technical concepts for business managers to understand. Sometimes, the technical manager might need to understand the business better than the business manager.",
  "translation": "掌握业务技能可能很困难，而且并非一overnight而就。 同一团队或同一公司的项目需要花费多年的时间，并且取决于业务知识的复杂性。 有时，技术经理会接受正式培训以精通此知识。 技术经理将需要翻译技术概念，以便业务经理理解。 有时，技术经理可能需要比业务经理更好地了解业务。"
}, {
  "tag": "H1",
  "text": "23. Be good at pitching",
  "translation": "23.善于投球"
}, {
  "tag": "P",
  "text": "A good technical manager has to be convincing. Often, a good technical manager must make a case for how things are done. Why are certain design decisions made? Why is a technical decision made in a certain way? Why should we automate this part of the system? Why should we embark on a software project for this side of the business?",
  "translation": "好的技术经理必须令人信服。 通常，优秀的技术经理必须为事情做事提供依据。 为什么要做出某些设计决策？ 为什么以某种方式做出技术决定？ 为什么我们要使系统的这一部分自动化？ 我们为什么要为此业务开展软件项目？"
}, {
  "tag": "P",
  "text": "Each pitch to upper management must be made with clarity. It should add value (sometimes exponentially) for the business. This type of persuasive communication can only be practiced by making pitches as often as possible.",
  "translation": "与高层管理人员的每个接洽都必须清楚明确。 它应该为业务增加价值（有时成倍增加）。 这种说服力的交流只能通过尽可能频繁地进行宣传来实现。"
}, {
  "tag": "H1",
  "text": "24. Know when to exercise different management styles",
  "translation": "24.知道何时行使不同的管理方式"
}, {
  "tag": "P",
  "text": "Every technical manager has their own management style. Good technical managers adapt their management style for the good of each team member. This technical manager can use different strategies to deal with vastly different personalities. The manager may use one management style with the entire team and other styles to fit the various personalities on the team. In any relationship, there’s a give and take — the leader must meet team members halfway.",
  "translation": "每个技术经理都有自己的管理风格。 优秀的技术经理会根据每个团队成员的利益来调整管理风格。 该技术经理可以使用不同的策略来应对截然不同的个性。 经理可以在整个团队中使用一种管理风格，而其他风格则可以适合团队中的各种个性。 无论是哪种关系，都是有让步的-领导者必须半途与团队成员会面。"
}, {
  "tag": "H1",
  "text": "25. Cope with stressful situations",
  "translation": "25.应付压力大的情况"
}, {
  "tag": "P",
  "text": "Have you ever seen a technical manager immensely stressed about a given situation but acts as if nothing’s happening? I have seen this. At one time, I was also this manager. I can tell you that being able to keep a cool head through stressful situations is not easy. It takes years of practice to withstand the pressures that the business demands. But, as a technical manager, you have seen the outcomes and can gauge the chances of success. You probably also have devised a fallback plan. With good planning, you can take away the stress from your team members, absorb the immediate shock, and steer your team members on a course towards solutions.",
  "translation": "您是否曾经见过某位技术经理对给定情况有极大的压力，但表现得好像什么都没有发生？ 我看到了 有一次，我也是这个经理。 我可以告诉你，在压力大的情况下保持冷静的头脑并不容易。 承受业务需要的压力需要多年的实践。 但是，作为技术经理，您已经看到了成果并可以评估成功的机会。 您可能还设计了一个后备计划。 通过良好的计划，您可以减轻团队成员的压力，吸收立即的冲击，并引导团队成员寻求解决方案。"
}, {
  "tag": "H1",
  "text": "26. Network for the team",
  "translation": "26.团队网络"
}, {
  "tag": "P",
  "text": "Often, technical managers go to networking events with business managers. Managing up is as important as managing down. Networking provides opportunities to acquire projects, resources, or knowledge for your team. It might seem like it’s for personal gain but a good technical manager will network with people that can contribute to their vision of the team.",
  "translation": "通常，技术经理会与业务经理一起参加社交活动。 向上管理与向下管理同等重要。 网络为您的团队提供了获取项目，资源或知识的机会。 看来这是为了个人利益，但是优秀的技术经理会与可以为团队愿景做出贡献的人们建立联系。"
}, {
  "tag": "H1",
  "text": "27. Have a good instinct",
  "translation": "27.有良好的直觉"
}, {
  "tag": "P",
  "text": "A good technical manager has certain instincts about people, technology, and the business. These types of instinct come with experience. Often, a good technical manager will make an effort to hone these instincts by taking risks. In time, the technical manager will be able to make swift decisions relying on instinct — these instincts help to supplement decisions that require evidence and logic.",
  "translation": "好的技术经理对人员，技术和业务有一定的直觉。 这些本能伴随着经验。 通常，优秀的技术经理会努力承担风险，以磨练这些直觉。 随着时间的推移，技术经理将能够根据本能做出快速的决策-这些本能有助于补充需要证据和逻辑的决策。"
}, {
  "tag": "H1",
  "text": "28. Have an approachable demeanor",
  "translation": "28.举止平易近人"
}, {
  "tag": "P",
  "text": "A good technical manager is someone with an open-door policy. Team members must feel free to approach this manager for guidance. This technical manager doesn’t have to hold the team member’s hands in everyday tasks but has an approachable demeanor so that even junior members of the team feel comfortable approaching them.",
  "translation": "一个好的技术经理是有开放政策的人。 团队成员必须随时向该经理寻求指导。 该技术经理不必在日常任务中牵扯团队成员的手，但举止平易近人，因此即使是团队的初级成员也可以轻松地接近他们。"
}, {
  "tag": "H1",
  "text": "29. Understand that perception is the reality",
  "translation": "29.了解感知是现实"
}, {
  "tag": "P",
  "text": "A good technical manager is someone who understands that for bystanders who are watching, perception is the reality. This also goes for projects. The technical manager should be able to deliver issues to the business with an optimistic tone.",
  "translation": "一个好的技术经理是这样的人，他知道对于正在观察的旁观者来说，感知是现实。 这也适用于项目。 技术经理应该能够以乐观的态度向企业交付问题。"
}, {
  "tag": "P",
  "text": "This manager should be able to create a vision of the project that will gain trust from the business. That means managing the right expectations for both the business as well as the technical team. An experienced technical manager will scrutinize important communication to ensure that the right perceptions are delivered every time to business managers, team members, and project leaders.",
  "translation": "该经理应该能够对项目进行构想，从而获得业务的信任。 这意味着要为业务和技术团队管理正确的期望。 经验丰富的技术经理将仔细检查重要的沟通，以确保每次都能向业务经理，团队成员和项目负责人传达正确的看法。"
}, {
  "tag": "H1",
  "text": "30. Have a positive attitude and a solutions mindset",
  "translation": "30.拥有积极的态度和解决方案的心态"
}, {
  "tag": "P",
  "text": "A good technical manager is someone who’s been around the block. This means that this manager has seen big problems, dealt with them, and came out on the other end. When there are big problems, big business changes, and huge technical hurdles, the technical manager will still smile while investigating the solutions. This manager will keep a positive attitude when dealing with all types of problems.",
  "translation": "一位优秀的技术经理会一直待在那儿。 这意味着该经理已经看到了大问题，将其解决，然后又出现了。 当出现大问题，大业务变化以及巨大的技术障碍时，技术经理在调查解决方案时仍会微笑。 在处理所有类型的问题时，这位经理将保持积极的态度。"
}, {
  "tag": "P",
  "text": "In times of low morale, the technical manager will be able to motivate their team to come up with solutions. Under business constraints, the technical manager will motivate the business to work around constraints to enable the technology team to work at their best.",
  "translation": "在士气低落的时候，技术经理将能够激励他们的团队提出解决方案。 在业务限制下，技术经理将激励企业克服限制，以使技术团队能够尽力而为。"
}, {
  "tag": "P",
  "text": "Creative problem solving coupled with a positive attitude will make any technical manager great!",
  "translation": "创造性的问题解决方案加上积极的态度将使任何技术经理都很棒！"
}, {
  "tag": "H2",
  "text": "Coding Life",
  "translation": "编码寿命"
}, {
  "tag": "H1",
  "text": "30 Traits of a Good Technical Manager",
  "translation": "优秀技术经理的30个特质"
}, {
  "tag": "H2",
  "text": "A management position can come suddenly, be prepared",
  "translation": "一个管理职位可能突然来，准备好"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*aZW2BxVyDmiTCdkqrAOKQw.png?q=20",
  "caption": "@barchpou unsplash.com",
  "type": "image",
  "file": "1*aZW2BxVyDmiTCdkqrAOKQw.png"
}, {
  "tag": "FIGURE",
  "type": "code"
}, {
  "tag": "P",
  "text": "At some point in your programming career, you’ll be asked to mentor your peers. This likely means you are on someone’s shortlist for a technical management position in the future. Perhaps, you’re already a technical leader on your team or the star programmer on your current project. In any case, you’ve been given a chance to show off your soft skills to management. This is a chance to gain respect and exercise emotional intelligence with your team members. (You should be exercising your soft skills daily — this is an additional opportunity to shine.)",
  "translation": "在您的编程生涯中的某个时候，系统会要求您指导同行。 这很可能意味着您将来会在某人的技术管理职位候选名单中。 也许，您已经是团队的技术主管或当前项目的明星程序员。 无论如何，您都有机会向管理层展示您的软技能。 这是一个获得尊重并与团队成员一起锻炼情绪智力的机会。 （您应该每天锻炼自己的软技能-这是一个闪耀的额外机会。）"
}, {
  "tag": "P",
  "text": "Don’t waste this opportunity. Be a good mentor.",
  "translation": "不要浪费这个机会。 做个好导师。"
}, {
  "tag": "P",
  "text": "If you’re a good mentor, additional opportunities — ones that help you grow into technical management roles — will open up.",
  "translation": "如果您是一位优秀的导师，将会有更多机会（可以帮助您成长为技术管理职位的机会）。"
}, {
  "tag": "P",
  "text": "Recognize these opportunities and don’t waste them. Be prepared to take them on with gratitude. In large companies, these opportunities don’t come often.",
  "translation": "意识到这些机会，不要浪费它们。 准备以感激的态度接受他们。 在大型公司中，这些机会并不经常出现。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Jun Wu的文章《30 Traits of a Good Technical Manager》，参考：https://medium.com/better-programming/30-traits-of-a-good-technical-manager-fca89e68f057)",
  "translation": "（本文翻译自吴军的文章《优秀技术经理的30个特质》，参考：https：//medium.com/better-programming/30-traits-of-a-good-technical-manager-fca89e68f057）"
}]