[{
  "tag": "P",
  "text": "Data Science as a whole is growing. As its capabilities grow, it’s embedding itself into every industry, both technical and non-technical, and every business, both small and large.",
  "translation": "数据科学作为一个整体正在增长。 随着其功能的增强，它已嵌入到技术和非技术的每个行业，以及大大小小的每个业务。"
}, {
  "tag": "P",
  "text": "As the field evolves over the long term, it wouldn’t be a surprise to see it democratized at a large scale, becoming available to many more people as a tool in our software toolbox.",
  "translation": "随着该领域的长期发展，看到它大规模民主化并不奇怪，它在我们的软件工具箱中被越来越多的人使用。"
}, {
  "tag": "H1",
  "text": "The 4 Hottest Trends in Data Science for 2020",
  "translation": "2020年数据科学的四大最热门趋势"
}, {
  "tag": "H2",
  "text": "2019 was a big year for all of Data Science.",
  "translation": "对于所有数据科学而言，2019年都是重要的一年。"
}, {
  "tag": "P",
  "text": "Companies all over the world across a wide variety of industries have been going through what people are calling a digital transformation. That is, businesses are taking traditional business processes such as hiring, marketing, pricing, and strategy, and using digital technologies to make them 10 times better.",
  "translation": "世界各地各行各业的公司都在经历着人们所说的数字化转型。 也就是说，企业正在采用传统的业务流程，例如招聘，营销，定价和策略，并使用数字技术使其质量提高10倍。"
}, {
  "tag": "P",
  "text": "Data Science has become an integral part of those transformations. With Data Science, organizations no longer have to make their important decisions based on hunches, best-guesses, or small surveys. Instead, they’re analyzing large amounts of real data to base their decisions on real, data-driven facts. That’s really what Data Science is all about — creating value through data.",
  "translation": "数据科学已成为这些转变的组成部分。 使用数据科学，组织不再需要根据预感，最好的猜测或小型调查做出重要决策。 取而代之的是，他们正在分析大量真实数据，以根据数据驱动的真实事实做出决策。 这就是数据科学的全部意义所在-通过数据创造价值。"
}, {
  "tag": "P",
  "text": "This trend of integrating data into the core business processes has grown significantly, with an increase in interest by over four times in the past 5 years according to Google Search Trends. Data is giving companies a sharp advantage over their competitors. With more data and better Data Scientists to use it, companies can acquire information about the market that their competitors might not even know existed. It’s become a game of Data or perish.",
  "translation": "根据Google搜索趋势，将数据集成到核心业务流程中的趋势已经显着增长，在过去5年中，兴趣增长了四倍多。 数据为公司提供了超越竞争对手的巨大优势。 有了更多的数据和更好的数据科学家来使用它，公司可以获取其竞争对手甚至可能不知道的市场信息。 它成为数据游戏或灭亡。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*mne6zyOUXhQhUet1Qba6Bg.png?q=20",
  "caption": "Google search popularity of “Data Science” over the past 5 years. Generated by Google Trends.",
  "type": "image",
  "file": "1*mne6zyOUXhQhUet1Qba6Bg.png"
}, {
  "tag": "P",
  "text": "In today’s ever-evolving digital world, staying ahead of the competition requires constant innovation. Patents have gone out of style while Agile methodology and catching new trends quickly is very much in.",
  "translation": "在当今不断发展的数字世界中，要在竞争中保持领先地位需要不断的创新。 专利已经过时，而敏捷方法论和快速捕捉新趋势非常重要。"
}, {
  "tag": "P",
  "text": "Organizations can no longer rely on their rock-solid methods of old. If a new trend like Data Science, Artificial Intelligence, or Blockchain comes along, it needs to be anticipated beforehand and adapted quickly.",
  "translation": "组织不再能够依靠其坚如磐石的旧方法。 如果出现诸如数据科学，人工智能或区块链之类的新趋势，则需要预先进行预测并迅速适应。"
}, {
  "tag": "P",
  "text": "The following are the 4 hottest Data Science trends for the year 2020. These are trends which have gathered increasing interest this year and will continue to grow in 2020.",
  "translation": "以下是2020年最热门的4种数据科学趋势。这些趋势今年引起了越来越多的兴趣，并将在2020年继续增长。"
}, {
  "tag": "H1",
  "text": "(1) Automated Data Science",
  "translation": "（1）自动化数据科学"
}, {
  "tag": "P",
  "text": "Even in today’s digital age, Data Science still requires a lot of manual work. Storing data, cleaning data, visualizing and exploring data, and finally, modeling data to get some actual results. That manual work is just begging for automation, and thus has been the rise of automated Data Science and Machine Learning.",
  "translation": "即使在当今的数字时代，数据科学仍然需要大量的手工工作。 存储数据，清洁数据，可视化和探索数据，最后对数据建模以获得一些实际结果。 手动工作只是乞求自动化，因此是自动化数据科学和机器学习的兴起。"
}, {
  "tag": "P",
  "text": "Nearly every step of the Data Science pipeline has been or is in the process of becoming automated.",
  "translation": "数据科学流程的几乎每个步骤都已经或正在变得自动化。"
}, {
  "tag": "P",
  "text": "Auto-Data Cleaning has been heavily researched over the past few years. Cleaning big data often takes up most of a Data Scientist’s expensive time. Both startups and large companies such as IBM offer automation and tooling for data cleaning.",
  "translation": "在过去的几年中，对自动数据清理进行了广泛的研究。 清理大数据通常会占用数据科学家的大部分宝贵时间。 初创公司和大型公司（例如IBM）都提供用于数据清理的自动化和工具。"
}, {
  "tag": "P",
  "text": "Another large part of Data Science known as feature engineering has undergone significant disruption. Featuretools offers a solution for automatic feature engineering. On top of that, modern Deep Learning techniques such as Convolutional and Recurrent Neural Networks learn their own features without the need for manual feature design.",
  "translation": "称为要素工程的数据科学的另一大部分已遭受重大破坏。 Featuretools提供了自动特征工程的解决方案。 最重要的是，诸如卷积和递归神经网络之类的现代深度学习技术无需手动特征设计即可学习其自身的特征。"
}, {
  "tag": "P",
  "text": "Perhaps the most significant automation is occurring in the Machine Learning space. Both Data Robot and H2O have established themselves in the industry by offering end-to-end Machine Learning platforms, giving Data Scientists a very easy handle on data management and model building. AutoML, a method for automatic model design and training, has also boomed over 2019 as these automated models surpass the state-of-the-art. Google, in particular, is investing heavily in Cloud AutoML.",
  "translation": "也许最重要的自动化发生在机器学习领域。 Data Robot和H2O都通过提供端到端机器学习平台而在行业中建立了自己的地位，这使Data Scientists可以非常轻松地处理数据管理和模型构建。 AutoML是一种用于自动模型设计和训练的方法，在2019年也蓬勃发展，因为这些自动模型已经超越了最新技术。 尤其是Google，正在Cloud AutoML上进行大量投资。"
}, {
  "tag": "P",
  "text": "In general, companies are investing heavily in building and buying tools and services for automated Data Science. Anything to make the process cheaper and easier. At the same time, this automation also caters to smaller and less technical organizations who can leverage these tools and services to have access to Data Science without building out their own team.",
  "translation": "总的来说，公司在建立和购买用于自动化数据科学的工具和服务上投入了大量资金。 使该过程更便宜，更容易的任何方法。 同时，这种自动化还适合规模较小和技术含量较低的组织，这些组织可以利用这些工具和服务来访问数据科学，而无需建立自己的团队。"
}, {
  "tag": "H1",
  "text": "(2) Data Privacy and Security",
  "translation": "（2）数据隐私与安全"
}, {
  "tag": "P",
  "text": "Privacy and security are always sensitive topics in technology. All companies want to move fast and innovate, but losing the trust of their customers over privacy or security issues can be fatal. So, they’re forced to make it a priority, at least to a bare minimum of not leaking private data.",
  "translation": "隐私和安全始终是技术中的敏感话题。 所有公司都希望快速发展和创新，但是失去客户对隐私或安全问题的信任可能是致命的。 因此，他们被迫将其作为优先事项，至少要做到不泄漏私人数据。"
}, {
  "tag": "P",
  "text": "Data privacy and security has become an incredibly hot topic over the past year as the issues are magnified by enormous public hacks. Just recently on November 22, 2019, an exposed server with no security was discovered on Google Cloud. The server contained the personal information of 1.2 Billion unique people including names, email addresses, phone numbers, and LinkedIn and Facebook profile information. Even the FBI came in to investigate. It’s one of the largest data exposures of all time.",
  "translation": "在过去的一年中，数据隐私和安全性已成为一个令人难以置信的热门话题，因为巨大的公共黑客事件使这一问题更加严重。 就在最近的2019年11月22日，在Google Cloud上发现了一个没有安全性的公开服务器。 该服务器包含12亿独特人员的个人信息，包括姓名，电子邮件地址，电话号码以及LinkedIn和Facebook个人资料信息。 甚至联邦调查局也介入调查。 这是有史以来最大的数据泄露事件之一。"
}, {
  "tag": "P",
  "text": "How did the data get there? Who does it belong to? Who is responsible for the security of that data? It was on a Google Cloud server, which really anyone could have created.",
  "translation": "数据如何到达那里？ 它属于谁？ 谁负责该数据的安全性？ 它是在任何人都可以创建的Google Cloud服务器上。"
}, {
  "tag": "P",
  "text": "Now we can rest assured that the whole world won’t be taking down their LinkedIn and Facebook accounts after reading the news, but it does raise some eyebrows. Consumers are becoming more and more careful of who they give their email address and phone number out to.",
  "translation": "现在，我们可以放心，全世界在阅读新闻之后不会删除他们的LinkedIn和Facebook帐户，但确实引起了人们的注意。 消费者越来越注意将电子邮件地址和电话号码提供给谁。"
}, {
  "tag": "P",
  "text": "A company that can guarantee the privacy and security of their customer's data will find that they have a far easier time convincing customers to give them more data (by continuing to use their products and services). It also ensures that, should their government enact any laws requiring security protocols for customer data, they are already well-prepared. Many companies are opting for SOC 2 Compliance to have some proof of the strength of their security.",
  "translation": "一家可以保证客户数据隐私和安全的公司会发现，他们说服客户（通过继续使用其产品和服务）向他们提供更多数据的时间要短得多。 它还确保，如果他们的政府制定了任何要求为客户数据提供安全协议的法律，则他们已经做好了充分的准备。 许多公司选择SOC 2合规性来证明其安全强度。"
}, {
  "tag": "P",
  "text": "The entire Data Science process is fueled by data, but most of it isn’t anonymous. In the wrong hands, that data could be used to fuel global catastrophes and upset everyday people’s privacy and livelihood. Data isn’t just raw numbers, it represents and describes real people and real things.",
  "translation": "整个数据科学过程都受到数据的推动，但其中大多数不是匿名的。 如果使用不当，这些数据可能会助长全球灾难，并扰乱每天人们的隐私和生计。 数据不仅仅是原始数字，它代表并描述了真实的人和真实的事物。"
}, {
  "tag": "P",
  "text": "As we see Data Science evolve, we’ll also see the transformation of the privacy and security protocols surrounding data. That includes processes, laws, and different methods of establishing and maintaining the safety, security, and integrity of data. It won’t be a surprise if cybersecurity becomes the new buzzword of the year.",
  "translation": "随着数据科学的发展，我们还将看到围绕数据的隐私和安全协议的转变。 这包括流程，法律以及建立和维护数据安全性，安全性和完整性的不同方法。 如果网络安全成为当年的新流行语，也就不足为奇了。"
}, {
  "tag": "H1",
  "text": "(3) Super-sized Data Science in the Cloud",
  "translation": "（3）云中的超大型数据科学"
}, {
  "tag": "P",
  "text": "Over the years that Data Science has grown from a niche to its own full-on field, the data available for analysis has also exploded in size. Organizations are collecting and storing more data than ever before.",
  "translation": "多年以来，数据科学已经从一个小众市场发展到了自己的全方位领域，可用于分析的数据也呈爆炸式增长。 组织正在收集和存储比以往更多的数据。"
}, {
  "tag": "P",
  "text": "The volume of data that a typical Fortune 500 company might need to analyze has gone far past what a personal computer can handle. A decent PC might have something like 64GB of RAM with an 8 core CPU and 4TB of storage. That works just fine for personal projects, but not so well when you work for a global company such as a bank or retailer who have data covering millions of customers.",
  "translation": "一家典型的财富500强公司可能需要分析的数据量已经远远超出了个人计算机可以处理的数据量。 一台像样的PC可能具有64GB的RAM，8核CPU和4TB的存储空间。 这对于个人项目来说效果很好，但是当您为一家拥有数百万客户数据的跨国公司（例如银行或零售商）工作时，效果就不那么理想。"
}, {
  "tag": "P",
  "text": "That’s where cloud computing enters the field. Cloud computing offers the ability for anyone anywhere to access practically limitless processing power. Cloud vendors such as Amazon Web Services (AWS) offer servers with up 96 virtual CPU cores and up to 768 GB of RAM. These servers can be set up in an autoscaling group where hundreds of them can be launched or stopped without much delay — computing power on demand.",
  "translation": "那就是云计算进入领域的地方。 云计算使任何地方的任何人都可以访问几乎无限的处理能力。 诸如Amazon Web Services（AWS）之类的云供应商为服务器提供了多达96个虚拟CPU内核和高达768 GB的RAM。 可以将这些服务器设置在一个自动扩展组中，在其中可以启动或停止数百个服务器而不会产生太多延迟-按需计算能力。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/0*BOyvhY6IppqgIr_9?q=20",
  "caption": "A Google Cloud data center",
  "type": "image",
  "file": "0*BOyvhY6IppqgIr_9"
}, {
  "tag": "P",
  "text": "Beyond just compute, cloud computing companies are also offering full-fledged platforms for Data Analytics. Google Cloud offers a platform called BigQuery, a serverless and scalable data warehouse giving Data Scientists the ability to store and analyze petabytes of data, all in a single platform. BigQuery can also be connected to other GCP services for Data Science. Using Cloud Dataflow to create data streaming pipelines, Cloud DataProc to run Hadoop or Apache Spark on the data, or using BigQuery ML to build Machine Learning models on the huge datasets.",
  "translation": "除了计算之外，云计算公司还为数据分析提供了完善的平台。 Google Cloud提供了一个称为BigQuery的平台，这是一个无服务器且可扩展的数据仓库，使Data Scientists能够在单个平台上存储和分析PB的数据。 BigQuery也可以连接到其他用于Data Science的GCP服务。 使用Cloud Dataflow创建数据流传输管道，使用Cloud DataProc在数据上运行Hadoop或Apache Spark，或使用BigQuery ML在庞大的数据集上构建机器学习模型。"
}, {
  "tag": "P",
  "text": "Everything from data to processing power is growing. As Data Science matures, we might eventually Data Science being done purely on the cloud due to the sheer volume of the data.",
  "translation": "从数据到处理能力的一切都在增长。 随着数据科学的成熟，由于数据量巨大，我们最终可能会完全在云上完成数据科学。"
}, {
  "tag": "H1",
  "text": "(4) Natural Language Processing",
  "translation": "（4）自然语言处理"
}, {
  "tag": "P",
  "text": "Natural Language Processing (NLP) has made its way firmly into Data Science after huge breakthroughs in Deep Learning research.",
  "translation": "在深度学习研究领域取得巨大突破之后，自然语言处理（NLP）已牢固地进入数据科学领域。"
}, {
  "tag": "P",
  "text": "Data Science first began as an analysis of purely raw numbers since this was the easiest way to handle it and collect it in spreadsheets. If you needed to process any kind of text, it would usually need to be categorized or somehow converted into numbers.",
  "translation": "数据科学最初是对纯原始数据的分析，因为这是处理数据并将其收集在电子表格中的最简单方法。 如果您需要处理任何类型的文本，通常都需要将其分类或以某种方式转换为数字。"
}, {
  "tag": "P",
  "text": "Yet it’s quite challenging to compress a paragraph of text into a single number. Natural language and text contain so much rich data and information — we used to be missing out on it since we lacked the ability to represent that information as numbers.",
  "translation": "但是，将一段文本压缩为一个数字是非常困难的。 自然语言和文本包含了如此丰富的数据和信息，因为我们缺乏将这些信息表示为数字的能力，因此我们常常会错过这些信息。"
}, {
  "tag": "P",
  "text": "Huge advancements in NLP through Deep Learning are fueling the full-on integration of NLP into our regular Data Analysis. Neural Networks can now extract information from large bodies of text incredibly quickly. They’re able to classify text into different categories, determine sentiment about text, and perform analysis on the similarity of text data. In the end, all of that information can be stored in a single feature vector of numbers.",
  "translation": "通过深度学习在NLP中取得的巨大进步推动了NLP与常规数据分析的全面集成。 现在，神经网络可以快速地从大量文本中提取信息。 他们能够将文本分类为不同的类别，确定关于文本的情感，并对文本数据的相似性进行分析。 最后，所有这些信息都可以存储在单个数字特征向量中。"
}, {
  "tag": "P",
  "text": "As a result, NLP becomes a powerful tool in Data Science. Huge datastores of text, not just one-word answers but full-on paragraphs, can be transformed into numerical data for standard analysis. We’re now able to explore datasets that are far more complex.",
  "translation": "结果，NLP成为数据科学中的强大工具。 巨大的文本数据库，不仅是一个单词的答案，而且还有完整的段落，都可以转换为数值数据以进行标准分析。 现在，我们可以探索更为复杂的数据集。"
}, {
  "tag": "P",
  "text": "For example, imagine a news website that wants to see which topics are gaining more views. Without advanced NLP, all one could go off of would be the keywords, or maybe just a hunch as to why a particular title worked well versus another. With today’s NLP, we’d be able to quantify the text on the website, comparing entire paragraphs of text or even webpages to gain much more comprehensive insights.",
  "translation": "例如，假设有一个新闻网站想要查看哪些主题正在获得更多的观看次数。 如果没有高级的NLP，那么所有关键词都将失去作用，或者只是一个预感，为什么一个特定的标题相对于另一个标题效果很好。 使用当今的NLP，我们可以量化网站上的文本，比较整个文本甚至是网页的各个段落，以获得更全面的见解。"
}, {
  "tag": "P",
  "text": "For a technical overview of the most important advancements in NLP over the past few years, you can check out the guide by Victor Sanh.",
  "translation": "有关过去几年NLP最重要进展的技术概述，您可以查看Victor Sanh的指南。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自George Seif的文章《The 4 Hottest Trends in Data Science for 2020》，参考：https://towardsdatascience.com/the-4-hottest-trends-in-data-science-for-2020-3956cd9fc182)",
  "translation": "（本文来源：George Seif的文章《 2020年数据科学的四大趋势》，参考：https：//towardsdatascience.com/the-4-hottest-trends-in-data-science-for-2020-3956cd9fc182）"
}]