[{
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*SKkkedxkFkk2qH0u8eSFyA.jpeg?q=20",
  "caption": "Photo credit: Joshua Earle",
  "type": "image",
  "file": "1*SKkkedxkFkk2qH0u8eSFyA.jpeg"
}, {
  "tag": "H1",
  "text": "7 Reasons Why Smart, Hardworking People Don’t Become Successful",
  "translation": "聪明，努力工作的人无法成功的7个原因"
}, {
  "tag": "P",
  "text": "For the longest time, I believed that if smart people worked hard and grew up in a reasonably nurturing environment, success would come eventually.",
  "translation": "在最长的时间里，我相信，如果聪明的人努力工作并在合理的养育环境中长大，那么成功最终将到来。"
}, {
  "tag": "P",
  "text": "I looked at other people and thought, “Wow, that person’s going to go on to do great things.”",
  "translation": "我看着其他人，心想：“哇，那个人将继续做伟大的事情。”"
}, {
  "tag": "P",
  "text": "But as I grew older, I realized that’s not necessarily the case. A few people I know who are intelligent and have a strong work ethic have gone on to do notable things, while many others are doing fine. Unfortunately, there are some that drift along, unsure about what to do.",
  "translation": "但是随着年龄的增长，我意识到不一定是这种情况。 我认识的一些人很聪明，有很强的职业道德，后来继续做着显着的事情，而其他许多人做得很好。 不幸的是，有些人会随波逐流，不确定该怎么做。"
}, {
  "tag": "P",
  "text": "I then realized that there are a lot of factors when it comes to success, whether it means having a fulfilling career, having great relationships, or staying healthy. Yes, smarts are part of it, and so is work ethic. But there’s more at play than just these two factors.",
  "translation": "然后，我意识到成功涉及很多因素，无论这意味着拥有充实的职业，拥有良好的人际关系还是保持健康。 是的，聪明是其中的一部分，职业道德也是如此。 但是，除了这两个因素之外，还有更多的活动。"
}, {
  "tag": "P",
  "text": "Here are seven reasons why you might not be finding success even if you’re smart and hardworking:",
  "translation": "以下是七个即使您很聪明和努力工作也可能找不到成功的原因："
}, {
  "tag": "H1",
  "text": "1. You don’t reach out to new people.",
  "translation": "1.您不会接触新朋友。"
}, {
  "tag": "P",
  "text": "It’s easy to stick to people you’ve known for a long time. You know each other’s histories and can laugh at inside jokes together. The problem with old friends, though, is that the same ideas are recycled over and over again, and you don’t get to learn new perspectives outside of your bubble.",
  "translation": "坚持很长一段时间的人很容易。 你们知道彼此的历史，可以一起开玩笑。 但是，老朋友们的问题是，相同的想法一遍又一遍地被回收利用，而您却无法在泡沫之外学习新的观点。"
}, {
  "tag": "P",
  "text": "It can be tough to reach out at first to new people, but starting small can help. Aim for a low goal initially, such as introducing yourself to one person a week.",
  "translation": "刚开始接触新朋友可能很困难，但是从小做起可以有所帮助。 最初的目标是低下，例如每周向一个人介绍自己。"
}, {
  "tag": "P",
  "text": "“You have to fight to reach your dream. You have to sacrifice and work hard for it.” — Lionel Messi",
  "translation": "“你必须为实现自己的梦想而奋斗。 您必须为此付出努力”。—莱昂内尔·梅西（Lionel Messi）"
}, {
  "tag": "H1",
  "text": "2. You are averse to change.",
  "translation": "2.您不愿改变。"
}, {
  "tag": "P",
  "text": "Being in the same environment for a long time makes it hard to adapt to something new. The good news is that change presents a chance for opportunities and innovation.",
  "translation": "长时间处于同一环境中很难适应新事物。 好消息是，变革为机遇和创新提供了机会。"
}, {
  "tag": "P",
  "text": "Instead of resisting changes, see how you can make the best of them. Maybe you can cater to a growing businesses need or see a different perspective.",
  "translation": "而不是拒绝更改，而是了解如何充分利用它们。 也许您可以满足不断增长的业务需求，或者换个角度来看。"
}, {
  "tag": "P",
  "text": "Be open to new concepts and curious about the world around you.",
  "translation": "对新概念持开放态度，并对周围的世界感到好奇。"
}, {
  "tag": "H1",
  "text": "3. You’re not willing to take risks.",
  "translation": "3.您不愿意冒险。"
}, {
  "tag": "P",
  "text": "Smart people often choose the safe route. They might follow the same path as their peers or choose a career because it’s considered acceptable by their peers.",
  "translation": "聪明人经常选择安全的路线。 他们可能会选择与同行相同的道路，或者选择职业，因为同行认为这是可以接受的。"
}, {
  "tag": "P",
  "text": "While this guarantees a degree of security, it can be mundane. I hear so often from smart people that they find their jobs unfulfilling and that they want to do something else, but are afraid to do so.",
  "translation": "尽管这保证了一定程度的安全性，但它可能是平凡的。 我经常听到聪明人的来信，他们发现自己的工作不能胜任，他们想做其他事情，但又害怕这样做。"
}, {
  "tag": "P",
  "text": "If you’re thinking about branching out into unfamiliar territory, consider what your life will be like decades from now if you opt not to pursue something. Will you regret it, or will you be happy with your decision?",
  "translation": "如果您打算扩展到陌生的领域，请考虑如果您不追求某些东西，那么几十年后的生活将会是什么样。 您会后悔，还是对自己的决定感到满意？"
}, {
  "tag": "H1",
  "text": "4. You believe you deserve success based on credentials.",
  "translation": "4.您认为应该基于凭据获得成功。"
}, {
  "tag": "P",
  "text": "People that worked hard in school are used to being at the top and told how much potential they show. This seems good initially, but there are some negative side effects.",
  "translation": "在学校努力工作的人习惯于处于最高职位，并告诉他们他们展现出多少潜力。 最初看起来不错，但是有一些负面影响。"
}, {
  "tag": "P",
  "text": "I’ve heard people claim they deserve something because of their intelligence or where they went to school. They expect things to pan out automatically because of their credentials. Sadly, though, life doesn’t work like that.",
  "translation": "我听说有人声称，由于他们的才智或上学的地方，他们应得的东西。 他们希望凭其凭据自动完成任务。 可悲的是，生活并没有像现在这样。"
}, {
  "tag": "P",
  "text": "In the real world, you don’t get results based on the work you put in. You get results based on the combination of hard work, strategic thinking, and some luck involved. You can increase that last factor by working on the first two.",
  "translation": "在现实世界中，您不会基于所做的工作而获得结果。您会基于艰苦的工作，战略性思考以及一些运气的结合而获得结果。 您可以通过处理前两个因素来增加最后一个因素。"
}, {
  "tag": "H1",
  "text": "5. You constantly go after whatever’s exciting at the moment.",
  "translation": "5.您时刻追求着激动人心的时刻。"
}, {
  "tag": "P",
  "text": "One thing I hear often from high achievers is that they hate wasting time.Smart people are all too aware of the value of their time, as time and effort spent on one thing means that they could potentially be missing out on something else.",
  "translation": "我经常从高成就者那里听到的一件事是，他们讨厌浪费时间。聪明的人都太清楚自己时间的价值，因为花费在一件事情上的时间和精力意味着他们可能会错失其他事情。"
}, {
  "tag": "P",
  "text": "While this is a strong attribute, it also means chasing the next big thing and not following through. Starting out in any field or endeavor is tough, and getting through the initial obstacles requires patience.",
  "translation": "尽管这是一个很重要的属性，但它也意味着追逐下一件大事，而不是继续前进。 在任何领域或任何事业中起步都是艰难的，要克服最初的障碍需要耐心。"
}, {
  "tag": "P",
  "text": "Focusing effort on one goal yields much better results in the long run than going after one thing, getting bored, and then going after something new.",
  "translation": "从长远来看，将精力集中在一个目标上要比追求一件事情，变得无聊然后再追求新事物要好得多。"
}, {
  "tag": "H1",
  "text": "6. You can’t commit to a decision.",
  "translation": "6.您无法做出决定。"
}, {
  "tag": "P",
  "text": "Being smart and working hard can open up numerous doors. Unfortunately, having too many options can be as restricting as having few choices.",
  "translation": "聪明而努力地工作可以打开许多门。 不幸的是，选择太多可能与选择很少一样受到限制。"
}, {
  "tag": "P",
  "text": "An abundance of choices makes it difficult to decide what to do. As a result, it’s tempting to jump around and “see what suits you”. I knew someone who attended numerous graduate school programs, one after another. Over ten years later, she still can’t figure out what to do.",
  "translation": "大量的选择使得很难决定该做什么。 因此，很容易跳来跳去，“看看什么适合你”。 我认识一个人，一个又一个地参加了许多研究生课程。 十年后，她仍然不知道该怎么办。"
}, {
  "tag": "P",
  "text": "Rather than dabbling in many endeavors, I suggest testing things out first. Talk to other people and do the research before making a big decision, so that you know whether or not an option suits your personality and lifestyle.",
  "translation": "我建议您先进行测试，而不要花很多精力。 在做出重大决定之前，先与他人交谈并进行研究，以使您知道选择是否适合您的个性和生活方式。"
}, {
  "tag": "H1",
  "text": "7. You don’t believe in yourself.",
  "translation": "7.你不相信自己。"
}, {
  "tag": "P",
  "text": "Surprisingly, smart people can underestimate their own abilities. They are their own worst critic, causing them to believe that they can’t accomplish as much as they can.",
  "translation": "出人意料的是，聪明人会低估自己的能力。 他们是自己最糟糕的批评家，使他们相信自己无法做到最大的成就。"
}, {
  "tag": "P",
  "text": "Smart people have high standards when it comes to their work. Whenever they work on a project, they tend to scrutinize and second-guess the final product.",
  "translation": "聪明的人在工作中具有很高的标准。 每当他们在一个项目上工作时，他们都会仔细检查并猜测最终产品。"
}, {
  "tag": "P",
  "text": "This seems like a good thing on the surface, but it’s often more debilitating than helpful. Perfectionism can hinder people from progressing forward in their goals or starting on anything in the first place.",
  "translation": "表面上看这似乎是一件好事，但通常比帮助更令人虚弱。 完美主义可能会阻碍人们实现自己的目标或从头开始的任何事情。"
}, {
  "tag": "P",
  "text": "“It’s difficult to believe in yourself because the idea of self is an artificial construction. You are, in fact, part of the glorious oneness of the universe. Everything beautiful in the world is within you.” — Russell Brand",
  "translation": "“很难相信自己，因为自我的观念是虚构的。 实际上，您是宇宙光辉一体的一部分。 世界上所有美丽的事物都在您内。” —罗素·布兰德"
}, {
  "tag": "P",
  "text": "So instead of letting fears of “what if” or “I’m not good enough” keep you back from something new, think of how you want your life to look like years from now. Getting started beats waiting for something to happen anytime.",
  "translation": "因此，与其让您不再担心“如果”或“我不够出色”，不如让您远离新事物，而想着您希望自己的生活看起来像几年后一样。 入门让您随时等待着发生的事情。"
}, {
  "tag": "P",
  "text": "What will you do today to get closer to your success? What are some things that have been holding you back?",
  "translation": "您今天要做什么才能更接近成功？ 阻碍您前进的是什么？"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Melissa Chu的文章《7 Reasons Why Smart, Hardworking People Don’t Become Successful》，参考：https://medium.com/@melissachu/7-reasons-why-smart-hardworking-people-dont-become-successful-d4d3b6119cbc)",
  "translation": "（本文翻译自Melissa Chu的文章《聪明，勤奋的人们无法成功的7个原因》，参考：https：//medium.com/@melissachu/7-reasons-why-smart-hardworking-people-dont- 变得成功-d4d3b6119cbc）"
}]