[{
  "tag": "P",
  "text": "Already, a diverse group of researchers and practitioners — computer scientists, engineers, zoologists, and social scientists, among others — is coming together to develop the field of “machine behavior,” in hopes of putting our understanding of AI on a sounder theoretical and technical foundation.",
  "translation": "已经有各种各样的研究人员和实践者，包括计算机科学家，工程师，动物学家和社会科学家等，齐聚一堂，共同开发“机器行为”领域，以期将我们对AI的理解建立在更合理的理论和 技术基础。"
}, {
  "tag": "P",
  "text": "This field does not see robots merely as human-made objects, but as a new class of social actors.",
  "translation": "在这一领域，机器人不仅被视为人造物体，还被视为新型的社会角色。"
}, {
  "tag": "P",
  "text": "The inquiry is urgent. In the not-distant future, AI-endowed machines may, by virtue of either programming or independent learning (a capacity we will have given them), come to exhibit forms of intelligence and behavior that seem strange compared with our own.",
  "translation": "紧急查询。 在不远的将来，通过编程或独立学习（我们将赋予它们的能力），人工智能赋予的机器可能会展现出与我们自己的机器相比似乎奇怪的智力和行为形式。"
}, {
  "tag": "P",
  "text": "We will need to quickly differentiate the behaviors that are merely bizarre from the ones that truly threaten us. The aspects of AI that should concern us most are the ones that affect the core aspects of human social life — the traits that have enabled our species’ survival over the millennia.",
  "translation": "我们将需要迅速区别那些仅是奇怪行为和真正威胁我们的行为。 人工智能最应引起我们关注的方面是那些影响人类社会生活的核心方面的特征，这些特征使我们的物种得以生存数千年。"
}, {
  "tag": "P",
  "text": "The Enlightenment philosopher Thomas Hobbes argued that humans needed a collective agreement to keep us from being disorganized and cruel.",
  "translation": "启蒙哲学家托马斯·霍布斯（Thomas Hobbes）认为，人类需要达成集体协议，以防止我们陷入混乱和残酷的境地。"
}, {
  "tag": "P",
  "text": "He was wrong. Long before we formed governments, evolution equipped humans with a social suite that allowed us to live together peacefully and effectively.",
  "translation": "他错了。 在我们组建政府之前很久，进化就为人类提供了一套社交套件，使我们能够和平有效地生活在一起。"
}, {
  "tag": "P",
  "text": "In the pre-AI world, the genetically inherited capacities for love, friendship, cooperation, and teaching have continued to help us to live communally.",
  "translation": "在AI之前的世界中，通过遗传继承的爱情，友谊，合作和教学的能力继续帮助我们共同生活。"
}, {
  "tag": "P",
  "text": "Unfortunately, humans do not have the time to evolve comparable innate capacities to live with robots. We must therefore take steps to ensure that they can live non-destructively with us. As AI insinuates itself more fully into our lives, we may yet require a new social contract — one with machines rather than with other humans.",
  "translation": "不幸的是，人类没有时间发展与机器人相媲美的先天能力。 因此，我们必须采取步骤，以确保他们能够与我们无损地生活在一起。 随着AI更充分地融入我们的生活，我们可能还需要一项新的社会契约-与机器签订合同，而不是与其他人签订合同。"
}, {
  "tag": "P",
  "text": "Focusing specifically on social spillovers can help. Spillovers in other arenas lead to rules, laws, and demands for democratic oversight. Whether we’re talking about a corporation polluting the water supply or an individual spreading secondhand smoke in an office building, as soon as some people’s actions start affecting other people, society may intervene.",
  "translation": "专注于社会溢出可以有所帮助。 其他领域的溢出导致规则，法律和对民主监督的要求。 无论我们是在谈论污染了供水的公司，还是在办公楼中散布二手烟的个人，一旦有人的行为开始影响他人，社会都可能会介入。"
}, {
  "tag": "P",
  "text": "Because the effects of AI on human-to-human interaction stand to be intense and far-reaching, and the advances rapid and broad, we must investigate systematically what second-order effects might emerge, and discuss how to regulate them on behalf of the common good.",
  "translation": "由于AI对人与人互动的影响是激烈而深远的，并且进展迅速而广泛，因此，我们必须系统地研究可能会出现哪些二阶效应，并讨论如何代表人类对它们进行调节。 共同的利益。"
}, {
  "tag": "P",
  "text": "Kathleen Richardson, an anthropologist at De Montfort University in the U.K., worries a lot about the latter question. As the director of the Campaign Against Sex Robots — and, yes, sex robots are enough of an incipient phenomenon that a campaign against them isn’t entirely premature — she warns that they will be dehumanizing and could lead users to retreat from real intimacy.",
  "translation": "英国德蒙福特大学的人类学家凯瑟琳·理查森（Kathleen Richardson）对后一个问题感到非常担忧。 作为反对性机器人运动的总监，是的，性机器人已经成为一种初期现象，以至于针对性机器人的运动还不完全为时过早。"
}, {
  "tag": "P",
  "text": "We might even progress from treating robots as instruments for sexual gratification to treating other people that way.",
  "translation": "我们甚至可以从将机器人视为性满足的工具发展为以这种方式对待他人。"
}, {
  "tag": "P",
  "text": "Other observers have suggested that robots could radically improve sex between humans. In his 2007 book, Love and Sex With Robots, the iconoclastic chess master turned businessman David Levy considers the positive implications of “romantically attractive and sexually desirable robots.”",
  "translation": "其他观察家建议，机器人可以从根本上改善人与人之间的性关系。 在他的2007年著作《与机器人的爱与性》中，这位打破象棋的国际象棋大师转变为商人大卫·利维（David Levy）认为，“具有极强吸引力和性欲的机器人”具有积极意义。"
}, {
  "tag": "P",
  "text": "He suggests that some people will come to prefer robot mates to human ones (a prediction borne out by the Japanese man who “married” an artificially intelligent hologram last year).",
  "translation": "他建议，有些人会比人类伴侣更喜欢机器人伴侣（这一预测由去年“嫁给”了人工智能全息图的日本男人证实）。"
}, {
  "tag": "P",
  "text": "Sex robots won’t be susceptible to sexually transmitted diseases or unwanted pregnancies.",
  "translation": "性机器人不会感染性传播疾病或意外怀孕。"
}, {
  "tag": "P",
  "text": "And they could provide opportunities for shame-free experimentation and practice — thus helping humans become “virtuoso lovers.” For these and other reasons, Levy believes that sex with robots will come to be seen as ethical, and perhaps in some cases expected.",
  "translation": "他们可以为无耻的实验和实践提供机会，从而帮助人类成为“艺术爱好者”。出于这些原因和其他原因，Levy认为与机器人发生性行为将被视为道德的，甚至在某些情况下是可预期的。"
}, {
  "tag": "P",
  "text": "Long before most of us encounter AI dilemmas this intimate, we will wrestle with more quotidian challenges.",
  "translation": "在我们大多数人亲密接触AI困境之前，我们将与更多的配额挑战作斗争。"
}, {
  "tag": "P",
  "text": "The age of driverless cars, after all, is upon us. These vehicles promise to substantially reduce the fatigue and distraction that bedevil human drivers, thereby preventing accidents.",
  "translation": "毕竟，无人驾驶汽车的时代已经过去。 这些车辆有望显着减轻恶魔般的驾驶员的疲劳感和干扰力，从而防止发生事故。"
}, {
  "tag": "P",
  "text": "But what other effects might they have on people? Driving is a very modern kind of social interaction, requiring high levels of cooperation and social coordination. I worry that driverless cars, by depriving us of an occasion to exercise these abilities, could contribute to their atrophy.",
  "translation": "但是他们可能会对人产生什么其他影响？ 驾驶是一种非常现代的社会互动方式，需要高水平的合作和社会协调。 我担心无人驾驶汽车会剥夺我们行使这些能力的机会，从而导致其萎缩。"
}, {
  "tag": "P",
  "text": "Not only will these vehicles be programmed to take over driving duties and hence to usurp from humans the power to make moral judgments (for example, about which pedestrian to hit when a collision is inevitable), they will also affect humans with whom they’ve had no direct contact.",
  "translation": "这些车辆不仅会被编程为接管驾驶职责，从而从人类手中夺取做出道德判断的能力（例如，在不可避免的碰撞中撞到哪个行人），还会影响与之相处的人 没有直接联系。"
}, {
  "tag": "P",
  "text": "For instance, drivers who have steered awhile alongside an autonomous vehicle traveling at a steady, invariant speed might be lulled into driving less attentively, thereby increasing their likelihood of accidents once they’ve moved to a part of the highway occupied only by human drivers.",
  "translation": "例如，在自动驾驶汽车以稳定，不变的速度行驶了一段时间后转向的驾驶员可能会被吸引到注意力不集中的驾驶中，从而一旦移至仅由人类驾驶员占据的高速公路的一部分，就会增加发生事故的可能性。"
}, {
  "tag": "P",
  "text": "Alternatively, experience may reveal that driving alongside autonomous vehicles traveling in perfect accordance with traffic laws actually improves human performance.",
  "translation": "或者，经验可能表明，与无人驾驶汽车完全按照交通法规行驶实际上可以提高人类的绩效。"
}, {
  "tag": "P",
  "text": "Either way, we would be reckless to unleash new forms of AI without first taking such social spillovers — or externalities, as they’re often called — into account.",
  "translation": "无论哪种方式，我们都会不顾一切地发布新形式的AI，而无需首先考虑这种社会溢出效应或通常被称为外部性的因素。"
}, {
  "tag": "P",
  "text": "We must apply the same effort and ingenuity that we apply to the hardware and software that make self-driving cars possible to managing AI’s potential ripple effects on those outside the car. After all, we mandate brake lights on the back of your car not just, or even primarily, for your benefit, but for the sake of the people behind you.",
  "translation": "我们必须付出与软硬件相同的努力和独创性，使自动驾驶汽车成为可能，以管理AI对车外人员的潜在涟漪效应。 毕竟，我们不仅为您的利益，而且甚至为了您背后的人们，都在您的汽车后部强制配备刹车灯。"
}, {
  "tag": "P",
  "text": "In 1985, some four decades after Isaac Asimov introduced his laws of robotics, he added another to his list: A robot should never do anything that could harm humanity. But he struggled with how to assess such harm. “A human being is a concrete object,” he later wrote. “Injury to a person can be estimated and judged. Humanity is an abstraction.”",
  "translation": "1985年，也就是艾萨克·阿西莫夫（Isaac Asimov）提出机器人法则大约四十年后，他又增加了一个清单：机器人绝对不能做任何可能危害人类的事情。 但是他在如何评估这种伤害方面挣扎。 他后来写道：“人是一个具体的对象。” “可以估计和判断对人的伤害。 人性是一种抽象。”"
}, {
  "tag": "P",
  "text": "In another, virtual experiment, we divided 4,000 human subjects into groups of about 20, and assigned each individual “friends” within the group; these friendships formed a social network.",
  "translation": "在另一个虚拟实验中，我们将4,000名人类受试者分为大约20个小组，并在小组中分配了每个“朋友”。 这些友谊形成了一个社交网络。"
}, {
  "tag": "P",
  "text": "The groups were then assigned a task:",
  "translation": "然后为这些小组分配了一项任务："
}, {
  "tag": "P",
  "text": "Each person had to choose one of three colors, but no individual’s color could match that of his or her assigned friends within the social network. Unknown to the subjects, some groups contained a few bots that were programmed to occasionally make mistakes.",
  "translation": "每个人都必须选择三种颜色中的一种，但是任何人的颜色都无法与他或她在社交网络中分配的朋友的颜色相匹配。 主题不为人所知，一些小组包含一些被编程为偶尔犯错误的机器人。"
}, {
  "tag": "P",
  "text": "Humans who were directly connected to these bots grew more flexible, and tended to avoid getting stuck in a solution that might work for a given individual but not for the group as a whole.",
  "translation": "与这些机器人直接连接的人类变得更加灵活，并倾向于避免陷入可能对给定的个人而不是整个团队有用的解决方案中。"
}, {
  "tag": "P",
  "text": "What’s more, the resulting flexibility spread throughout the network, reaching even people who were not directly connected to the bots. As a consequence, groups with mistake-prone bots consistently outperformed groups containing bots that did not make mistakes. The bots helped the humans to help themselves.",
  "translation": "更重要的是，由此产生的灵活性遍及整个网络，甚至覆盖了与机器人没有直接联系的人。 结果，具有容易出错的机器人的组始终优于包含未犯错误的机器人的组。 机器人帮助人类自我帮助。"
}, {
  "tag": "P",
  "text": "Both of these studies demonstrate that in what I call “hybrid systems” — where people and robots interact socially — the right kind of AI can improve the way humans relate to one another.",
  "translation": "两项研究均表明，在我所说的“混合系统”（人与机器人进行社交互动）中，正确的人工智能可以改善人与人之间的联系方式。"
}, {
  "tag": "P",
  "text": "Other findings reinforce this. For instance, the political scientist Kevin Munger directed specific kinds of bots to intervene after people sent racist invective to other people online.",
  "translation": "其他发现进一步证明了这一点。 例如，政治学家凯文·芒格（Kevin Munger）指示特定种类的机器人在人们向网上其他人发送种族主义煽动行为后进行干预。"
}, {
  "tag": "P",
  "text": "He showed that, under certain circumstances, a bot that simply reminded the perpetrators that their target was a human being, one whose feelings might get hurt, could cause that person’s use of racist speech to decline for more than a month.",
  "translation": "他表明，在某些情况下，一个机器人只是在提醒肇事者他们的目标是人，而这种人的感情可能会受到伤害，这可能会导致该人使用种族主义言论的时间减少一个多月。"
}, {
  "tag": "P",
  "text": "But adding AI to our social environment can also make us behave less productively and less ethically.",
  "translation": "但是，将AI添加到我们的社交环境中也会使我们的行为效率降低，道德行为降低。"
}, {
  "tag": "P",
  "text": "In yet another experiment, this one designed to explore how AI might affect the “tragedy of the commons” — the notion that individuals’ self-centered actions may collectively damage their common interests — we gave several thousand subjects money to use over multiple rounds of an online game.",
  "translation": "在另一个实验中，该实验旨在探讨AI如何影响“公地悲剧”（即个人以自我为中心的行为可能共同损害其共同利益的观念），我们为数千名受试者提供了可用于多轮 一个在线游戏。"
}, {
  "tag": "P",
  "text": "In each round, subjects were told that they could either keep their money or donate some or all of it to their neighbors. If they made a donation, we would match it, doubling the money their neighbors received. Early in the game, two-thirds of players acted altruistically.",
  "translation": "在每个回合中，对象被告知他们可以保留自己的钱，也可以将部分或全部钱捐给邻居。 如果他们做出了捐赠，我们将与之相匹配，使邻居收到的钱翻倍。 在游戏初期，三分之二的玩家表现得无私。"
}, {
  "tag": "P",
  "text": "After all, they realized that being generous to their neighbors in one round might prompt their neighbors to be generous to them in the next one, establishing a norm of reciprocity.",
  "translation": "毕竟，他们意识到在一个回合中对邻居大方，可能会促使邻居在下一回合中对他们大方，从而建立了互惠的准则。"
}, {
  "tag": "P",
  "text": "From a selfish and short-term point of view, however, the best outcome would be to keep your own money and receive money from your neighbors.",
  "translation": "但是，从自私和短期的角度来看，最好的结果是保留自己的钱并从邻居那里得到钱。"
}, {
  "tag": "P",
  "text": "In this experiment, we found that by adding just a few bots (posing as human players) that behaved in a selfish, free-riding way, we could drive the group to behave similarly.",
  "translation": "在该实验中，我们发现仅添加一些表现自私，搭便车的机器人（冒充人类玩家），就可以促使该小组的行为类似。"
}, {
  "tag": "P",
  "text": "Eventually, the human players ceased cooperating altogether. The bots thus converted a group of generous people into selfish jerks.",
  "translation": "最终，人类玩家完全停止了合作。 机器人因此将一群慷慨的人变成了自私的混蛋。"
}, {
  "tag": "P",
  "text": "Let’s pause to contemplate the implications of this finding. Cooperation is a key feature of our species, essential for social life.",
  "translation": "让我们停下来思考一下这一发现的含义。 合作是我们物种的关键特征，对社会生活至关重要。"
}, {
  "tag": "P",
  "text": "And trust and generosity are crucial in differentiating successful groups from unsuccessful ones. If everyone pitches in and sacrifices in order to help the group, everyone should benefit.",
  "translation": "信任和慷慨对于将成功的团队与失败的团队区分开来至关重要。 如果每个人都参与进来并为帮助小组做出牺牲，那么每个人都应该受益。"
}, {
  "tag": "P",
  "text": "When this behavior breaks down, however, the very notion of a public good disappears, and everyone suffers. The fact that AI might meaningfully reduce our ability to work together is extremely concerning.",
  "translation": "但是，当这种行为崩溃时，公共物品的概念就消失了，所有人都会受苦。 人工智能可能会显着降低我们的协作能力这一事实令人极为担忧。"
}, {
  "tag": "P",
  "text": "Already, we are encountering real-world examples of how AI can corrupt human relations outside the laboratory. A study examining 5.7 million Twitter users in the run-up to the 2016 U.S. presidential election found that trolling and malicious Russian accounts — including ones operated by bots — were regularly retweeted in a similar manner to other, unmalicious accounts, influencing conservative users particularly strongly.",
  "translation": "我们已经遇到了现实世界中有关AI如何破坏实验室外人类关系的示例。 一项研究在2016年美国总统大选前夕调查了570万个Twitter用户，该研究发现，经常以与其他无恶意帐户类似的方式转发推特和恶意俄罗斯帐户（包括由机器人操作的帐户），对保守用户的影响尤其强烈 。"
}, {
  "tag": "P",
  "text": "By taking advantage of humans’ cooperative nature and our interest in teaching one another — both features of the social suite — the bots affected even humans with whom they did not interact directly, helping to polarize the country’s electorate.",
  "translation": "通过利用人类的合作性质和我们彼此教书的兴趣-社交套件的两个功能-机器人甚至影响了与他们没有直接互动的人类，从而使该国的选民两极化。"
}, {
  "tag": "P",
  "text": "All of this could end up transforming human society in unintended ways that we need to reckon with as a polity. Do we want machines to affect whether and how children are kind? Do we want machines to affect how adults have sex?",
  "translation": "所有这些最终可能会以一种意想不到的方式改变人类社会，这是我们需要作为政体考虑的。 我们是否希望机器影响孩子是否以及如何友善？ 我们是否希望机器影响成年人的性行为？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/0*-PQrUvjr6ny0QRY9?q=20",
  "caption": "Photo by Michael Prewett on Unsplash",
  "type": "image",
  "file": "0*-PQrUvjr6ny0QRY9"
}, {
  "tag": "P",
  "text": "Consider some experiments from my lab at Yale, where my colleagues and I have been exploring how such effects might play out. In one, we directed small groups of people to work with humanoid robots to lay railroad tracks in a virtual world.",
  "translation": "考虑一下我在耶鲁大学实验室进行的一些实验，我和我的同事一直在探索如何发挥这种作用。 在其中一个中，我们指示一小群人与类人机器人一起在虚拟世界中铺设铁轨。"
}, {
  "tag": "P",
  "text": "Each group consisted of three people and a little blue-and-white robot sitting around a square table, working on tablets. The robot was programmed to make occasional errors — and to acknowledge them: “Sorry, guys, I made the mistake this round,” it declared perkily. “I know it may be hard to believe, but robots make mistakes too.”",
  "translation": "每个小组由三个人和一个坐在方桌周围的蓝白色小机器人组成，他们在平板电脑上工作。 机器人被编程为偶尔犯下错误，并承认它们：“对不起，伙计们，我这一轮犯了错误，”它很高兴地宣布。 “我知道可能很难相信，但是机器人也会犯错误。”"
}, {
  "tag": "P",
  "text": "As it turned out, this clumsy, confessional robot helped the groups perform better — by improving communication among the humans. They became more relaxed and conversational, consoling group members who stumbled and laughing together more often. Compared with the control groups, whose robot made only bland statements, the groups with a confessional robot were better able to collaborate.",
  "translation": "事实证明，这个笨拙，自白的机器人通过改善人与人之间的交流来帮助团队表现更好。 他们变得更加放松和交谈，安慰了经常跌倒和一起大笑的小组成员。 与仅发表平淡无奇的声明的对照组相比，带有悔型机器人的对照组具有更好的协作能力。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/0*fqUEy6cR4YKtMbYt?q=20",
  "caption": "Photo by Lukas on Unsplash",
  "type": "image",
  "file": "0*fqUEy6cR4YKtMbYt"
}, {
  "tag": "H1",
  "text": "Mind Blowing Secrets On How Artificial Intelligence Will Change Humans",
  "translation": "关于人工智能将如何改变人类的令人耳目一新的秘密"
}, {
  "tag": "H2",
  "text": "A deep-dive into how robots will alter humans’ capacity for altruism, love, and friendship.",
  "translation": "深入探讨了机器人将如何改变人类的利他主义，爱与友谊的能力。"
}, {
  "tag": "P",
  "text": "There has always been fears about how robots might transform our lives have been a staple of science fiction for decades.",
  "translation": "数十年来，一直有人担心机器人如何改变我们的生活一直是科幻小说的主要内容。"
}, {
  "tag": "P",
  "text": "As far back in the 1940s, when widespread interaction between humans and artificial intelligence still seemed a distant prospect, Isaac Asimov posited his famous Three Laws of Robotics, which were intended to keep robots from hurting us. The first — “a robot may not injure a human being or, through inaction, allow a human being to come to harm” — followed from the understanding that robots would affect humans via direct interaction, for good and for ill.",
  "translation": "早在1940年代，当人类与人工智能之间广泛的交互作用仍遥遥无期时，艾萨克·阿西莫夫（Isaac Asimov）提出了他著名的机器人三定律，其目的是防止机器人伤害我们。 第一个是“机器人可能不会伤害人类，也可能无所作为而伤害人类”。后来，人们认识到机器人会通过直接的互动影响人类，无论是好是坏。"
}, {
  "tag": "P",
  "text": "Think of classic sci-fi depictions: C-3PO and R2-D2 working with the Rebel Alliance to thwart the Empire in Star Wars, say, or HAL 9000 from 2001: A Space Odyssey and Ava from Ex Machina plotting to murder their ostensible masters. But these imaginings were not focused on AI’s broader and potentially more significant social effects — the ways AI could affect how we humans interact with one another.",
  "translation": "想想经典的科幻小说：例如C-3PO和R2-D2与叛军同盟，在星球大战中挫败帝国，或者说2001年的HAL 9000：来自Ex Machina的太空漫游和Ava阴谋谋杀他们表面上的主人 。 但是，这些想象力并未聚焦于AI的更广泛且潜在的更重要的社会影响，即AI可能影响人类彼此互动的方式。"
}, {
  "tag": "P",
  "text": "Radical innovations have previously transformed the way humans live together, of course.",
  "translation": "当然，激进的创新以前已经改变了人们在一起生活的方式。"
}, {
  "tag": "P",
  "text": "The advent of cities sometime between 5,000 and 10,000 years ago meant a less nomadic existence and a higher population density. We adapted both individually and collectively (for instance, we may have evolved resistance to infections made more likely by these new circumstances).",
  "translation": "5,000到10,000年前的某个时间出现的城市意味着较少的游牧生活和较高的人口密度。 我们对个人和集体都进行了调整（例如，我们可能已经对由这些新情况引起的感染产生了抵抗力）。"
}, {
  "tag": "P",
  "text": "More recently, the invention of technologies including the printing press, the telephone, and the internet revolutionized how we store and communicate information.",
  "translation": "最近，包括印刷机，电话和互联网在内的技术发明彻底改变了我们存储和传达信息的方式。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/0*PCuBiERRlyJkPajY?q=20",
  "caption": "Photo by Franck V. on Unsplash",
  "type": "image",
  "file": "0*PCuBiERRlyJkPajY"
}, {
  "tag": "P",
  "text": "As consequential as these innovations were, however, they did not change the fundamental aspects of human behavior that comprise what I call the “social suite”: a crucial set of capacities we have evolved over hundreds of thousands of years, including love, friendship, cooperation, and teaching.",
  "translation": "然而，尽管这些创新具有重大意义，但它们并没有改变人类行为的基本方面，这些基本方面构成了我所谓的“社交套件”：数十年来，我们已经发展了一套至关重要的能力，包括爱情，友谊， 合作和教学。"
}, {
  "tag": "P",
  "text": "The basic contours of these traits remain remarkably consistent throughout the world, regardless of whether a population is urban or rural, and whether or not it uses modern technology.",
  "translation": "这些特征的基本轮廓在全世界范围内都保持显着一致，无论人口是城市还是农村，是否使用现代技术。"
}, {
  "tag": "P",
  "text": "But adding artificial intelligence to our midst could be much more disruptive. Especially as machines are made to look and act like us and to insinuate themselves deeply into our lives, they may change how loving or friendly or kind we are — not just in our direct interactions with the machines in question, but in our interactions with one another.",
  "translation": "但是，在我们中间添加人工智能可能会更具破坏性。 尤其是当机器看起来像我们一样运转时，将自己深深地融入我们的生活中时，它们可能会改变我们的爱，友善或友善的态度-不仅是我们与所讨论机器的直接交互，而且是我们与一台机器的交互 另一个。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Kelvin Rich PhD的文章《Mind Blowing Secrets On How Artificial Intelligence Will Change Humans》，参考：https://towardsdatascience.com/mind-blowing-secrets-on-how-artificial-intelligence-will-change-humans-361bc01330b1)",
  "translation": "（本文译自Kelvin Rich PhD的文章，《关于人工智能将如何改变人类的秘密揭秘》，参考：https：//towardsdatascience.com/mind-blowing-secrets-on-how-artificial-intelligence-will-change- 人361bc01330b1）"
}]