[{
  "tag": "P",
  "text": "About the author-:",
  "translation": "关于作者-："
}, {
  "tag": "P",
  "text": "Ravi Rajan is a global IT program manager based out of Mumbai, India. He is also an avid blogger, Haiku poetry writer, archaeology enthusiast, and history maniac. Connect with Ravi on LinkedIn, Medium and Twitter.",
  "translation": "Ravi Rajan是位于印度孟买的全球IT计划经理。 他还是一位狂热的博客作者，Hai句诗作家，考古爱好者和历史狂人。 在LinkedIn，Medium和Twitter上与Ravi联系。"
}, {
  "tag": "H1",
  "text": "Be an Everyman’s leader.",
  "translation": "成为每个人的领导者。"
}, {
  "tag": "P",
  "text": "The essential developer is an everyman’s leader.",
  "translation": "重要的开发人员是每个人的领导者。"
}, {
  "tag": "P",
  "text": "He might not have any position or power but he always takes that extra effort to help whoever needs his help. He is an agent of change and quite often developers flock around him rather than around their managers when they are feeling lost or stuck somewhere. He sees you struggle, take five minutes to teach one neat trick and show you that you can do it too. He creates a single point of trust who can be approached by anybody in times of need.",
  "translation": "他可能没有任何职位或权力，但他总是会付出额外的努力来帮助需要帮助的人。 他是变革的推动者，当开发人员感到迷失或困在某个地方时，开发人员通常会聚集在他周围而不是他们的经理周围。 他看到您很挣扎，花了五分钟来教一个巧妙的技巧，并告诉您您也可以做到。 他创建了一个信任点，任何人在需要时都可以与他联系。"
}, {
  "tag": "P",
  "text": "And at crunch times, the everyman’s leader rises to the occasion, help people around them rally and organize, and work cooperatively to resolve the part of the situation they have some influence over. And above all, they do not hoard knowledge as they know knowledge is power only when it is shared. They share their knowledge because they consider that if it’s useful to them, it will be useful to everyone.",
  "translation": "在紧要关头，每个人的领导者都应时而起，帮助周围的人们集会和组织，并共同努力解决他们所影响的部分局势。 最重要的是，他们不会ho积知识，因为他们知道知识只有在被共享时才是力量。 他们之所以分享知识，是因为他们认为，如果这对他们有用，那么它将对每个人都有用。"
}, {
  "tag": "P",
  "text": "That said, the main characteristics of a real rock star developer are the same for almost any field or position: integrity, adaptability, and the desire to do excellent work. And it all comes down to one simple truth; — pour your soul into whatever you do. Represent your brand in such a way that the whole world knows that you own it. You will then be truly a star in the real sense.",
  "translation": "就是说，真正的摇滚明星开发者的主要特征在几乎任何领域或职位上都是相同的：完整性，适应性以及对出色工作的渴望。 一切都归结为一个简单的事实； –将您的灵魂投入到您所做的任何事情中。 以全世界都知道您拥有品牌的方式来代表您的品牌。 然后，您将真正成为真正的明星。"
}, {
  "tag": "P",
  "text": "As Ice cube has rightly said.",
  "translation": "正如Ice cube所说的那样。"
}, {
  "tag": "P",
  "text": "Don’t worry about being a star, worry about doing good work, and all that will come to you.",
  "translation": "不用担心成为明星，不用担心做得好，所有这些都会带给您。"
}, {
  "tag": "H1",
  "text": "Control FOMO-Fear of Missing Out.",
  "translation": "控制FOMO-对缺失的恐惧。"
}, {
  "tag": "P",
  "text": "Essential developers are eager to explore new opportunities but also very selective in what they choose to do and what they choose not to do.",
  "translation": "重要的开发人员渴望探索新的机遇，但同时也非常挑剔地选择要做和不做的事情。"
}, {
  "tag": "P",
  "text": "For example, you want to attend a highly informative course on SAP HANA. But the timings are clashing with a meeting, which you need to attend every day to give a status update. You know precisely that you do not contribute anything to the meeting but people expect you to be present in the meeting. You are popular and don’t want to disappoint anybody but at the same time, you know the meeting is not adding any value to you or to the team.",
  "translation": "例如，您想参加有关SAP HANA的内容丰富的课程。 但是时间安排与会议冲突，您需要每天参加会议以更新状态。 您确切地知道您对会议不做任何贡献，但是人们希望您能参加会议。 您很受欢迎，不想让任何人失望，但同时，您知道这次会议不会给您或团队带来任何价值。"
}, {
  "tag": "P",
  "text": "What will you do? The real fight here is between satisfying your ego versus satisfying your knowledge. Essential developers know that tangible value far outweighs the loss in popularity votes and they select precisely that.",
  "translation": "你会怎么做？ 这里真正的斗争是在满足自我与满足知识之间。 重要的开发人员知道，有形价值远远超过了人气投票所带来的损失，因此他们选择了这一点。"
}, {
  "tag": "P",
  "text": "Essential developers do a trade-off between the essential and non-essential every day. They are OK if there is a drop in popularity as their focus is on long term tangible results which benefit all. They believe and advocate the logic that less means more and more = mediocre. More and more is always valueless.",
  "translation": "基本开发人员每天都要在基本和非必需之间进行权衡。 如果人气下降，他们会没事，因为他们的重点是使所有人受益的长期有形成果。 他们相信并倡导逻辑，即少意味着越来越多=平庸。 越来越多总是无价的。"
}, {
  "tag": "P",
  "text": "Staying true to your purpose and being selective results in a more meaningful quality of life. Essential developers are not afraid of missing out on the action. Rather they relish the joy of missing out(JOMO) so that they can use the time constructively.",
  "translation": "忠于您的目标并有选择性，可以带来更有意义的生活质量。 基本开发人员不怕错过这一行动。 相反，他们喜欢错过（JOMO）的乐趣，以便他们可以建设性地利用时间。"
}, {
  "tag": "P",
  "text": "Essential developers focus on the real work, their real results and let the non-essential fall away.",
  "translation": "重要的开发人员专注于实际工作，他们的实际结果，并让那些不必要的东西消失了。"
}, {
  "tag": "H1",
  "text": "Be a Linchpin.",
  "translation": "成为关键。"
}, {
  "tag": "P",
  "text": "Seth Godin in his book Linchpin describes the linchpin as a person who can “invent, lead (regardless of title), connect others, make things happen, and create order out of chaos.” Linchpins are the people who can work with “no rule book,” people who are happy to always make their best effort to transform even mundane tasks into works of art to be cherished.",
  "translation": "塞思·戈丁（Seth Godin）在他的Linchpin一书中将其描述为一个可以“发明，领导（不分头衔），与他人联系，使事情成真，摆脱混乱的秩序”的人。 一本书，”那些乐意尽最大努力将平凡的工作变成值得珍惜的艺术品的人们。"
}, {
  "tag": "P",
  "text": "And as a developer, you can be a linchpin by simply gifting your knowledge. In ancient tribes, those who had the most power, the Kings and Queens and Chiefs were those who gave the most gifts. In the modern world, a developer’s power comes by gifting empowerment to other developers. There can be several simple ways to go about it.",
  "translation": "作为开发人员，只需提供知识就可以成为关键。 在古代部落中，权力最大的人，国王，皇后和酋长是给予最多礼物的人。 在现代世界中，开发人员的权力来自赋予其他开发人员权力。 可以有几种简单的方法来解决它。"
}, {
  "tag": "P",
  "text": "· Be a mentor and groom junior developers",
  "translation": "·成为导师和新郎初级开发人员"
}, {
  "tag": "P",
  "text": "· Write utility codes that can be used by all.",
  "translation": "·编写可供所有人使用的实用程序代码。"
}, {
  "tag": "P",
  "text": "· Create a side initiative project in cutting edge technologies involving other developers.",
  "translation": "·在涉及其他开发人员的尖端技术上创建一个附带计划。"
}, {
  "tag": "P",
  "text": "And so on…",
  "translation": "等等…"
}, {
  "tag": "P",
  "text": "The key here is to give your art for free without expecting any repayment in return. This can be your best ideas, your incredible coding skills or open-sourcing that amazing software you designed.",
  "translation": "这里的关键是免费提供您的艺术品，而无需任何回报。 这可能是您的最佳想法，令人难以置信的编码技能，或者是开源的您设计的出色软件。"
}, {
  "tag": "P",
  "text": "By empowering the team with the most precious gift you ever gave, you are not only building your own tribe but also fostering diverse creative energies within the team.",
  "translation": "通过为您的团队赋予您有史以来最宝贵的礼物，您不仅可以建立自己的部落，而且可以在团队中培养各种创造力。"
}, {
  "tag": "P",
  "text": "So far so good. But that brings us to another question.",
  "translation": "到目前为止，一切都很好。 但这给我们带来了另一个问题。"
}, {
  "tag": "P",
  "text": "Do rock stars remain rock stars forever? Why do we often see situations when developers start as rock stars and end up being mediocre? What brings their downfall?",
  "translation": "摇滚明星会永远保持摇滚明星吗？ 为什么我们经常看到开发人员起初是摇滚明星而最终变得平庸的情况？ 是什么导致他们的垮台？"
}, {
  "tag": "P",
  "text": "The short answer is indispensability.",
  "translation": "简短的答案是必不可少的。"
}, {
  "tag": "P",
  "text": "Their downfall starts from the day they start becoming indispensable to the project. Work starts revolving around them and sooner or later they end up getting sucked into work from all sides. No meeting starts without them. No solution is complete unless vetted by them. They cannot go on vacation as nobody is there to cover for them. And the other developers get so accustomed to The Rockstar handling difficult problems that they become lazy and complacent.",
  "translation": "他们的垮台从他们开始对项目不可或缺的那一天开始。 工作开始围绕他们展开，迟早他们最终从各个方面陷入工作。 没有他们，任何会议都不会开始。 除非经过他们的审核，否则没有完整的解决方案。 他们无法去度假，因为没有人可以掩护他们。 其他开发人员已经习惯了Rockstar处理棘手的问题，以至于变得懒惰而自满。"
}, {
  "tag": "P",
  "text": "The result? The rock star loses his creativity. He gets burned out. His work degenerates and becomes scrappier by the day and one day he quits. The project suffers. The team suffers and the company suffers for putting all the eggs in one basket. The rock star developer also, often never recovers from the burnout scars and becomes a mediocre developer who does his work assigned to him, nothing more.",
  "translation": "结果？ 摇滚明星失去了创造力。 他被烧死了。 他的工作在一天一天的退役中变得简陋而变得残酷。 该项目受到影响。 团队受苦，公司将所有鸡蛋都放在一个篮子里而受苦。 这位摇滚巨星的开发者通常也永远无法从倦怠的疤痕中恢复过来，而成为了一个平庸的开发者，他将自己的工作分配给他。"
}, {
  "tag": "P",
  "text": "The lesson here is becoming essential and not indispensable.",
  "translation": "这里的课程变得必不可少，并非必不可少。"
}, {
  "tag": "P",
  "text": "An essential developer focuses on the work to be done but keeps himself out of the picture. Their goal is to help others help themselves so that they can free their time for bigger things.",
  "translation": "一个重要的开发人员专注于要完成的工作，但使自己置若out闻。 他们的目标是帮助他人自助，以便他们腾出时间来做更大的事情。"
}, {
  "tag": "P",
  "text": "An indispensable developer, on the other hand, monopolizes all the work and hurts himself and the team in the long run. The essential developer creates a team of rock stars and the indispensable developer leaves behind a motley of ignorant and incompetent fools.",
  "translation": "另一方面，一个不可或缺的开发人员将垄断所有工作，从长远来看会伤害自己和团队。 必备的开发人员创建了一支由摇滚明星组成的团队，而必不可少的开发人员则留下了无知和无能的傻瓜。"
}, {
  "tag": "P",
  "text": "And real rock star developers leave behind a 10 X times more effective team rather than focusing on being 20 X times better than the rest of the team.",
  "translation": "真正的摇滚明星开发人员留下的团队效率要比其他团队提高20倍，而不是团队的效率提高10倍。"
}, {
  "tag": "P",
  "text": "Here are some ways to be a real rock star developer.",
  "translation": "这是成为真正的摇滚明星开发者的一些方法。"
}, {
  "tag": "H1",
  "text": "How to Be a Rock Star Developer.",
  "translation": "如何成为摇滚明星开发者。"
}, {
  "tag": "H2",
  "text": "Be essential, not indispensable.",
  "translation": "是必不可少的，不是必不可少的。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/40/1*klq3DHBrtjUb_JljEImIiw.jpeg?q=20",
  "caption": "Image Credits : Pixabay.com",
  "type": "image",
  "file": "1*klq3DHBrtjUb_JljEImIiw.jpeg"
}, {
  "tag": "P",
  "text": "Ask anybody to describe a rock star developer and you will get a myriad list of definitions.",
  "translation": "让任何人描述一个摇滚明星开发者，您将获得无数的定义列表。"
}, {
  "tag": "P",
  "text": "· They solve every problem quickly",
  "translation": "·他们迅速解决所有问题"
}, {
  "tag": "P",
  "text": "· They are deadline beaters",
  "translation": "·他们是最后期限的殴打者"
}, {
  "tag": "P",
  "text": "· Their code is virtually bug-free",
  "translation": "·他们的代码几乎没有错误"
}, {
  "tag": "P",
  "text": "· They love taking challenges which are unsolvable",
  "translation": "·他们喜欢接受无法解决的挑战"
}, {
  "tag": "P",
  "text": "· They are the backbone of the project. Nothing works without them.",
  "translation": "·它们是项目的支柱。 没有他们，没有任何工作。"
}, {
  "tag": "P",
  "text": "And so on…….",
  "translation": "等等……。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Ravi Shankar Rajan的文章《How to Be a Rock Star Developer.》，参考：https://medium.com/swlh/how-to-be-a-rock-star-developer-4c7b0d17a9a0)",
  "translation": "（本文翻译自Ravi Shankar Rajan的文章，《如何成为一名摇滚明星开发者》，参考：https：//medium.com/swlh/how-to-be-a-rock-star-developer-4c7b0d17a9a0）"
}]