[{
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*-BoC1TULqBUhCw-TdGaBgQ.png?q=20",
  "caption": "Photo credit: https://www.stickpng.com/img/sports/soccer-football/premier-league-logo",
  "type": "image",
  "file": "1*-BoC1TULqBUhCw-TdGaBgQ.png"
}, {
  "tag": "H1",
  "text": "The Premier League so far",
  "translation": "迄今为止的英超联赛"
}, {
  "tag": "H2",
  "text": "A mid-season analysis of the most entertaining football league in the world",
  "translation": "对世界上最有趣的足球联赛的赛季中分析"
}, {
  "tag": "P",
  "text": "Jamie Vardy is banging in goals and he is in a very prolific form. Arsenal fans are displaying their best forms of hysterics on ArsenalFanTv as the team is having their worst season in a while. Chelsea has surprisingly thrived well even though they could not sign anyone over the transfer window.",
  "translation": "杰米·瓦迪（Jamie Vardy）射门得分，他的状态非常好。 由于球队经历了一段时间以来最糟糕的赛季，阿森纳球迷会在ArsenalFanTv上展示他们最好的歇斯底里形式。 切尔西出人意料地蓬勃发展，尽管他们无法在转会窗口签名任何人。"
}, {
  "tag": "P",
  "text": "Manchester City has been performing fairly for a team that is considered as champions. Manchester United, like Arsenal, has not really done well. Though, they are performing well in big games only to screw up in small games.",
  "translation": "曼城一直在为一支被认为是冠军的球队表现良好。 像阿森纳一样，曼联的表现还不是很好。 不过，他们在大型游戏中的表现不错，只是在小型游戏中陷入困境。"
}, {
  "tag": "P",
  "text": "Tottenham Hotspur have had some problems with figuring out how to function properly but Jose Mourinho has come to their rescue and there are some signs of improvement. A team that has surprised me is Sheffield United. They have managed to display a performance that has kept them consistently in the top 7 despite just getting promoted.",
  "translation": "托特纳姆热刺队在确定如何正常运转方面遇到了一些问题，但穆里尼奥已经出手救援，并且有改善的迹象。 令我惊讶的是谢菲尔德联。 尽管获得了晋升，他们还是设法保持了前7名的表现。"
}, {
  "tag": "P",
  "text": "Above all, Liverpool has been on a high road to success by delivering a very dominant performance. Jurgen Klopp has created a dynasty with this squad. They always win no matter who they are facing. Van Dijk is looking solid at the back. The midfield is easily supplying the attacking trio with amazing passes that leads to important goals.",
  "translation": "最重要的是，利物浦通过提供卓越的性能一直走在成功之路上。 于尔根·克洛普（Jurgen Klopp）为此小队创建了王朝。 无论面对谁，他们总是赢。 Van Dijk的后卫看上去很稳固。 中场轻松地为进攻三人提供惊人的传球，从而带入重要的进球。"
}, {
  "tag": "P",
  "text": "It is currently the middle of the season and an analysis of the teams’ mid-season performance has been carried out.",
  "translation": "目前是赛季中期，已经对球队的赛季中表现进行了分析。"
}, {
  "tag": "H1",
  "text": "The Premier League Mid-Season Table Analysis",
  "translation": "英超联赛中期分析"
}, {
  "tag": "P",
  "text": "Data was collected for analyzing the team’s mid-season performance. Using premier league’s website, the recent table was gotten via this link.",
  "translation": "收集数据用于分析球队的赛季中期表现。 通过英超联赛的网站，可以通过此链接获得最近的表格。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/25/1*5EO3YiYipckAYDL1ddUHZA.png?q=20",
  "caption": "The Premier League mid-season table of 2019/20.",
  "type": "image",
  "file": "1*5EO3YiYipckAYDL1ddUHZA.png"
}, {
  "tag": "P",
  "text": "As expected, Liverpool is first with a game in hand. Leicester City is second, thanks to Jamie Vardy’s prolific form and Brendan Rodgers being a top manager. Manchester city is not at their best and sits in third place. Chelsea is surprisingly fourth. Wolves is proving to be a top-tier team and sits in fifth place. Tottenham, sixth. Manchester United and Arsenal are eighth and eleventh respectively. The bottom three consists of Aston Villa, Watford and Norwich City who are eighteenth, nineteenth and twentieth respectively.",
  "translation": "不出所料，利物浦首先拥有一场比赛。 莱斯特城排名第二，这要归功于杰米·瓦迪（Jamie Vardy）的高产表现以及布伦丹·罗杰斯（Brendan Rodgers）担任总经理。 曼彻斯特城不是最好的，排名第三。 切尔西令人惊讶地排名第四。 事实证明，狼队是顶级球队，排名第五。 托特纳姆热刺，第六。 曼联和阿森纳分别排名第八和第十一位。 后三名分别是阿斯顿维拉，沃特福德和诺里奇市，分别为第十八，第十九和第二十名。"
}, {
  "tag": "H2",
  "text": "Biggest Winners vs Biggest Losers",
  "translation": "最大赢家vs最大输家"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*yBDpLHs0SqYZwXV4OCPOVA.png?q=20",
  "type": "image",
  "file": "1*yBDpLHs0SqYZwXV4OCPOVA.png"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*qawmRIVUAw6DhpjQs4D5lA.png?q=20",
  "caption": "The graph on the left shows which teams have won the most games. The graph on the right shows which team has lost the most games.",
  "type": "image",
  "file": "1*qawmRIVUAw6DhpjQs4D5lA.png"
}, {
  "tag": "P",
  "text": "Having won 17 games out of 18, Liverpool takes the top spot as the biggest winners. Leicester City, who is second on the table, is joined by Manchester City in second place with 12 wins. Chelsea has 10 wins and is fourth. Tottenham Hotspur is fifth.",
  "translation": "利物浦赢得了18场比赛中的17场，成为最大赢家。 排在第二位的莱斯特城排名第二，曼城以12胜排名第二。 切尔西取得10胜，排名第四。 托特纳姆热刺队排名第五。"
}, {
  "tag": "P",
  "text": "Norwich City is last on the table and it is no surprise that it has lost the most games with 13 losses. Aston Villa, who is also in relegation zone, is second and has lost 11 games. Watford and Southampton are tied for third place with 10 losses. West Ham United, AFC Bournemouth, Brigthon & Hove Albion, Everton and Burnley all have 9 losses and are fifth.",
  "translation": "诺里奇城排在最后一位，毫不奇怪，它输掉了最多的13场比赛。 也在降级区的阿斯顿维拉排名第二，已经输了11场比赛。 沃特福德和南安普敦以10赔率并列第三。 西汉姆联，伯恩茅斯，布里滕和霍夫·阿尔比恩，埃弗顿和伯恩利都输了9场，排名第五。"
}, {
  "tag": "H2",
  "text": "Who loves sharing points the most?",
  "translation": "谁最喜欢分享积分？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*PQhIDEeupQZg0w9bkB1R0g.png?q=20",
  "caption": "A graph showing which teams share points the most in the premier league mid-season of 2019/20",
  "type": "image",
  "file": "1*PQhIDEeupQZg0w9bkB1R0g.png"
}, {
  "tag": "P",
  "text": "It turns out Wolves and Arsenal are more than willing to give opposition teams a point when they face them. They have both tied 9 games. In second place sits Sheffield United, who has drawn 8 games. Watford and Manchester United are in fourth place with 7 draws.",
  "translation": "事实证明，狼队和阿森纳队非常愿意在面对对手时给点意见。 他们俩都打了9场比赛。 谢菲尔德联（Sheffield United）位居第二，他参加了8场比赛。 沃特福德和曼联以7平局排名第四。"
}, {
  "tag": "H2",
  "text": "Goal Scored vs Goal Conceded",
  "translation": "进球数与入球数"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*WfoXiVWALJAXE1DPeOYBLA.png?q=20",
  "type": "image",
  "file": "1*WfoXiVWALJAXE1DPeOYBLA.png"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*Yi_9i7WphGkG8xBiN2mwPw.png?q=20",
  "caption": "The graph on the left shows how many goals the teams have scored. The graph on the right shows how many goals the teams have conceded.",
  "type": "image",
  "file": "1*Yi_9i7WphGkG8xBiN2mwPw.png"
}, {
  "tag": "P",
  "text": "Manchester City, which boasts a strong attacking force, has scored 52 goals so far and have the highest number of mid-season goals. Liverpool is second with 46 goals. Leicester City has scored about 41 goals and are third. Tottenham and Chelsea are fourth and fifth after scoring 34 and 33 goals respectively.",
  "translation": "曼城拥有强大的进攻力量，到目前为止已经打入52球，并且是赛季中进球数最多的。 利物浦以46个进球排名第二。 莱切斯特城已经打进41球，排名第三。 托特纳姆热刺和切尔西分别打进34和33球，分别位列第四和第五。"
}, {
  "tag": "P",
  "text": "Being at the bottom must be tough for Norwich City. They have already managed to let in 38 goals which sees them as the biggest conceding team. Southampton is second as a result of Leicester City’s 9 — 0 thrashing and have conceded 37 goals in total. Aston Villa and Watford have both conceded 33 goals which makes both of them third. Burnley and West Ham United are fifth after conceding 30 goals each.",
  "translation": "对于诺威奇市来说，处于最底层必须是艰难的。 他们已经成功打入38球，这是他们最大的失球篮。 南安普敦以莱斯特城9-0的比分排名第二，总共失球37球。 阿斯顿维拉（Aston Villa）和沃特福德（Watford）都承认了33个进球，这使他们俩都排名第三。 伯恩利和西汉姆联分别失球30球，排名第五。"
}, {
  "tag": "H1",
  "text": "Player Analysis",
  "translation": "玩家分析"
}, {
  "tag": "P",
  "text": "Information about players’ performance was gathered from the premier league website using this link.",
  "translation": "使用此链接从英超联赛网站上收集了有关球员表现的信息。"
}, {
  "tag": "H2",
  "text": "Highest Goal Scorers — Chat S*** Get Banged!",
  "translation": "进球数最高的人-聊天S ***被撞！"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*EyaIyQC5vyTtIn4FjcadUQ.png?q=20",
  "caption": "The highest goal scorers of the premier league mid-season of 2019/20",
  "type": "image",
  "file": "1*EyaIyQC5vyTtIn4FjcadUQ.png"
}, {
  "tag": "P",
  "text": "Jamie Vardy. What a beast! He has been deadly this season and has recorded 17 goals which makes him the highest goalscorer. Aubameyang of Arsenal is second with 12 goals. Tammy Abraham, Danny Ings, Marcus Rashford and Raheem Sterling have all found the back of the net 10 times and they are all third.",
  "translation": "杰米·瓦迪（Jamie Vardy）。 真是野兽！ 他本赛季一直是致命的，已经记录了17个进球，这使他成为射手得分最高的球员。 阿森纳的奥巴梅扬以12个进球排名第二。 塔米·亚伯拉罕（Tammy Abraham），丹尼·英格斯（Danny Ings），马库斯·拉什福德（Marcus Rashford）和拉希姆·斯特林（Raheem Sterling）都十次找到篮网，他们都排在第三位。"
}, {
  "tag": "H2",
  "text": "Top Playmakers — How May I Assist You?",
  "translation": "顶尖游戏制作人-我将如何协助您？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*rzC40nlyFhRekfJ2eXBNjw.png?q=20",
  "caption": "The best playmakers in the premier league mid-season of 2019/20",
  "type": "image",
  "file": "1*rzC40nlyFhRekfJ2eXBNjw.png"
}, {
  "tag": "P",
  "text": "The King of playmaking, Kevin De Bruyne, has 11 assists which sees him take the spotlight as first. Second place goes to boy wonder, Trent Alexander Arnold, who has 8 assists. Son is third with 7 assists. Mane, David Silva and Raul Jimenez are fourth with 6 assists.",
  "translation": "游戏界之王凯文·德·布鲁因（Kevin De Bruyne）拥有11次助攻，这使他成为首个亮点。 第二名是特恩特·亚历山大·阿诺德（Trent Alexander Arnold），他获得了8次助攻。 儿子以7次助攻排名第三。 鬃毛，大卫席尔瓦和劳尔·希门尼斯以6次助攻排名第四。"
}, {
  "tag": "H2",
  "text": "Clean sheets — Who Saves the day the most?",
  "translation": "干净的床单—谁最节省一天？"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*FBB4acntXEnIWMY_asoVbA.png?q=20",
  "caption": "Clean sheets in the premier league mid-season of 2019–20",
  "type": "image",
  "file": "1*FBB4acntXEnIWMY_asoVbA.png"
}, {
  "tag": "P",
  "text": "Dean Henderson of Sheffield United, Nick Pope of Burnley and Kasper Schmeichel of Leicester City share the top spot for the most clean sheets with 7 clean sheets each. Vincent Gualta and Ederson are fourth after recording 6 clean sheets. Last season’s keeper of the season, Allison, has 3 clean sheets so far.",
  "translation": "谢菲尔德联队的Dean Henderson，伯恩利的Nick Pope和莱斯特城的Kasper Schmeichel分别以7张干净的床单位居最干净的床位榜首。 Vincent Gualta和Ederson在录制6张干净的床单之后排名第四。 上个赛季的冠军阿里森（Allison）到目前为止有3张干净的床单。"
}, {
  "tag": "H1",
  "text": "Conclusion",
  "translation": "结论"
}, {
  "tag": "P",
  "text": "No one knows what is going to happen for the rest of the season. The premier league is a league filled with entertainment and has a lot of suspense to it. Part of this suspense comes from top four race and the relegation zone battle which can last till the final match day.",
  "translation": "没有人知道本赛季余下的时间。 英超联赛是一个充满娱乐性的联赛，对此有很多悬念。 悬念的一部分来自前四名的比赛以及保级区战役，这场战斗可以持续到最后一场比赛日。"
}, {
  "tag": "H2",
  "text": "Fun fact:",
  "translation": "有趣的事实："
}, {
  "tag": "P",
  "text": "This is my 19th article and I am analyzing the first 19 matches of the premier league season.",
  "translation": "这是我的第19篇文章，我正在分析英超联赛赛季的前19场比赛。"
}, {
  "tag": "P",
  "text": "The full version of the code that was used to carry out the project can be seen here.",
  "translation": "可以在此处查看用于执行该项目的代码的完整版本。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Mubarak Ganiyu的文章《The Premier League so far》，参考：https://towardsdatascience.com/the-premier-league-so-far-5bf1d95afbc8)",
  "translation": "（本文翻译自Mubarak Ganiyu的文章《迄今为止的英超联赛》，参考：https：//towardsdatascience.com/the-premier-league-so-far-5bf1d95afbc8）"
}]