[{
  "tag": "P",
  "text": "Originally published at https://www.chris-saylor.com on April 25, 2019.",
  "translation": "最初于2019年4月25日发布在https://www.chris-saylor.com。"
}, {
  "tag": "H1",
  "text": "Learning to Be a Tech Lead",
  "translation": "学习成为技术主管"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*422pIhLADSPD1PnP.jpg?q=20",
  "type": "image",
  "file": "0*422pIhLADSPD1PnP.jpg"
}, {
  "tag": "P",
  "text": "For most of my career, I’ve been an individual contributor: focused on the tasks at hand, writing code, among other things. All of that changed about six years ago. I found myself managing products, releases, infrastructure, and making many software decisions. As a result, I was promoted to “Lead Software Engineer.” Other developers were looking to me for answers, and I was involved with high-level decisions for products and features, so it seemed like a natural progression. However, I was ill-prepared for what it takes to be a lead engineer.",
  "translation": "在我的职业生涯的大部分时间里，我都是个人贡献者：专注于手头的任务，编写代码等。 所有这些都在六年前发生了变化。 我发现自己管理产品，发行版，基础架构，并做出许多软件决策。 结果，我被提升为“首席软件工程师”。其他开发人员也在向我寻求答案，并且我参与了产品和功能的高层决策，因此这似乎是自然而然的进步。 但是，我对担任首席工程师的准备并不充分。"
}, {
  "tag": "P",
  "text": "First, let me define what being a lead engineer means at Zumba™:",
  "translation": "首先，让我定义在Zumba™中担任首席工程师意味着什么："
}, {
  "tag": "UL",
  "texts": ["Work with product managers in determining the technical needs of a product.", "Ensure product milestones get reached on time.", "Orchestrate the tasks of the team to reach an ultimate goal.", "Manage production-related changes (schema updates, third-party provisioning).", "Provide technical direction to developers on my team.", "Write some code."],
  "translations": ["与产品经理一起确定产品的技术需求。", "确保按时达到产品里程碑。", "协调团队的任务以实现最终目标。", "管理与生产相关的更改（架构更新，第三方配置）。", "为我团队中的开发人员提供技术指导。", "编写一些代码。"]
}, {
  "tag": "P",
  "text": "These may or may not be or mean the same thing at other companies, but I would imagine they are at least similar in scope.",
  "translation": "这些在其他公司可能相同，也可能不同，但我想它们的范围至少相似。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/freeze/max/60/0*vorEGP7m4ELe81b3.gif?q=20",
  "type": "image",
  "file": "0*vorEGP7m4ELe81b3.gif"
}, {
  "tag": "P",
  "text": "The first real lesson I learned, which seemed counter-intuitive to me at the time, is that I had to let go of the fine details. I had to let go of control of how every task is completed. I just had to let go. It is a tough thing to do when you have been an individual contributor for years. I care deeply for writing quality software, its performance characteristics, and its security implications. The details of each part of the product are essential, but they are no longer my job. They are the job of the engineers on my team. To let go is to trust the individual engineers of my team will care for these things just as I did. I have to give my team the same opportunities to learn and fail that was afforded to me.",
  "translation": "我学到的第一个真实的课程（当时对我来说是违反直觉的）是我不得不放弃一些细节。 我不得不放弃对每个任务完成方式的控制。 我只是不得不放手。 当您多年以来一直是个人贡献者时，要做的事情很难。 我非常关心编写高质量的软件，其性能特征及其安全隐患。 产品每个部分的细节都是必不可少的，但它们不再是我的工作。 他们是我团队中工程师的工作。 放手就是相信我们团队的各个工程师会像我一样关心这些事情。 我必须给我的团队同样的学习和失败的机会。"
}, {
  "tag": "P",
  "text": "Like a carefully planted garden, you have to cultivate these attributes into the team. It has to start with the lead being the embodiment of those values.",
  "translation": "就像精心种植的花园一样，您必须将这些属性融入团队。 它必须首先是那些值的体现。"
}, {
  "tag": "P",
  "text": "There’s also a strange phenomenon that occurs when you start to let go of the individual tasks: feeling unproductive. I began to spend a lot less time coding, and more time looking at other’s code or organizing task tickets or assisting with deployment planning. Indeed, my productivity did decrease which is the nature of this role. That lost individual productivity is regained if not amplified by the increases of productivity of my team.",
  "translation": "当您开始放开各个任务时，还会发生一种奇怪的现象：感到无能为力。 我开始花更少的时间在编码上，而花更多的时间在看别人的代码或组织任务单或协助部署计划。 确实，我的生产力确实下降了，这是这个角色的本质。 如果我的团队的生产力没有得到提高，那损失的个人生产力将得到弥补。"
}, {
  "tag": "P",
  "text": "There’s a term that floats around in the tech world about the fabled “10x” engineer. It is often misconstrued as one engineer being able to replace the output of ten other “lesser” engineers. The reality is that every organization has multiple “10x” engineers. They don’t replace ten engineers; they make ten engineers better.",
  "translation": "传说中的“ 10x”工程师在科技界流传着一个名词。 它经常被误解为一名工程师能够替代其他十名“次级”工程师的输出。 现实情况是，每个组织都有多个“ 10倍”工程师。 他们不会取代十名工程师； 他们使十名工程师变得更好。"
}, {
  "tag": "P",
  "text": "“Train people well enough so they can leave, treat them well enough so they don’t want to.” — Richard Branson",
  "translation": "“对人们进行足够的培训，使他们可以离开，对他们进行足够的对待，以至于他们不想这样做。”-理查德·布兰森"
}, {
  "tag": "P",
  "text": "To let go of my old detailed concerns, I had to know to whom I was passing the torch. I needed to get to know my team; not just their birthday and favorite foods, but their capabilities, and more importantly: what they want their abilities to be. Only after you know what each team member needs can you begin to select a management style.",
  "translation": "为了放开我过去的详细问题，我必须知道将火炬传递给谁。 我需要认识我的团队； 不仅是他们的生日和最喜欢的食物，还有他们的能力，更重要的是：他们希望自己的能力如何。 只有知道了每个团队成员的需求之后，您才可以开始选择管理风格。"
}, {
  "tag": "P",
  "text": "Over the years, I’ve learned the truth about management styles: there is no true management style. Each person on your team may require different styles. Treating a senior engineer the same as a junior engineer will either piss them off or cause them to leave (or both). Junior engineers need more support, and possibly some “micro-management” at the beginning. However over time, that junior engineer that you had to hand-hold doesn’t want to be hand-held forever, and if they do, they are not growing, and you are failing.",
  "translation": "多年以来，我了解了有关管理风格的真相：没有真正的管理风格。 您团队中的每个人可能需要不同的风格。 与高级工程师一样对待高级工程师会惹怒他们或导致他们离开（或两者皆有）。 初级工程师需要更多的支持，一开始可能需要一些“微观管理”。 但是随着时间的流逝，您不得不手持的初级工程师并不想永远被手持，如果这样的话，它们就不会增长，并且您会失败。"
}, {
  "tag": "P",
  "text": "This concept of ever-changing teams and the growth of the individual team member opened my eyes to the real challenges of management: adapting management styles per person and over time.",
  "translation": "团队不断变化的概念以及团队成员的成长使我对管理的真正挑战敞开了眼界：随着时间的推移适应每人的管理风格。"
}, {
  "tag": "P",
  "text": "“Management is doing things right; leadership is doing the right things” — Peter F. Drucker",
  "translation": "“管理层在做正确的事； 领导正在做正确的事” –彼得·德鲁克（Peter F. Drucker）"
}, {
  "tag": "P",
  "text": "When you start at the company towards the beginning of their tech stack and stick around, you tend to become a prolific individual contributor to the code base. Often your style ends up becoming a defacto standard way of doing things. This “spread” happens either from other engineers agreeing with your style and more often than not, from more junior engineers copying and pasting in the code-base. Good or bad, this is an example of passive leadership. It’s usually the first sign that you are on the precipice of leadership.",
  "translation": "当您在公司开始其技术堆栈之初并坚持不懈时，您往往会成为代码库的多产个人贡献者。 通常，您的风格最终成为事实上的标准做事方式。 这种“传播”是由其他同意您的样式的工程师发生的，而且经常是由更多的初级工程师在代码库中复制和粘贴而发生的。 是好是坏，这是被动领导的一个例子。 通常这是您处于领导地位悬崖上的第一个迹象。"
}, {
  "tag": "P",
  "text": "Once promoted, I noticed that my team was continually scrutinizing everything I did. If I criticized how something was done, it couldn’t be for things that I do myself. If it is something that I also struggle with, I acknowledge it, and then I follow through on changing it in myself. I can’t expect more of my team than I expect of myself. It is vital to be an example of the qualities I wanted to instill in my team. Showing someone the right thing to do is much more powerful than telling them.",
  "translation": "晋升后，我注意到我的团队正在不断审查我所做的一切。 如果我批评某件事是如何完成的，那不是我自己做的事情。 如果我也对此感到挣扎，我会承认这一点，然后继续自己进行修改。 我对团队的期望比对自己的期望更高。 成为我要灌输给团队的素质的榜样至关重要。 向某人展示正确的事情比告诉他们要强大得多。"
}, {
  "tag": "P",
  "text": "“Honest communication is built on truth and integrity and upon respect of the one for the other.” — Benjamin E. Mays",
  "translation": "“诚实的沟通建立在真理和正直之上，并建立在彼此尊重的基础上。” —本杰明·梅斯"
}, {
  "tag": "P",
  "text": "If trust is the foundation of the team, then communication is the cornerstone. Considerable effort has to be employed in establishing regular communication with and amongst the team, not just one-on-one, but also how project details and decisions are shared. I realized that not all communication is going to flow through me. It is impossible to control, and indeed highly undesirable to do so. Encourage participation and open discussions, and more importantly, the rigor of documenting the action items or decisions made due to that discussion.",
  "translation": "如果信任是团队的基础，那么沟通就是基石。 与团队之间以及团队之间建立定期的沟通不仅要一对一，而且要如何共享项目细节和决策，都需要付出大量的努力。 我意识到并不是所有的交流都会贯穿我。 这是不可能控制的，实际上是非常不可取的。 鼓励参与和公开讨论，更重要的是，鼓励严格记录因该讨论而制定的行动项目或决策。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/0*vIwuIPxyaGSbo7dk.jpg?q=20",
  "caption": "In spite of the accuracy and levity of this comic, taking on the mundane so that the experts on your team can focus is sometimes required.",
  "type": "image",
  "file": "0*vIwuIPxyaGSbo7dk.jpg"
}, {
  "tag": "P",
  "text": "The hardest lesson I had to learn was the delegation of work, of which I still struggle with today. It is yet another strain against the individual contributor’s tendencies. Ultimately, it is a lack of trust in the team that made delegation so hard for me at the beginning. I frequently refer to letting go and trusting the team; delegating tasks of the project (even those difficult ones), is the manifestation of that trust.",
  "translation": "我必须学习的最难的教训是工作授权，今天我仍然在努力。 这是对个人贡献者趋势的又一压力。 归根结底，对团队缺乏信任使一开始对我来说如此艰难。 我经常提到放手和信任团队。 项目委托任务（甚至是那些艰巨的任务）就是这种信任的体现。"
}, {
  "tag": "P",
  "text": "The constant need to learn and stay up-to-date isn’t just for technical skills for me anymore, and I’m not done yet. Continuous learning, self-evaluation, and checking my hubris served me well as an individual contributor, and I believe these attributes to be equally if not more so important as a tech lead.",
  "translation": "对我而言，不断学习和保持最新状态的需求不再只是为了我的技术技能，而且我还没有完成。 不断的学习，自我评估和检查自己的傲慢精神使我作为个人贡献者受益匪浅，而且我相信这些属性对于技术领导者而言同样重要，甚至更为重要。"
}, {
  "tag": "P",
  "text": "Featured image by Markus Spiske",
  "translation": "精选图片Markus Spiske"
}]