[{
  "tag": "H1",
  "text": "10 Bad Habits of Unsuccessful People",
  "translation": "失败者的10个不良习惯"
}, {
  "tag": "H2",
  "text": "Instead of looking for traits to emulate, focus on ones to avoid",
  "translation": "与其寻找可模仿的特征，不如专注于避免"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/30/1*T_wCY9dpnq1jw-AM7BzZ2w.jpeg?q=20",
  "caption": "Photo: Lena Meyer/EyeEm/Getty Images",
  "type": "image",
  "file": "1*T_wCY9dpnq1jw-AM7BzZ2w.jpeg"
}, {
  "tag": "P",
  "text": "The first successful person I ever met — truly successful, with accomplishments I admired and ambition I strove to emulate — was an entrepreneur in his forties, a client of mine in the first real business I’d ever started. I was 24 and eager to learn; he was constantly cheerful, and had more money than he could count.",
  "translation": "我遇到的第一个成功人士-真正的成功，是我敬佩的成就和我努力奋斗的志向-是他四十多岁的企业家，也是我开办的第一个实际业务的客户。 我24岁，渴望学习。 他一直很开朗，拥有的金钱超出了他的数。"
}, {
  "tag": "P",
  "text": "We became close friends, and he told me eventually that he’d lost his wife, the love of his life, a half-decade before we met — the kind of loss, he said, that you never get over. It was a story that made his positive outlook seem all the more remarkable to me: Here was someone who had been through tragedy, and yet still made it a priority to do good things with his time and his money. He seemed to truly care about other people.",
  "translation": "我们成为了亲密的朋友，他最终告诉我，在我们相遇之前的十年里，他失去了妻子，一生的挚爱。他说，这是一种损失，永远无法克服。 这个故事使他的积极见解对我而言似乎更加引人注目：这是一个经历过悲剧的人，但仍然优先考虑用自己的时间和金钱来做好事。 他似乎真正在乎别人。"
}, {
  "tag": "P",
  "text": "Often, he’d tell me what he saw as the secret to his success: “I just try to avoid being unsuccessful,” he said. He studied what made someone (avoidably) unhappy, broke, or unmotivated — and then he avoided making the same mistakes.",
  "translation": "通常，他会告诉我他成功的秘诀：“我只是在努力避免失败，”他说。 他研究了使某人（不可避免地）感到不高兴，摔跤或失去动力的原因，然后他避免犯同样的错误。"
}, {
  "tag": "P",
  "text": "I knew in my bones that he was right. Too often, we adopt a plug-and-play attitude: “If I do x, I’ll be successful.” But if success was easy and predictable, we wouldn’t be seeking advice on how to achieve it. Instead of studying what’s worked for other people, I’ve followed my friend’s advice, paying close attention to the habits that hold people back from reaching their goals.",
  "translation": "我深知他是对的。 我们经常采取即插即用的态度：“如果我做x，我就会成功。”但是，如果成功是容易且可预测的，我们就不会寻求如何实现的建议。 我没有研究对别人有用的方法，而是按照朋友的建议，密切注意使人们无法实现目标的习惯。"
}, {
  "tag": "P",
  "text": "Here are 10 of the most common self-imposed barriers. If you find yourself bumping up against one, use them as a signal to reevaluate, reflect, and reverse course.",
  "translation": "这是10个最常见的自我施加的障碍。 如果您发现自己撞到了一个人，可以将它们用作重新评估，反思和逆转过程的信号。"
}, {
  "tag": "H2",
  "text": "1. Always being distracted",
  "translation": "1.总是分心"
}, {
  "tag": "P",
  "text": "In his book Essentialism, time-management consultant Greg McKeown describes running into a former classmate who was between jobs and looking for career advice. Midway through the conversation, the man looked down at his phone and began typing.",
  "translation": "时间管理顾问格雷格·麦考恩（Greg McKeown）在他的《本质主义》一书中描述了遇到一名前同学的经历，该同学介于工作和寻求职业建议之间。 谈话进行中，该名男子低头看着他的电话，开始打字。"
}, {
  "tag": "P",
  "text": "“Ten seconds went by,” McKeown recounts. “Then 20. I simply stood there as he continued to text away furiously.” After a couple minutes, he gave up and walked away.",
  "translation": "“十秒钟过去了，”麦基翁回忆道。 “然后20。我只是站在那儿，因为他继续发疯地发短信。”几分钟后，他放弃了，走开了。"
}, {
  "tag": "P",
  "text": "I think of this story whenever I feel pulled in many different directions, as a way of reminding myself to focus on the moment I’m in and the people I’m with. If that old classmate of McKeown’s had reminded himself the same thing, he might have made a connection or gotten a tip that led him to a job.",
  "translation": "每当我感到朝着不同的方向前进时，我都会想起这个故事，以此提醒自己专注于自己所在的时刻和与之在一起的人。 如果McKeown的那位老同学提醒自己同样的事情，那么他可能已经建立了联系或获得了帮助他工作的小费。"
}, {
  "tag": "H2",
  "text": "2. Only talking the talk",
  "translation": "2.只说话"
}, {
  "tag": "P",
  "text": "“I’m training for a marathon.” “I’m starting a business.” You know what’s better than announcing something on social media? Doing it.",
  "translation": "“我正在训练马拉松。”“我正在创业。”您知道什么比在社交媒体上宣布要好吗？ 正在做。"
}, {
  "tag": "P",
  "text": "In his 2010 TED talk, “Keep You Goals to Yourself,” entrepreneur Derek Sivers argued that broadcasting your plans can be counterproductive rather than motivating. People will often applaud you simply for stating your intention, he said, and somewhat counterintuitively, that applause can sap your will to actually follow through on the plans you’ve just outlined.",
  "translation": "在他的2010年TED演讲中，企业家德里克·西弗斯（Derek Sivers）表示，广播您的计划可能适得其反，而不是激励。 他说，人们常常会为您的意图而称赞您，而有些反直觉的是，掌声会削弱您按照实际制定的计划进行实践的意愿。"
}, {
  "tag": "P",
  "text": "“When you tell someone your goal and they acknowledge it, psychologists have found that it’s called a ‘social reality,’” Sivers explained in his talk. “The mind is kind of tricked into feeling that it’s already done. And then because you’ve felt that satisfaction, you’re less motivated to do the actual hard work necessary.”",
  "translation": "西弗斯在演讲中解释说：“当您告诉某人您的目标并得到他们的认可时，心理学家会发现这被称为'社会现实'。” “头脑有点被骗到感觉已经完成了。 然后，因为您感到了这种满足感，所以您没有动力去做必要的实际努力。”"
}, {
  "tag": "P",
  "text": "There’s nothing wrong with sharing your joy. But try to hold your tongue until you’ve got good news, not just good intentions.",
  "translation": "分享快乐没有错。 但是，请尽量保持警惕，直到获得好消息，而不仅仅是好心。"
}, {
  "tag": "H2",
  "text": "3. Spending time with the wrong people",
  "translation": "3.与错误的人共度时光"
}, {
  "tag": "P",
  "text": "The friends you surround yourself with can encourage you to be your best self, or they can bring out your worst tendencies. Do you have a goal to get healthier, for example? Hang out with people who will encourage you to make those changes in your life. Want to utterly fail in that goal? Spend time with ones who revel in their own bad habits. People feed off each other’s energy.",
  "translation": "与自己相处的朋友可以鼓励您成为自己最好的自己，也可以发挥出自己最坏的倾向。 例如，您是否有一个变得健康的目标？ 与鼓励您做出改变的人们一起出去玩。 想要彻底失败吗？ 与那些沉迷于自己的不良习惯的人共度时光。 人们互相消耗能量。"
}, {
  "tag": "H2",
  "text": "4. Always focusing on the negative",
  "translation": "4.始终专注于负面"
}, {
  "tag": "P",
  "text": "As my friend showed me years ago when he told me about his grief, you can focus on the positive without pretending life is easy. You can have a realistic perspective without pointing out the bad in everything you see.",
  "translation": "正如我的朋友几年前告诉我的关于他的悲伤时告诉我的那样，您可以专注于积极的事情而无需假装生活容易。 您可以有一个现实的观点，而不必指出所看到的一切缺点。"
}, {
  "tag": "P",
  "text": "We all know the person who complains about everything. “Ugh, it poured this morning, and my shoes got soaked.” Yes, that sucks. No, you can’t change the weather. You can put on a new pair of shoes.",
  "translation": "我们都知道抱怨一切的人。 “哦，今天早上倒了，我的鞋子湿透了。”是的，这太糟了。 不，你不能改变天气。 您可以穿一双新鞋。"
}, {
  "tag": "P",
  "text": "Having a bad day is okay — everyone gets irritable once in a while. But if you always hate everything, you’re having a bad life. It’s that simple.",
  "translation": "日子不好过没事-每个人都会偶尔感到烦躁。 但是，如果您始终讨厌一切，那您的生活就会很糟糕。 就这么简单。"
}, {
  "tag": "H2",
  "text": "5. Procrastinating",
  "translation": "5.拖延"
}, {
  "tag": "P",
  "text": "In college, I once asked a professor to extend a deadline for an essay. His reply: “I’m perfectly happy to extend your deadline by a week. The only thing I’m asking you is, will your essay be better if you hand it in a week from now?”",
  "translation": "在大学里，我曾经请一位教授延长论文的截止日期。 他的回答是：“很高兴将您的截止日期延长一周。 我唯一要问的是，如果您从现在起一周内提交论文，您的论文会更好吗？”"
}, {
  "tag": "P",
  "text": "We both knew the answer was “no.” I worked my ass off to finish it on time.",
  "translation": "我们俩都知道答案是“否”。我努力工作以按时完成任务。"
}, {
  "tag": "P",
  "text": "Only delay things when you’ll do a better job with that extra time. Do it now, or do it better later.",
  "translation": "只有在您有更多时间可以做得更好的情况下，才延迟工作。 现在就做，或者以后再做。"
}, {
  "tag": "H2",
  "text": "6. Not listening to others",
  "translation": "6.不听别人的话"
}, {
  "tag": "P",
  "text": "Being a good listener can steer you in the right direction, but in the long term, it also helps you maintain close, valuable relationships.",
  "translation": "成为一个好的倾听者可以引导您朝正确的方向发展，但从长远来看，它也可以帮助您保持亲密而宝贵的关系。"
}, {
  "tag": "P",
  "text": "Everyone can give a hug, but not everybody calls just to ask, “How are you?” Put in the time. Ask, listen, care, repeat.",
  "translation": "每个人都可以拥抱，但不是每个人都只是问：“你好吗？”。 问，听，关心，重复。"
}, {
  "tag": "H2",
  "text": "7. Giving in to laziness",
  "translation": "7.懒惰"
}, {
  "tag": "P",
  "text": "We all have moments where we’re tempted to cancel plans. Sometimes, the effort of leaving the house can feel Herculean, even for something “fun.”",
  "translation": "我们都有想被取消计划的时刻。 有时，即使是为了“有趣”，离开家的努力也会让人感到艰辛。"
}, {
  "tag": "P",
  "text": "But new and novel experiences are what makes life beautiful. When you give in to laziness, you’re not fully participating in your own life — which also isn’t fair to your friends, family, partner, and the other people who want to share it with you.",
  "translation": "但是，新颖而新颖的经历才是使生活更美好的原因。 当您屈从于懒惰时，您并没有完全参与自己的生活，这对您的朋友，家人，伴侣和其他想要与您分享的人也不公平。"
}, {
  "tag": "H2",
  "text": "8. Not being curious",
  "translation": "8.不好奇"
}, {
  "tag": "P",
  "text": "It used to be that if your dad was a farmer — and you were a man — you became a farmer. Women didn’t get to choose what they wanted to be. And the ability to learn things beyond your immediate world was limited, if not impossible.",
  "translation": "过去，如果您的父亲是一个农民，而您是一个男人，那么您就成为了农民。 女人没有选择想要的样子。 而且，即使不是不可能，学习超出您的直接世界的事物的能力也受到限制。"
}, {
  "tag": "P",
  "text": "Today, access to information is easier than it’s ever been. Obviously, there are still structural barriers that limit what people can do, but those who take advantage of this access to information — who read books, who ask questions, who follow their curiosity — have more power to envision, and shape, their futures. It’s hard to dream about what you don’t know.",
  "translation": "如今，信息访问比以往任何时候都容易。 显然，仍然存在限制人们行动能力的结构性障碍，但是那些利用这种信息访问权的人（读书，问问题，追随好奇心的人）拥有更大的力量来设想和塑造自己的未来。 梦见你不知道的事很难。"
}, {
  "tag": "H2",
  "text": "9. Not being nice",
  "translation": "9.不好"
}, {
  "tag": "P",
  "text": "Just be a nice person. If you have difficulty defining what a “nice person” is, you’re likely a jerk.",
  "translation": "成为一个好人。 如果您难以定义“好人”是什么，那么您很可能会混蛋。"
}, {
  "tag": "H2",
  "text": "10. Giving up",
  "translation": "10.放弃"
}, {
  "tag": "P",
  "text": "“The most certain way to succeed,” Thomas Edison once said, “is always to try just one more time.” Success, however you define it, never came from not trying. And often, it comes after first failing time and time again.",
  "translation": "托马斯·爱迪生（Thomas Edison）曾说：“成功的最确定方法就是总是再尝试一次。”成功（无论您定义了什么）都绝非没有尝试。 通常，它是在一次又一次的失败之后出现的。"
}]