[{
  "tag": "P",
  "text": "About the author-:",
  "translation": "关于作者-："
}, {
  "tag": "P",
  "text": "Ravi Rajan is a global IT program manager based out of Mumbai, India. He is also an avid blogger, Haiku poetry writer, archaeology enthusiast, and history maniac. Connect with Ravi on LinkedIn, Medium and Twitter.",
  "translation": "Ravi Rajan是位于印度孟买的全球IT计划经理。 他还是一位狂热的博客作者，Hai句诗作家，考古爱好者和历史狂人。 在LinkedIn，Medium和Twitter上与Ravi联系。"
}, {
  "tag": "H1",
  "text": "Lastly, respect them.",
  "translation": "最后，尊重他们。"
}, {
  "tag": "P",
  "text": "Respect does not only mean a lack of respect shown by someone. It also means how you as a manager handled the lack of respect shown to them. If you as a manager failed to react strongly, you are also guilty as hell.",
  "translation": "尊重不仅意味着某人缺乏尊重。 这也意味着您作为经理如何处理对他们的尊重。 如果您作为经理没有做出强烈反应，您也会感到内hell。"
}, {
  "tag": "P",
  "text": "That said, respect has many dimensions. Good developers not only crave respect from managers and co-workers but they also expect respect for the skills they have acquired over the years.",
  "translation": "也就是说，尊重有很多方面。 优秀的开发人员不仅渴望得到经理和同事的尊重，而且还希望尊重他们多年来获得的技能。"
}, {
  "tag": "P",
  "text": "If you continuously assign them some work, that does not challenge them or help them to learn something new, you create a feeling of underutilization within them that finally leads to frustration and quitting. Good developers always need to be challenged by their superiors. If they aren’t, they might deteriorate from being the best developer there ever was.",
  "translation": "如果您不停地给他们分配一些工作，而不是挑战他们或帮助他们学习新知识，您就会在他们内部产生一种利用不足的感觉，最终导致沮丧和戒烟。 好的开发人员总是需要受到上级的挑战。 如果不是这样，他们可能会成为有史以来最好的开发商而恶化。"
}, {
  "tag": "P",
  "text": "Again another dimension of respect is compensation also. If developer skills are not being respected enough to give a higher compensation, increment or promotion, they will leave. The key is identifying their skills, play to their skills and give all benefits possible befitting their skills.",
  "translation": "尊重的另一个方面也是补偿。 如果开发人员的技能没有得到足够的尊重以提供更高的报酬，增值或晋升，他们将离开。 关键是确定他们的技能，发挥他们的技能，并根据他们的技能提供所有可能的收益。"
}, {
  "tag": "P",
  "text": "While all managers might not have executive powers to decide compensation, but at the bare minimum, recommending a good developer’s work to the decision-making superiors might help to keep his motivation levels high.",
  "translation": "尽管所有管理人员可能没有执行权来决定薪酬，但从最低限度来看，向决策上级推荐优秀的开发人员的工作可能有助于保持其较高的动机水平。"
}, {
  "tag": "P",
  "text": "As Julius Erving has rightly said.",
  "translation": "正如朱利叶斯·欧文（Julius Erving）正确说的那样。"
}, {
  "tag": "P",
  "text": "“I firmly believe that respect is a lot more important, and a lot greater, than popularity.”",
  "translation": "“我坚信，尊重比普及更重要，也更重要。”"
}, {
  "tag": "H1",
  "text": "Don’t push them into management roles based on experience.",
  "translation": "不要根据经验将他们推入管理职位。"
}, {
  "tag": "P",
  "text": "The biggest mistake any organization can do is push its most talented experienced developer to management track, especially when they are not up to it.",
  "translation": "任何组织所能做的最大错误就是将其最有才华的经验丰富的开发人员推向管理轨道，尤其是在他们无法做到这一点时。"
}, {
  "tag": "P",
  "text": "Traditionally most career paths are linear. which often means pushing top talent down a management track, supervising others. Organizations often assume wrongly that if a developer is experienced, he can very well manage others. An experienced developer might enjoy teaching other developers but he might not cut for the job of managing others.",
  "translation": "传统上，大多数职业道路都是线性的。 这通常意味着将顶尖人才推向管理轨道，监督他人。 组织经常错误地认为，如果有经验的开发人员，他就可以很好地管理其他人。 有经验的开发人员可能喜欢教其他开发人员，但他可能不会为管理其他开发人员而努力。"
}, {
  "tag": "P",
  "text": "Management is really about getting work done through others, which makes it highly people-focused. Mentoring or instructing–especially when it comes to software development–is more about a knowledge-transfer of technical skills. If a management role is shoved down a developer’s throat, that will be the worst thing that can happen to him personally and professionally.",
  "translation": "管理实际上是通过他人来完成工作，这使它成为高度以人为本的。 指导或指导（尤其是在软件开发方面）更多地是关于技术技能的知识转移。 如果把管理角色推到开发者的喉咙上，那将是他个人和职业可能发生的最糟糕的事情。"
}, {
  "tag": "P",
  "text": "Instead, offer your best senior developers a separate path for technical experts to advance up the ranks based on how well they help their junior colleagues mentor even if that doesn’t involve managing their work. You can also help them gain additional knowledge and certifications which can help them to stay on a path they enjoy.",
  "translation": "取而代之的是，为您最好的高级开发人员提供一条单独的途径，让技术专家根据他们对下级同事的指导有多好的帮助来提高他们的职级，即使这不涉及管理工作。 您还可以帮助他们获得更多的知识和认证，从而帮助他们走在自己喜欢的道路上。"
}, {
  "tag": "P",
  "text": "As Jason Cole technology consultant rightly says.",
  "translation": "正如Jason Cole技术顾问所说的那样。"
}, {
  "tag": "P",
  "text": "“The number-one reason technical people quit is because they don’t have the option to advance without going into management.”",
  "translation": "“技术人员离职的第一原因是因为他们没有进入管理层就没有前进的选择。”"
}, {
  "tag": "H1",
  "text": "Trust them.",
  "translation": "相信他们"
}, {
  "tag": "P",
  "text": "Psychologist Daniel Pink writes in his book The Drive that people are driven by autonomy, mastery, and purpose.",
  "translation": "心理学家丹尼尔·平克（Daniel Pink）在他的著作《驱动器》中写道，人们受自主，专精和目标的驱动。"
}, {
  "tag": "P",
  "text": "Good developers need to be trusted even in situations when they make mistakes. The more you trust, the more they shine in their work. Managers who constantly micromanage their developers keep questioning their every decision and expect them to take their approval for every code fix severely demotivate the team.",
  "translation": "优秀的开发人员即使在犯错误的情况下也需要得到信任。 您越信任，他们在工作中就越有魅力。 经常对开发人员进行微观管理的经理不断质疑他们的每一个决定，并期望他们对每一个代码修复都表示认可，这严重削弱了团队的动力。"
}, {
  "tag": "P",
  "text": "High performing developers don’t typically need this level of oversight. Instead, they thrive in environments where there is a high level of trust and autonomy.",
  "translation": "高效能的开发人员通常不需要这种监督。 相反，它们在高度信任和自治的环境中蓬勃发展。"
}, {
  "tag": "P",
  "text": "If you want to retain your best developer, it all begins and ends with you as a manager. Your job is to trust and guide your team, to support them in their roles and let them shine. When you learn to let go and trust your team, they will deliver at levels you never even imagined.",
  "translation": "如果您想保留最好的开发人员，那么一切都以您作为经理开始和结束。 您的工作是信任和引导您的团队，支持他们的角色并让他们发光。 当您学会放手并信任您的团队时，他们将提供您甚至从未想象过的水平。"
}, {
  "tag": "P",
  "text": "Discover your best developers’’ intrinsic motivations — like fun, personal development, autonomy, purpose — and enhance these to decrease their chance of disillusionment.",
  "translation": "发现最佳开发人员的内在动机，例如娱乐，个人发展，自主权，目标，并增强这些内在动机以减少幻灭的机会。"
}, {
  "tag": "H1",
  "text": "Give them growth opportunities.",
  "translation": "给他们成长的机会。"
}, {
  "tag": "P",
  "text": "Most often, managers misunderstand flexibility and developer empowerment by giving them the freedom to pursue their own career choices. This often leads to situations where developers are caught unawares of what they need to do to go to the next level.",
  "translation": "多数情况下，经理给他们自由选择自己的职业选择的机会，从而误解了灵活性和开发人员的能力。 这通常会导致以下情况：开发人员不知道要进入下一个级别需要做什么。"
}, {
  "tag": "P",
  "text": "As Diane Scarborough, VP for People and Culture at Sprint Connect says aptly.",
  "translation": "正如Sprint Connect的人文与文化副总裁Diane Scarborough所说的那样。"
}, {
  "tag": "P",
  "text": "“It’s easy to tell people you’re in charge of your own career, but it doesn’t work if you don’t support them. Nobody wins if you don’t help them.”",
  "translation": "“很容易告诉人们您负责自己的职业，但是如果您不支持他们，这是行不通的。 如果您不帮助他们，没人会赢。”"
}, {
  "tag": "P",
  "text": "Leaving developers on their own without any career support or guidance is a recipe for dissatisfaction. A developer might not know what professional development he needs to advance further and also on top of that, he will be so much occupied with his work that, he might not be looking at his skills or figuring out how they might be applied better.",
  "translation": "在没有任何职业支持或指导的情况下独自留下开发人员是造成不满的原因。 开发人员可能不知道他需要进一步提高什么专业水平，而且最重要的是，他会被工作所困扰，以至于他可能没有在看他的技能，也没有弄清楚如何更好地运用它们。"
}, {
  "tag": "P",
  "text": "So, rather than having a once-a-year appraisal meeting and discussion on career opportunities as a formality, managers need to discuss with their developers on a regular basis about professional advancement opportunities available within the organization and discuss the best ways to support them in order to help them to get more out their work.",
  "translation": "因此，管理人员需要定期与开发人员讨论组织内部可用的专业晋升机会，而不是每年举行一次评估会议并就职业机会进行正式讨论，并讨论支持他们的最佳方法。 为了帮助他们更多地利用他们的工作。"
}, {
  "tag": "P",
  "text": "Remember, building a culture of continuous learning and improvement is what will keep your most valuable developer on board. And it all starts with having more conversations more often.",
  "translation": "请记住，建立持续学习和改进的文化将使您最有价值的开发人员留在公司。 一切始于更多的对话。"
}, {
  "tag": "P",
  "text": "When your best developers are happy, they will make sure that their smartest friends also join them. Simple as that.",
  "translation": "当您最好的开发人员感到高兴时，他们将确保最聪明的朋友也加入其中。 就那么简单。"
}, {
  "tag": "H1",
  "text": "Don’t promote teamwork. Promote excellence.",
  "translation": "不要促进团队合作。 促进卓越。"
}, {
  "tag": "P",
  "text": "Treating everyone equally. Teamwork is important. Everyone should be a team player. While it may sound good, not everybody is equal. Some produce more, some fewer results.",
  "translation": "平等对待每个人。 团队合作很重要。 每个人都应该是团队合作者。 虽然听起来不错，但并非每个人都是平等的。 有些产生更多，有些产生更少。"
}, {
  "tag": "P",
  "text": "The problem happens, when in the guise of teamwork, we start promoting mediocrity. Some of the top developers might not be excellent team players. Putting them together with a bunch of C-players is not good for anyone. This is not to say that team or teamwork is not important. But excess teamwork which squashes the creativity of a top developer is a recipe for disaster.",
  "translation": "问题是，当我们以团队合作为幌子时，我们开始提倡平庸。 一些顶级开发人员可能不是优秀的团队合作者。 将它们与一堆C播放器放在一起对任何人都不好。 这并不是说团队或团队合作并不重要。 但是，过度的团队合作削弱了顶级开发人员的创造力，这是灾难的根源。"
}, {
  "tag": "P",
  "text": "You need to have some mechanism in place to reward and recognize good work that is beyond the run-of-the-mill stuff. You need to shout and scream all the way to the top if any top developer has achieved outstanding results. Make them shine, encourage them and make them as a catalyst for other developers to learn and improve from.",
  "translation": "您需要建立某种机制来奖励和认可超越常规的出色工作。 如果任何顶尖的开发人员都取得了出色的成绩，则需要一直喊到最高处。 使它们发光，鼓励它们，并使其成为其他开发人员学习和改进的催化剂。"
}, {
  "tag": "P",
  "text": "Recognizing talent and expertise at regular intervals will make your best developers feel valued within the team and will also help to create a win-win situation for all.",
  "translation": "定期认可人才和专业知识将使您最好的开发人员在团队中感到有价值，也将帮助所有人建立双赢局面。"
}, {
  "tag": "H1",
  "text": "How to Stop Your Best Developers from Quitting.",
  "translation": "如何阻止最佳开发人员退出。"
}, {
  "tag": "H2",
  "text": "Best developers need to be constantly engaged.",
  "translation": "最好的开发人员需要不断参与。"
}, {
  "tag": "FIGURE",
  "image": "https://miro.medium.com/max/60/1*RALBKymKv0F428Giq9dlMg.jpeg?q=20",
  "caption": "Image Credits: Pixabay.com",
  "type": "image",
  "file": "1*RALBKymKv0F428Giq9dlMg.jpeg"
}, {
  "tag": "P",
  "text": "It’s Friday afternoon and one of your best developers asks for a private meeting. Before you even close the door, she tells you she’s found another job and is leaving the company.",
  "translation": "今天是星期五下午，您最好的开发人员之一要求召开私人会议。 在您甚至关上门之前，她告诉您她找到了另一份工作并将离开公司。"
}, {
  "tag": "P",
  "text": "“I’ve decided to take a job offer at another company.”",
  "translation": "“我已经决定接受另一家公司的工作机会。”"
}, {
  "tag": "P",
  "text": "Oh, shit.",
  "translation": "妈的。"
}, {
  "tag": "P",
  "text": "Imagine getting punched in the stomach.",
  "translation": "想象一下肚子被打。"
}, {
  "tag": "P",
  "text": "And then, instead of recovering in a few minutes, the shock and surprise slowly turn into disappointment, anger, and dread.",
  "translation": "然后，震惊和惊奇并没有在几分钟之内恢复，而是慢慢变成了失望，愤怒和恐惧。"
}, {
  "tag": "P",
  "text": "“How can you do this to me?",
  "translation": "“你怎么能这样对我？"
}, {
  "tag": "P",
  "text": "“How can we meet the go-live date. We are so close”",
  "translation": "“我们如何满足上线日期。 我们是如此亲密”"
}, {
  "tag": "P",
  "text": "“This is not OK. I never expected this from you.”",
  "translation": "“这不行。 我从没想到你会这样。”"
}, {
  "tag": "P",
  "text": "It doesn’t matter that these questions weren’t the right ones to be asked. It does not matter if she has turned out to be self-centred or plain selfish. It does not matter that you had big plans for her. The fact is that she has decided to move on and you just get reduced to the role of a stable owner who bolts the stable after the horse has bolted.",
  "translation": "这些问题不是正确的问题都没关系。 事实证明她以自我为中心还是自私自利都没关系。 您为她制定了宏大计划并不重要。 事实是，她决定继续前进，而您只是沦为马stable所有者的角色，他在马拴好后拴住马stable。"
}, {
  "tag": "P",
  "text": "How will you respond? Who will cover her responsibilities? What is the impact on the rest of the team? These questions torment you as you wish you had known her intention earlier to be better prepared.",
  "translation": "您将如何回应？ 谁来承担她的责任？ 对团队其他成员有什么影响？ 这些问题困扰着您，就像您希望您早些时候知道她的意图以作更好的准备一样。"
}, {
  "tag": "P",
  "text": "That said, resignations represent one of the most emotional, stressful and challenging situations managers face. They undermine confidence in ourselves, our leadership and our organizations. They threaten the status quo.",
  "translation": "也就是说，辞职代表了管理人员面临的最激动，最紧张和最具挑战性的情况之一。 他们破坏了对我们自己，我们的领导和我们的组织的信心。 他们威胁着现状。"
}, {
  "tag": "P",
  "text": "And they have the potential to compromise team dynamics and business results. And there isn’t always just one “smoking gun” reason that makes a good developer quit, as it’s typically a combination of things that weigh on their minds and impact their decision to quit over time.",
  "translation": "他们有可能损害团队动力和业务成果。 而且，并非总是有一个“吸烟者”会导致优秀的开发人员退出，原因通常是多种因素结合在一起，这些因素困扰着他们，并随着时间的推移影响他们退出的决定。"
}, {
  "tag": "P",
  "text": "The good news is that any developer quits far before in his mind he actually puts in his papers. So once any manager is able to identify the potential reasons beforehand and address the concerns accordingly, good developers can very well be encouraged and motivated and stay on. And key in most of the cases is getting them engaged at the right levels. Good developers need to be constantly engaged to get the best of them.",
  "translation": "好消息是，任何开发人员在实际投入论文之前都已退出。 因此，一旦任何经理能够事先确定潜在原因并相应解决问题，就可以很好地鼓励和激励优秀的开发人员并继续前进。 在大多数情况下，关键在于使他们参与正确的工作。 优秀的开发人员需要不断投入才能获得最好的收益。"
}, {
  "tag": "P",
  "text": "And you need to engage them by offering them uniquely tailored appealing narratives based on their skills, aptitude, and attitude. Make sure that you take them aside and reaffirm that narrative to them frequently. And make sure the narrative is aligned in such a way that their own actions allow them to move toward one of their goals.",
  "translation": "您需要根据他们的技能，才能和态度为他们提供量身定制的吸引人的叙事，从而吸引他们。 确保您将它们放在一边，并经常重申对他们的叙述。 并确保叙述方式一致，以使他们自己的行动使他们朝自己的目标之一迈进。"
}, {
  "tag": "P",
  "text": "Here are some ways to go about it.",
  "translation": "这里有一些解决方法。"
}, {
  "tag": "PRE",
  "text": "(本文翻译自Ravi Shankar Rajan的文章《How to Stop Your Best Developers from Quitting.》，参考：https://medium.com/swlh/how-to-stop-your-best-developers-from-quitting-8e251c110f36)",
  "translation": "（本文翻译自Ravi Shankar Rajan的文章，《如何阻止优秀的开发人员退出。》，参考：https：//medium.com/swlh/how-to-stop-your-best-developers-from-quitting-8e251c110f36 ）"
}]